[{"qText": "S1: A force of exists between everybody in the universe.\nP : Normally it is very small but when the one of the bodies is a planet, like earth, the force is considerable.\nQ : It has been investigated by many scientists including Galileo and Newton.\nR : Everything on or near the surface of the earth is attracted by the mass of earth.\nS : This gravitational force depends on the mass of the bodies involved.\nS6: The greater the mass, the greater is the earth's force of attraction on it. We can call this force of attraction gravity.\nThe Proper sequence should be:", "ans": ["PRQS", "PRSQ", "QSRP", "QSPR"], "correct": "QSPR", "solution": "It has been investigated by many scientists including Galileo and Newton. This gravitational force depends on the mass of the bodies involved. Normally it is very small but when the one of the bodies is a planet, like earth, the force is considerable. Everything on or near the surface of the earth is attracted by the mass of earth."}, {"qText": "S1: Calcutta unlike other cities kepts its trams.\nP : As a result there horrendous congestion.\nQ : It was going to be the first in South Asia.\nR : They run down the centre of the road.\nS : To ease in the city decided to build an underground railway line.\nS6: The foundation stone was laid in 1972.\nThe Proper sequence should be:", "ans": ["PRSQ", "PSQR", "SQRP", "RPSQ"], "correct": "RPSQ", "solution": "They run down the centre of the road. As a result there horrendous congestion. To ease in the city decided to build an underground railway line. It was going to b the first in South Asia."}, {"qText": "S1: For some time in his youth Abraham Lincoln was manager for a shop.\nP : Then a chance Customer would come.\nQ : Young Lincoln way of keeping shop was entirely unlike anyone else's.\nR : Lincoln would jump up and attend to his needs and then revert to his reading.\nS : He used to lie full length on the counter of the shop eagerly reading a book.\nS6: Never before had Lincoln had so much time for reading as had then.\nThe Proper sequence should be:", "ans": ["SRQP", "QSPR", "SQRP", "QPSR"], "correct": "QSPR", "solution": "Young Lincoln way of keeping shop was entirely unlike anyone else’s. He used to lie full length on the counter of the shop eagerly reading a book. Then a chance customer would come. Lincoln would jump up and attend to his needs and then revert to his reading."}, {"qText": "S1: All the land was covered by the ocean.\nP : The leading god fought the monster, killed it and chopped its body in to two halves.\nQ : A terrible monster prevented the gods from separating the land from the water.\nR : The god made the sky out of the upper part of the body and ornamented it with stars.\nS : The god created the earth from the lower part, grew plants on it and populated it with animals.\nS6: The god moulded the first people out of clay according to his own image and mind.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "QPSR", "QPRS"], "correct": "QPRS", "solution": "A terrible monster prevented the gods from separating the land from the water. The leading god fought the monster, killed it and chopped its body into two halves. The god made the sky out of the upper part of the body and ornamented it with stars. The god created the earth from the lower part, grew plants on it and populated it with animals."}, {"qText": "S1: Smoke oozed up between the planks.\nP : Passengers were told to be ready to quit the ship.\nQ : The rising gale fanned the smouldering fire.\nR : Everyone now knew there was fire on board.\nS : Flames broke out here and there.\nS6: Most people bore the shock bravely.\nThe Proper sequence should be:", "ans": ["SRQP", "QPSR", "RSPQ", "QSRP"], "correct": "SRQP", "solution": "Through the ages, plants have evolved from simple to more complex forms. First there were water plants then land plants appeared during the Paleozoic era. Records of the history of the world are contained in fossils. But since the fossil remains appear locked in rock layers, they are closely related to the geologist area of investigation."}, {"qText": "S1: You know my wife, Madhavi, always urged me to give up smoking.\nP : I really gave it up.\nQ : And so When I went to jail I said to myself I really must give it up, if for no other reason than of being self-reliant.\nR : When I emerged from jail, I wanted to tell her of my great triumph.\nS : But when I met her, there she was with a packet of cigarettes.\nS6: poor girl!.\nThe Proper sequence should be:", "ans": ["PSRQ", "SPQR", "QPRS", "RSPQ"], "correct": "QPRS", "solution": "And so when I went to jail I said to myself I really must give it up, if for no other reason than of being self-reliant. I really gave it up. When I emerged from jail, I want to tell her of my great triumph. But when I met her, there she was with a packet of cigarettes."}, {"qText": "S1: When a satellite is launched, the rocket begins by going slowly upwards through the air.\nP : However, the higher it goes, the less air it meets.\nQ : As the rocket goes higher, it travels faster.\nR : For the atmosphere becomes thinner.\nS : As a result there is less friction.\nS6: Consequently, the rocket still does not become too hot.\nThe Proper sequence should be:", "ans": ["QPRS", "QSPR", "PQRS", "PQSR"], "correct": "QPRS", "solution": "As the rocket goes higher, it travels faster. However, the higher it goes, the less air it meets. For the atmosphere becomes thinner. As a result there is less friction."}, {"qText": "S1: A father having offered to take the baby out in a perambulator, was tempted by the sunny morning to slip into a pub for a glass of beer.\nP : Indignant at her husband's behaviour, she decided to teach him a lesson.\nQ : She wheeled away the pram.\nR : A little later, his wife came by, where to her horror, she discovered her sleeping baby.\nS : Leaving the pram outside, he disappeared inside the bar.\nS6: She waited for him, anticipating the white face and quivering lips which would soon appear with the news that the baby had been stolen.\nThe Proper sequence should be:", "ans": ["SRPQ", "RQPS", "SPQR", "PQSR"], "correct": "SRPQ", "solution": "Leaving the pram outside, he disappeared inside the bar. A little later, his wife came by, where to her horror, she discovered her sleeping baby. Indignant at her husband’s behavior, she decided to teach him a lesson. She wheeled away the pram."}, {"qText": "S1: The city is almost a slum and stinks most of time.\nP : The slush on the road did not deter them.\nQ : The occasional slips and falls were considered a small price to pay for the trip.\nR : They were excited, fascinated by the sight of fresh snow on the roads.\nS : Even so, it looked beautiful to tourists of various categories.\nS6: But some visitors came away with the unforgettable sight of young labours scantily clad.\nThe Proper sequence should be:", "ans": ["RQPS", "QPRS", "RSQP", "SPQR"], "correct": "SPQR", "solution": "Even so, it looked beautiful to tourists of various categories. The slush on the road did not deter them. The occasional slips and falls were considered a small price to pay for the trip. They were excited, fascinated by the sight of fresh snow on the roads."}, {"qText": "S1: Venice is a strange and beautiful city in the north of Italy.\nP : There are about four hundred old stone bridges joining the island of Venice.\nQ : In this city there are no motor cars, no horses, no buses.\nR : These small islands are near one another.\nS : It is not an island but a hundred and seventeen islands.\nS6: This is because Venice has no streets.\nThe Proper sequence should be:", "ans": ["PQRS", "PRQS", "SRPQ", "PQSR"], "correct": "SRPQ", "solution": "It is not an island but a hundred and seventeen islands. These small islands are near one another. There are about four hundred old stone bridges joining the island of Venice. In this city there are no motor cars, no horses, no buses."}, {"qText": "S1: The Hound of Baskervilles was feared by the people of the area.\nP : Some people spoke of seeing a huge, shadowy form a Hound at midnight on the moor.\nQ : But they spoke of it in tones of horror.\nR : Nobody had actually seen the hound.\nS : This shadowy form did not reveal any details about the animal.\nS6: The Hound of Baskervilles remains an unsolved mystery.\nThe Proper sequence should be:", "ans": ["SPQR", "SPRQ", "PSRQ", "PQRS"], "correct": "PSRQ", "solution": "Some people spoke of seeing a huge, shadowy form a Hound at midnight on the moor. This shadowy form did not reveal any details about the animal. Nobody had actually seen the hound. But they spoke of it in tones of horror."}, {"qText": "S1: A gentleman who lived alone always had two plates placed on the table at dinner time.\nP : One day just as he sat down to dine, the cat rushed in to the room.\nQ : One plate was for himself and other was for his cat.\nR : she drooped a mouse into her own plate and another into her master plate.\nS : He used to give the cat a piece of meat from his own plate.\nS6: In this way the cat showed her gratitude to her master.\nThe Proper sequence should be:", "ans": ["QSPR", "PSRQ", "QRSP", "RPQS"], "correct": "QSPR", "solution": "One plate was for himself and other was for his cat. He used to give the cat a piece of meat from his own plate. One day just as he sat down to dine, the cat rushed into the room. She dropped a mouse into her own plate and another, into her master plate."}, {"qText": "S1: Ants eat worms, centipedes and spiders.\nP : They are usually much quicker than the ant itself.\nQ : Nevertheless, these animals do not make easy game for ants.\nR : Besides, they have an extraordinary number of ways of escaping.\nS : They also eat larvae and insect adults such as flies, moths and spring tails.\nS6: Some jump, and some give out a pungent repellent substance.\nThe Proper sequence should be:", "ans": ["SQPR", "SPRQ", "SQRP", "SRQP"], "correct": "SQPR", "solution": "They also eat larvae and insect adults such as flies, moths and spring tails. Nevertheless, these animals do not make easy game for ants. They are usually much quicker than the ant itself. Besides, they have an extraordinary number of ways of escaping."}, {"qText": "S1: Satyajit Ray made several films for children.\nP : Later film makers have followed his lead.\nQ : Today other nations are making the children's film in a big way.\nR : This was at a time when no director considered children as potential audience.\nS : Ray was, thus, a pioneer in the field.\nS6: But today few think of Ray as a maker of children's films.\nThe Proper sequence should be:", "ans": ["PSRQ", "RSQP", "RSPQ", "SQRP"], "correct": "RSPQ", "solution": "This was at a time when no director considered children as potential audience. Ray was, thus, a pioneer in the field. Later film makers have followed his lead. Today other nations are making the children’s film in a big way."}, {"qText": "S1: Hungary, with a population of about 10 million, lies between Czechoslovakia to the north and Yugoslavia to the south.\nP : Here a great deal of grain is grown.\nQ : In recent years, however, progress has been made also in the field of industrialisation.\nR : Most of this country consists of an extremely fertile plain, through which the river Danube flows.\nS : In addition to grain, the plain produces potatoes, sugar, wine and livestock.\nS6: The new industries derive mainly from agricultural production.\nThe Proper sequence should be:", "ans": ["QRSP", "RPSQ", "PRSQ", "RQSP"], "correct": "RPSQ", "solution": "Most of this country consists of an extremely fertile plain, through which the river Danube flows. Here a great deal of grain is grown. In addition to grain, the plain produces potatoes, sugar, wine and livestock. In recent years, however, progress has been made also in the field of industrialization."}, {"qText": "S1: Palaeobotany is the study of fossil plants preserved in rocks dating back in millions of years.\nP : Records of the history of the world are contained in fossils.\nQ : Through the ages, plants have evolved from simple to more complex forms.\nR : First there were water plants then land plants appeared during the Paleozoic era.\nS : But since the fossil remains appear locked in rock layers, they are closely related to the geologist area of investigation.\nS6: The fossil plants indicate the age of the rock, and also point to facts regarding climate, temperature and topography.\nThe Proper sequence should be:", "ans": ["RQSP", "SQRP", "PSQR", "QRPS"], "correct": "QRPS", "solution": "Through the ages, plants have evolved from simple to more complex forms. First there were water plants then land plants appeared during the Paleozoic era. Records of the history of the world are contained in fossils. But since the fossil remains appear locked in rock layers, they are closely related to the geologist area of investigation."}, {"qText": "S1: On vacation in Tangier, Morocco, my friend and I sat down at a street cafe.\nP : At one point, he bent over with a big smile, showing me, a single gold tooth and a dingy fez.\nQ : soon I felt the presence of someone standing alongside me.\nR : But this one wouldn't budge.\nS : We had been cautioned about beggars and were told to ignore them.\nS6: Finally a man walked over to me and whispered, \"Hey buddy this guy is your waiter and he wants your order\".\nThe Proper sequence should be:", "ans": ["SQRP", "SQPR", "QSRP", "QSPR"], "correct": "QSRP", "solution": "Soon I felt the presence of someone standing alongside me. We had been cautioned about beggars and were told to ignore them. But this one wouldn’t budge. At one point, he bent over with a big smile, showing me, a single gold tooth and a dingy fez."}, {"qText": "S1: And then Gandhi came.\nP : Get off the backs of these peasants and workers, he told us, all you who live by their exploitation.\nQ : He was like a powerful current of fresh air, like a beam of light, like a whirlwind that upset many things.\nR : He spoke their language and constantly dre their attention to their appalling conditions.\nS : He didn't descent from the top, he seemed to emerge from the masses of India.\nS6: Political freedom took new shape and then acquired a new content.\nThe Proper sequence should be:", "ans": ["QSRP", "SRQP", "RSQP", "PRSQ"], "correct": "SRQP", "solution": "He didn’t descent from the top, he seemed to emerge from the masses of India. He spoke their language and constantly drew their attention to their appalling conditions. He was like a powerful current of fresh air, like a beam of light, like a whirlwind that upset many things. Get off the backs of these peasants and workers, he told us, all you who live by their exploitation."}, {"qText": "S1: Biological evolution has not fitted man to any specific environment.\nP : It is by no means a biological evolution, but it is a cultural one.\nQ : His imagination, his reason, his emotional subtlety and toughness, makes it possible for him not to accept the environment but to change.\nR : And that series of inventions by which man from age by age has reshaped his environment is a different kind of evolution.\nS : Among the multitude of animals which scamper, burrow swim around us he is in the only one who is not locked in to his environment.\nS6: That brilliant sequence of cultural peaks can most appropriately be termed the ascent of man.\nThe Proper sequence should be:", "ans": ["QPRS", "SRQP", "QRSP", "SQRP"], "correct": "QRSP", "solution": "His imagination, his reason, his emotional subtlety and toughness, makes it possible for him not to accept the environment but to change. And that series of inventions by which man from age by age has reshaped his environment is a different kind of evolution. Among the multitude of animals which scamper, burrow swim around us he is in the only one who is not locked into his environment. It is by no means a biological evolution, but is a cultural one."}, {"qText": "S1: The dictionary is the best friend of you task.\nP : That may not be possible always.\nQ : It is wise to look it up immediately.\nR : Then it must be firmly written on the memory and traced at the first opportunity.\nS : Never allow a strange word to pass unchallenged.\nS6: soon you will realize that this is an exciting task.\nThe Proper sequence should be:", "ans": ["PQRS", "SPQR", "QRPS", "SQPR"], "correct": "SQPR", "solution": "Never allow a strange word to pass unchallenged. It is wise to look it up immediately. That may not be possible always. Then it must be firmly written on the memory and traced at the first opportunity."}, {"qText": "S1: The Bhagavadgita recognises the nature of man and the needs of man.\nP : All these three aspects constitute the nature of man.\nQ : It shows how the human being is rational one, an ethical one and a spiritual one.\nR : More than all, it must be a spiritual experience.\nS : Nothing can give him fulfilment unless it satisfies his reason, his ethical conscience.\nS6: A man whom does not harmonise them, is not truly human.\nThe Proper sequence should be:", "ans": ["PSRQ", "RSPQ", "QPSR", "PSQR"], "correct": "QPSR", "solution": "It shows how the human being is rational one, an ethical one and a spiritual one. All these three aspects constitute the nature of man. Nothing can give him fulfillment unless it satisfies his reason, his ethical conscience. More than all, it must be a spiritual experience."}, {"qText": "S1: I usually sleep quite well in the train, but this time I slept only a little.\nP : Most people wanted it shut and I wanted it open.\nQ : As usual, I got angry about the window.\nR : The quarrel left me completely upset.\nS : There were too many people too much huge luggage all around.\nS6: It was shut all night, as usual.\nThe Proper sequence should be:", "ans": ["RSQP", "SQPR", "SQRP", "RSPQ"], "correct": "SQPR", "solution": "There were too many people too much huge luggage all around. As usual, I got angry about the window. Most people wanted it shut and I wanted it open. The quarrel left me completely upset."}, {"qText": "S1: In 1934, William Golding published a small volume of poems.\nP : During the World War II(1939-45) he joined the Royal Navy and was present at the sinking of the Bismarck.\nQ : He returned to teaching in 1945 and gave it up in 1962, and is now a full time writer.\nR : In 1939, he married and started teaching at Vishop Wordsworth school in Salisbury.\nS : At first his novels were not accepted.\nS6: But the Lord of the files which came out in 1954 was welcomed as \"a most absorbing and instructive tale\".\nThe Proper sequence should be:", "ans": ["RPQS", "RPSQ", "SRPQ", "SQPR"], "correct": "RPQS", "solution": "In 1939, he married and started teaching at Vishop Wordsworth school in Salisbury. During the World War II(1939-45) he joined the Royal Navy and was presented at the sinking of the Bismarck. He returned to teaching in 1945 and gave it up in 1962, and is now a full time writer. At first his novels were not accepted."}, {"qText": "S1: The future beckons to us.\nP : In fact we have hard work ahead.\nQ : Where do we go and what shall be our endeavour?\nR : We shall also have to fight and end poverty, ignorance and disease.\nS : It will be to bring freedom and oppurtunity to the common man.\nS6: There is no resting for any one of us till we redeem our pledge in full.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "QSRP", "SRPQ"], "correct": "QSRP", "solution": "Where do we go and what shall be our endeavour? It will be to bring freedom and opportunity to the common man. We shall also have to fight and end proverty, ignorance and disease. In fact we have hard work ahead."}, {"qText": "S1: Most of the universities in the country are now facing financial crisis.\nP : Cost benefit yardstick thus should not be applied in the case of universities.\nQ : The current state of affairs cannot be allowed to continue for long.\nR : Universities cannot be equated with commercial enterprises.\nS : Proper development of universities and colleges must be ensured.\nS6: The Government should realise this before it is too late.\nThe Proper sequence should be:", "ans": ["QRPS", "QSPR", "QRSP", "QPRS"], "correct": "QRPS", "solution": "The current state of affairs cannot be allowed to continue for long. Universities cannot be equated with commercial enterprises. Cost benefit yardstick thus should not be applied in the case of universities. Proper development of colleges and universities should be ensured."}, {"qText": "S1: While talking to a group, one should feel self-confident and courageous.\nP : Nor is it a gift bestowed by providence on only a few.\nQ : One should also learn how to think calmly and clearly.\nR : It is like the ability to play golf.\nS : It is not as difficult as most men imagine.\nS6: Any man can develop his capacity if he has the desire to do so.\nThe Proper sequence should be:", "ans": ["SQPR", "QSPR", "QRSP", "RSQP"], "correct": "QSPR", "solution": "One should also learn how to think calmly and clearly. It is not as difficult as most men imagine. Nor is it a gift bestowed by providence on only a few. It is like the ability to play golf."}, {"qText": "S1: A ceiling on urban property.\nP : No mill-owner could own factories or mills or plants.\nQ : And mass circulation papers.\nR : Would mean that.\nS : No press magnate could own printing presses.\nS6: since their value would exceed the ceiling fixed by the government.\nThe Proper sequence should be:", "ans": ["QSRP", "RPSQ", "SRPQ", "QPSR"], "correct": "RPSQ", "solution": "Would mean that. No mill-owner could own factories or mills or plants. No press magnate could own printing presses. And mass circulation papers."}, {"qText": "S1: The art of growing old is one which the passage of time has forced upon my attention.\nP : One of these is undue absorption in the past.\nQ : One's thought must be directed to the future and to things about which there is something to be done.\nR : Psychologically, there are two dangers to be guarded against in old age.\nS : It does not do to live in memories, in regrets for the good old days, or in sadness about friend who are dead.\nS6: This is not always easy one's own past is gradually increasing weight.\nThe Proper sequence should be:", "ans": ["QSRP", "RPQS", "RPSQ", "QPRS"], "correct": "RPSQ", "solution": "Psychologically, there are two dangers to be guarded against in old age. One of these is undue absorption in the past. It does not do to live in memories, in regrets for the good old days, or in sadness about friend who are dead. One’s thought must be directed to the future and to things about which there is something to be done."}, {"qText": "S1: I keep on flapping my big ears all day.\nP : They also fear that I will flip them all away.\nQ : But children wonder why I flap them so.\nR : I flap them so to make sure they are safely there on either side of my head.\nS : But I know what I am doing.\nS6: Am I not a smart, intelligent elephant?\nThe Proper sequence should be:", "ans": ["SRQP", "QPSR", "QPRS", "PSRQ"], "correct": "QPSR", "solution": "But children wonder why I flap them so. They also fear that I will flip them all away. But I know what I am doing. I flap them so to make sure they are safely there on either side of my head."}, {"qText": "S1: Once King Shantnu met a young and beautiful fisher girl.\nP : He went to the fisherman and asked him for her asked him for her hand in marriage.\nQ : The King was extremely sad and returned to his palace.\nR : He fell in love with the fisher girl.\nS : The fisherman agreed to it condition that the son of his daughter should be heir to the throne of Hastinapur.\nS6: Devavrata, the King's son, asked him the reason of his sadness.\nThe Proper sequence should be:", "ans": ["PQRS", "RPSQ", "QSPR", "PSQR"], "correct": "RPSQ", "solution": "He fell in love with the fisher girl. He went to the fisherman and asked him for her hand in marriage. The fisherman agreed to it condition that the son of his daughter should be heir to the throne of Hastinapur. The king was extremely sad and returned to his palace."}, {"qText": "S1: Reliogion is not a matter of mere dogmatic conformity.\nP : It is not merely going through the ritual prescribed to us.\nQ : It is not a question of ceremonial piety.\nR : Unless that kind of transformation occurs, you are not an authentically religious man.\nS : It is the remarking of your own self, the transformation of your nature.\nS6: A man of that character is free from fear, free from hatred.\nThe Proper sequence should be:", "ans": ["SPRQ", "QPSR", "PSRQ", "SPQR"], "correct": "QPSR", "solution": "It is not the question of ceremonial piety. It is not merely going through the ritual prescribed to us. It is the remarking of your own self, the transformation of your nature. Unless that kind of transformation occurs, you are not an authentically religious man."}, {"qText": "S1: We speak today of self-determination in politics.\nP : So long as one is conscious of a restraint, it is possible to resist it or to near it as a necessary evil and to keep free in spirit.\nQ : Slavery begins when one ceases to feel that restraint and it depends on if the evil is accepted as good.\nR : There is, however, a subtler domination exercised in the sphere of ideas by one culture to another.\nS : Political subjection primarily means restraint on the outer life of people.\nS6: Cultural subjection is ordinarily of an unconscious character and it implies slavery from the very start.\nThe Proper sequence should be:", "ans": ["SPRQ", "RSQP", "SPQR", "RSPQ"], "correct": "SPQR", "solution": "Political subjection primarily means restraint in the outer life of people. So long as one is conscious of a restraint, it is possible to resist it or to near it as a necessary evil and to keep free in spirit. Slavery begins when one ceases to feel that restraint and it depends on if the evil is accepted as good. There is, however, a subtler domination exercised in the sphere of ideas by one culture to another."}, {"qText": "S1: Once upon a time an ant lived on the bank of river.\nP : The dove saw the ant struggling in water in a helpless condition.\nQ : All its efforts to come up is failed.\nR : One day it suddenly slipped in to water.\nS : A dove lived in the tree on the bank not far from the spot.\nS6: She was touched.\nThe Proper sequence should be:", "ans": ["RQSP", "QRPS", "SRPQ", "PQRS"], "correct": "RQSP", "solution": "One day it suddenly slipped into water. All its efforts to come up failed. A dove lived in the tree on the bank not far from the spot. The dove saw the ant struggling in water in a helpless condition."}, {"qText": "S1: The December dance and music season in Madras is like the annual tropical cyclone.\nP : A few among the new aspirants dazzle witht he colour of youth, like fresh saplings.\nQ : It rains an abundance of music for over a fortnight.\nR : Thick clouds expectation charge the atmosphere with voluminous advertisements.\nS : At the end of it one is left with the feeling that the music of only those artists seasoned by careful nurturing, stands tall like well-routed trees.\nS6: Many a hastily planed shrub gets washed away in the storm.\nThe Proper sequence should be:", "ans": ["RQPS", "QRPS", "RQSP", "QRSP"], "correct": "QRPS", "solution": "It rains an abundance of music for over a fortnight. Thick clouds expectation charges the atmosphere with voluminous advertisements. A few among the new aspirants dazzle with the colour of youth, like fresh saplings. At the end of it one is left with the feeling that the music of only those artists seasoned by careful nurturing, stands tall like well-routed trees."}, {"qText": "S1: There is a touching story of Professor Hardy visiting Ramanujan as he lay desperately ill in hospital at Putney.\nP : 'No Hardy, that is not a dull number in the very least.\nQ : Hardy, who was a very shy man, could not find the words for his distress.\nR : It was 1729.\nS : The best he could do, as he got to the beside was \"I say Ramanujan, I thought the number of taxi I came down in was a very dull number\".\nS6: It is the lowest number that can be expressed in two different ways as the sum of two cubes.\nThe Proper sequence should be:", "ans": ["RPQS", "RPSQ", "PRQS", "QPRS"], "correct": "RPSQ", "solution": "It was 1729. ‘No hardy, that is not a dull number in the very least’. The best he could do, as he got to the beside was ”I say Ramanujan, I thought the number of taxi I came down in was a very dull number ”. Hardy, who was a very shy man, could not find the words for his distress."}, {"qText": "S1: Politeness is not a quality possessed by only one nation or race.\nP : One may observe that a man of one nation will remove his hat or fold his hands by way of greetings when he meets someone he knows.\nQ : A man of another country will not to do so.\nR : It is a quality to be found among all peoples and nations in every corner of the earth.\nS : Obviously, each person follows the custom of his particular country.\nS6: In any case, we should not mock at others habits.\nThe Proper sequence should be:", "ans": ["RPQS", "RPSQ", "PRQS", "QPRS"], "correct": "RPSQ", "solution": "It is a quality to be found among all peoples and nations in every corner of the earth. One may observe that a man of one nation will remove his hat or fold his hands by way of greetings when he meets someone he knows. Obviously, each person follows the custom of his particular country. A man of another country will not do so."}, {"qText": "S1: Throughout history man has used energy from the sun.\nP : Today, when we burn wood or use electric current we are drawing an energy.\nQ : However we now have a new supply of energy.\nR : All our ordinary life depends on sun.\nS : This has come from the sun.\nS6: This energy comes from inside atoms.\nThe Proper sequence should be:", "ans": ["SQPR", "RQPS", "QSRP", "PSRQ"], "correct": "PSRQ", "solution": "Today, when we burn wood or use electric current we are drawing an energy. This has come from the sun. All our ordinary life depends on sun. However we now have new supply of energies."}, {"qText": "S1: This weather-vane often tops a church spire, tower or high building.\nP : They are only wind-vanes.\nQ : Neither alone can tell us what the weather will be.\nR : They are designed to point to direction from which the wind is coming.\nS : Just as the barometer only tells us the pressure of air, the weather-vane tells us the direction of wind.\nS6: The weather-vane can, however give us some indication of other.\nThe Proper sequence should be:", "ans": ["PQRS", "PSRQ", "PRSQ", "SPQR"], "correct": "SPQR", "solution": "Just as the barometer only tells us the pressure of air, the weather-vane tells us the direction of wind. They are only wind-vanes. Neither alone can tell us what the weather will be. They are designed to point to direction from which the wind is coming."}, {"qText": "S1: But how does a new word get into the dictionary?\nP : When a new dictionary is being edited, a lexicographer collects all the alphabetically arranged citation slips for a particular word.\nQ : The dictionary makers notice it and make a note of it on a citation slip.\nR : The moment new word is coined, it usually enter the spoken language.\nS : The word then passes from the realm of hearing to the realm of writing.\nS6: He sorts them according to their grammatical function, and carefully writes a definition.\nThe Proper sequence should be:", "ans": ["PQRS", "PRSQ", "RQPS", "RSQP"], "correct": "RQPS", "solution": "The moment new word is coined, it usually enter the spoken language. The dictionary makers notice it and make a note of it on a citation slip. When a new dictionary is being edited, a lexicographer collects all the alphabetically arranged citation slips for a particular word. The word then passes from realm of hearing to the realm of writing."}, {"qText": "S1: Growing up means not only getting larger, but also using our sense and our brain is to become more aware of things around us.\nP : Not only does he have a memory but he is able to think and reason.\nQ : In this, man differs from all other animals.\nR : Before we spray our roadside plants or turn sewage in to our rivers, we should pause to think what the results of our action are likely to do.\nS : This is to say, he is able to plan what he is is going to do in the light of his experience before he does it.\nS6: In other words, we must develop and use our ability to reason, because the destruction or the preservation of the places in which we live depend on us.\nThe Proper sequence should be:", "ans": ["QRSP", "SPQR", "SPRQ", "QPSR"], "correct": "QPSR", "solution": "In this man differs from all other animals. Not only does he have a memory but he is able to think and reason. This is to say, he is able to plan what he is going to do in the light of his experience before he does it. Before we spray our roadside plants or turn sewage into our rivers, we should pause to think what the results of our action are likely to do."}, {"qText": "S1: Jawaharlal Nehru was the greatest plan-enthusiast.\nP : Under Nehru's advice, the pre-Independent congress set up National Planning Commission in 1938.\nQ : But he forgot that what could be achieved by force under the communist dictatorship of Russia was not possible under the democratic set up of India.\nR : He took the idea from Russia where Five year plans transformed a very backward country into a top power of the world.\nS : No free government can call for compulsory sacrifice and suffering from the whole people.\nS6: Nehru himself became the chairman of the commission.\nThe Proper sequence should be:", "ans": ["PSQR", "SRQP", "QPRS", "RQSP"], "correct": "RQSP", "solution": "He took the idea from Russia where Five year plans transformed very backward country into a top power of the world. But he forgot that what could be achieved by force under the communist dictatorship of Russia was not possible under the democratic set up of India. No free government can call for compulsory sacrifice and suffering from the whole people. Under Nehru’s advice, the pre-Independent congress set up National Planning Commission in 1938."}, {"qText": "S1: Duryodhana was a wicked prince.\nP : one day Bhima made Duryodhana fall from a tree from which Duryodhana was stealing fruits.\nQ : He did not like that Pandavas should be loved and respected by the people of Hastinapur\nR : Duryodhana specially hated Bhima.\nS : Among the Pandavas, Bhima was extraordinary strong and powerful.\nS6: This enraged Duryodhana so much that he began to think of removing Bhima from his way.\nThe Proper sequence should be:", "ans": ["PSQR", "QPRS", "QSPR", "PSRQ"], "correct": "QSPR", "solution": "He did not like that Pandavas should be and respected by the people of Hastinapur. Among the Pandavas, Bhima was extraordinary strong and powerful. One day Bhima made Duryodhana fall from a tree from which Duryodhana was stealing fruits. Duryodhana specially hated Bhima."}, {"qText": "S1: Jawaharlal Nehru was born in Allahabad on 14 Nov 1889.\nP : Nehru meet Mahatma Gandhi in February 1920.\nQ : In 1905 he was sent to London to study at a school called Haroow.\nR : He became the first Prime Minister of Independent India on 15 August 1947.\nS : He married Kamla Kaul in 1915.\nS6: He died on 27 May 1964.\nThe Proper sequence should be:", "ans": ["QRPS", "QSPR", "RPQS", "SQRP"], "correct": "QSPR", "solution": "In 1905 he was sent to London to study at a school called Haroow. He married Kamla Kaul in 1915. Nehru meet Mahatma Gandhi in February 1920. He became the Prime Minister of Independent India on 15 August 1947."}, {"qText": "S1: It was a dark moonless night.\nP : He turned over the pages, reading passages here and there.\nQ : He heard them on the floor.\nR : The poet took down his books of poems from his shelves.\nS : Some of them contained his earliest writings which he had almost forgotten.\nS6: They all seemed to him to be poor and ordinary mere childish words.\nThe Proper sequence should be:", "ans": ["RPQS", "RQSP", "RSPQ", "RPSQ"], "correct": "RPSQ", "solution": "The poet took down his books of poems from his shelves. He turned over the pages, reading passages here and there. Some of them contained his earliest writings which he had almost forgotten. He heard them on the floor."}, {"qText": "S1: I had halted on the road.\nP : As soon as I saw the elephant I knew I should not shoot him.\nQ : It is a serious matter to shoot a working elephant.\nR : I knew that his 'must' was already passing off.\nS : The elephant was standing 8 yards from the road.\nS6: I decided to watch him for a while and then go home.\nThe Proper sequence should be:", "ans": ["SPQR", "PQSR", "RQPS", "SRPQ"], "correct": "PQSR", "solution": "As soon as I saw the elephant I knew I should not shoot him. It is a serious matter to shoot a working elephant. The elephant was standing 8 yards from the road. I knew that his ‘must’ was already passing off."}, {"qText": "S1: There is only one monkey we can thoroughly recommend as an indoor pet.\nP : They quickly die from colds and coughs after the first winter fogs.\nQ : It is beautiful and intelligent Capuchin monkey.\nR : The lively little Capuchins, however, may be left for years in an English house without the least danger to their health.\nS : The Marmosets, it is true, are more beautiful than a Capuchins and just as pleasing, but they are too delicate for the English climate.\nS6: Finally let me say that no other monkey has a better temper or winning ways.\nThe Proper sequence should be:", "ans": ["PQRS", "QRPS", "QSPR", "RPSQ"], "correct": "QRPS", "solution": "No explanation is given for this question  Let's Discuss on Board"}, {"qText": "S1: A man can be physically confined within stone walls.\nP : But his mind and spirit will still be free.\nQ : Thus his freedom of action may be restricted.\nR : His hopes and aspiration still remain with him.\nS : Hence, he will be free spiritually if not physically.\nS6: No tyranny can intimidate a lover of liberty.\nThe Proper sequence should be:", "ans": ["PQRS", "SRQP", "QPRS", "QPSR"], "correct": "PQRS", "solution": "But his mind and spirit will still be free. Thus his freedom of action may be restricted. His hopes and aspiration still remain with him. Hence, he will be free spiritually if not physically."}, {"qText": "S1: Once upon atime there lived three young men in a certain town of Hindustan.\nP : All the people of the neighbourhood were mortally afraid of them.\nQ : They were so powerful that they could catch growing lions and tear them to pieces.\nR : Someone told them that they would become immortal if they killed Death.\nS : The young men believed themselves to be very good friends.\nS6: All of them set out in search of their foe called Death.\nThe Proper sequence should be:", "ans": ["QPRS", "SQPR", "RSQP", "SRPQ"], "correct": "SQPR", "solution": "The young men believed themselves to be very good friends. They were so powerful that they could catch growing lions and tear them to pieces. All the people of the neighbourhood were mortally afraid of them. Someone told them that they would become immortal if they killed death."}, {"qText": "S1: Metals are today being replaced by polymers in many applications.\nP : Above all, they are cheaper and easier to process making them a viable alternative to metals.\nQ : Polymers are essentially a long chains of hydrocarbon molecules.\nR : Today polymers as strong as metals have been developed.\nS : These have replaced the traditional chromium-plated metallic bumpers in cars.\nS6: Many Indian Institutes of science and Technology run special programmes on polymer science.\nThe Proper sequence should be:", "ans": ["QRSP", "RSQP", "RQSP", "QRPS"], "correct": "QRSP", "solution": "Polymers are essentially a long chains of hydrocarbon molecules. Today polymers as strong as metals have been developed. These have replaced the traditional chromium-plated metallic bumpers in cars. Above all, they are cheaper and easier to process making them viable alternative to metals."}, {"qText": "S1: Since the sixties there has been an increasing interest in neurophysiology, which deals with the neural bases of mental activity and behaviour.\nP : It has format which is very similar to that of Brain and Language, a sister journal.\nQ : Since then, a number of journals devoted entirely to this area of research have appeared.\nR : Before the 1960's when this field was the concern of a small number of investigators, research articles were scattered in various neurological journals.\nS : Brain and cognition is one such journal.\nS6: So far the journal has published the mixture of articles including reports and investigations.\nThe Proper sequence should be:", "ans": ["RQSP", "QRSP", "QSPR", "RSPQ"], "correct": "RQSP", "solution": "Before the 1960’s when this field was concern of a small number of investigators , research articles were scattered in various neurological journals. Since then, a number of journals devoted entirely to this area of research have appeared. Brain and cognition is one such journal. It has format which is very similar to that of Brain and Language, a sister journal."}, {"qText": "S1: An elderly lady suddenly became blind.\nP : The doctor called daily and every time he took away some of her furniture he liked.\nQ : At last she was cured and the doctor demanded his fee.\nR : She agreed to pay a large fee to the doctor who would cure her.\nS : On being refused, the doctor wanted to know the reason.\nS6: The lady said that she had not been properly cured because she could not see all his furniture.\nThe Proper sequence should be:", "ans": ["PQRS", "RPQS", "RSPQ", "RQPS"], "correct": "RPQS", "solution": "She agreed to pay a large fee to the doctor who would cure her. The doctor called daily and every time he took away some of her furniture he liked. At last she was cured and the doctor demanded his fee. On being refused, the doctor wanted to know the reason."}, {"qText": "S1: What are the causes of our chronic food shortage ?\nP : To find for these growing new millions is desperate task.\nQ : every year, we add more than a crore of persons to our population.\nR : Despite stupendous efforts by our government, the population is growing unabated.\nS : The chief cause is the population explosion.\nS6: This unprecedented growth can drag us to the doors of starvation very soon.\nThe Proper sequence should be:", "ans": ["QRSP", "SQPR", "QPRS", "PSQR"], "correct": "SQPR", "solution": "The chief cause is the population explosion. Every year, we add more than a crore of persons to our population. To find for these growing new millions is desperate task. Despite stupendous efforts by our government, the population is growing unabated."}, {"qText": "S1: Our ancestors thought that anything which moved itself was alive.\nP : The philosopher Descartes thought that both men and animals were machines.\nQ : But a machine such as a motorcar or a steamship moves itself, as soon as machines which moved themselves had been made, people asked \"Is man a machine?\"\nR : And before the days of machinery that was a good definition.\nS : He also thought that the human machine was partly controlled by the soul action on a certain part of the brain, while animals had no souls.\nS6: Therefore some scientists think that life is just a very complicated mechanism.\nThe Proper sequence should be:", "ans": ["PRSQ", "RPQS", "PSQR", "RQPS"], "correct": "PSQR", "solution": "The philosopher Descartes thought that both men and animals were machines. He also thought that the human machine was partly controlled by the soul action on a certain part of the brain, while animals had no souls. But a machine as a motorcar or a steamship moves itself, as soon as machines which moved themselves had been made, people asked “Is man a machine?” And before the days of machinery that was a good definition."}, {"qText": "S1: Payment for imports and exports is made through a system called foreign exchange.\nP : The value of the money of one country in relation to the money of other countries is agreed upon.\nQ : These rates of exchange vary from time to time.\nR : For instance, an American dollar or a British pound sterling is worth certain amounts in the money of other countries.\nS : Sometimes a United States dollar is worth 12 pesos in Mexico.\nS6: Another time it may be worth eight pesos.\nThe Proper sequence should be:", "ans": ["PQRS", "QPRS", "PRQS", "RPQS"], "correct": "PRQS", "solution": "The value of the money of one country in relation to the money of other countries is agreed upon. For instance, an American dollar or a British pound sterling is worth certain amounts in the money of other countries. These rates of exchange vary from time to time. Sometimes a united states dollar is worth 12 pesos in Mexico."}, {"qText": "S1: Moncure Conway devoted his life to two great objects freedom of thought, and freedom of the individual.\nP : They threaten both kinds of freedom.\nQ : But something also has been lost.\nR : There are now dangers, somewhat different in form from those of the past ages.\nS : In regard to both these objects, something has been gained since his time.\nS6: Unless a vigorous and vigilant public opinion can be aroused in defence of them, there will be much less of both a hundred years hence then there is now.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "SQRP", "RSPQ"], "correct": "SQRP", "solution": "In regard to both these objects, something has been gained since his time. But something also has been lost. There are now dangers, somewhat different in form from those of the past ages. They threaten both kinds of freedom."}, {"qText": "S1: The study of speech disorders due to brain injury suggests that patients can think without having adequate control over their language.\nP : But they succeed in playing games of chess.\nQ : Some patients, for example fail to find the names of objects presented to them.\nR : They can even use the concepts needed for chess playing, though they are unable to express many of the concepts in ordinary language.\nS : They even find it difficult to interpret long written notices.\nS6: How they manage to do this we do not know.\nThe Proper sequence should be:", "ans": ["PSQR", "RPSQ", "QSPR", "SRPQ"], "correct": "QSPR", "solution": "Some patients, for example fail to find the names of objects presented to them. They even find it difficult to interpret long written notices. But they succeed in playing games of chess. They can even use the concepts needed for chess playing, though they are unable to express many of the concepts in ordinary language."}, {"qText": "S1: A black haired, young woman came tripping along.\nP : She was leading a young woman wearing a hat.\nQ : The woman swept it off and tossed it in the air.\nR : The child jumped up to catch the hat.\nS : The young man tossed his head to shake the hat back.\nS6: Both disappeared from view.\nThe Proper sequence should be:", "ans": ["PSQR", "RPSQ", "QRPS", "SQRP"], "correct": "PSQR", "solution": "No explanation is given for this question  Let's Discuss on Board"}, {"qText": "S1: We now know that the oceans are very deep.\nP : For example, the Indian ocean has a range called the Indian Ridge.\nQ : Much of it is fairly flat.\nR : However, there are great mountain ranges as well.\nS : On average the bottom is 2.5 miles to 3.5 miles down.\nS6: This reaches from the India to the Antarctic.\nThe Proper sequence should be:", "ans": ["SQPR", "PQSR", "RSQP", "QPRS"], "correct": "SQPR", "solution": "On average the bottom is 2.5 miles to 3.5 miles down. Much of it is fairly flat. For example, the Indian ocean has a range called the Indian Ridge. However, there are great mountain ranges as well."}, {"qText": "S1: Minnie went shopping one morning.\nP : Disappointed She turned around and returned to the parking lot.\nQ : She got out and walked to the nearest shop.\nR : She drove her car into the parking lot and stopped.\nS : It was there that she realised that she'd forgotten her purse at home.\nS6: She drove home with an empty basket.\nThe Proper sequence should be:", "ans": ["RSQP", "RQSP", "PQRS", "QPRS"], "correct": "RQSP", "solution": "She drove her car into the parking lot and stopped. She got out and walked to the nearest shop. It was there that she realized that she’d forgotten her purse at home. Disappointed she turned around and returned to the parking lot."}, {"qText": "S1: Far away in a little street there is a poor house.\nP : Her face is thin and worn and her hands are coarse, pricked by a needle, for she is a seam stress.\nQ : One of the windows is open and through it I can see a poor woman.\nR : He has a fever and asking for oranges.\nS : In a bed in a corner of the room her little boy is lying ill.\nS6: His mother has nothing to give but water, so he is crying.\nThe Proper sequence should be:", "ans": ["SRQP", "PQSR", "QPSR", "RSPQ"], "correct": "QPSR", "solution": "One of the windows is open and through it I can see a poor woman. Her face is thin and worn and her hands are coarse, pricked by a needle, for she is a steam stress. In a bed in a corner of the room her little boy is lying ill. He has fever and asking for oranges."}, {"qText": "S1: A noise started above their heads.\nP : But people did not take it seriously.\nQ : That was to show everyone that there was something wrong.\nR : It was a dangerous thing to do.\nS : For, within minutes the ship began to sink.\nS6: Nearly 200 lives were lost on the fateful day.\nThe Proper sequence should be:", "ans": ["PQSR", "PRQS", "QPRS", "QPSR"], "correct": "QPRS", "solution": "That was to show everyone that there was something wrong. But people did not take it seriously. It was a dangerous thing to do. For, within minutes the ship began to sink."}, {"qText": "S1: American private lies may seem shallow.\nP : Students would walk away with books they had not paid for.\nQ : A Chinese journalist commented on a curious institution: the library.\nR : Their public morality, however, impressed visitors.\nS : But in general they returned them.\nS6: This would not happen in china, he said.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "RQPS", "RPSQ"], "correct": "QPSR", "solution": "A Chinese journalist commented on a curious institution: the library. Students would walk away with books they had not paid for. But in general they returned them. Their public morality, however, impressed visitors."}, {"qText": "S1: The path of Venus lies inside the path of the Earth.\nP : When at its farthest from the Earth, Venus is 160 million away\nQ : With such a wide range between its greatest and leat distances it is natural that at sometimes Venus appears much brighter than at others.\nR : No other body ever comes so near the Earth, with the exception of the Moon and occasional comet or asteroid.\nS : When Venus is at its nearest to the earth it is only 26 million miles away.\nS6: When at its brightest, it is easily seen with the naked eye in broad daylight.\nThe Proper sequence should be:", "ans": ["SRPQ", "SQRP", "PSQR", "QPRS"], "correct": "SRPQ", "solution": "When Venus is at its nearest to the earth it is only 26 million miles away. No other body ever come so near the Earth, with the exception of the Moon and occasional comet or asteroid. When at its farthest from the Earth, Venus is 160 million away. With such a wide range between its greatest and least distances it is natural that at sometimes Venus appears brighter than at others."}, {"qText": "S1: In India marriages are usually arranged by parents.\nP : Sometimes boys and girls do not like th idea of arranged marriages.\nQ : Most young people accepts the state of affairs.\nR : Shanta was like that.\nS : They assume their parents can make good choices.\nS6: She felt she was a modern girl and not subject for bargaining.\nThe Proper sequence should be:", "ans": ["SPRQ", "PSRQ", "QSPR", "RQPS"], "correct": "QSPR", "solution": "Most young people accepts the state of affairs. They assume their parents can make good choices. Sometimes boys and girls do not like the idea of arranged marriages. Shanta was like that."}, {"qText": "S1: She said on the phone that she would report for duty next day.\nP : We waited for few days then we decided to go to her place.\nQ : But she did not.\nR : we found it locked.\nS : Even after that we waited for her quite a few days.\nS6: Eventually we reported to the police.\nThe Proper sequence should be:", "ans": ["PRSQ", "QPSR", "QPRS", "SQPR"], "correct": "QPRS", "solution": "But she did not. We waited for few days then we decided to go to her place. We found it locked. Even after that we waited for her quite a few days."}, {"qText": "S1: Several sub-cities have been planned around capital.\nP : Dwarga is the first among them.\nQ : They are expected to alleviate the problem of housing.\nR : It is coming up in the south west of capital.\nS : It will cater to over one million people when completed.\nS6: Hopefully the housing problem will not be as acute at present after these sub-cities are built.\nThe Proper sequence should be:", "ans": ["QPRS", "PRSQ", "PQRS", "QRSP"], "correct": "QPRS", "solution": "They are expected to alleviate the problem of housing. Dwarga is the first among them. It is coming up in the south west of capital. It will cater to over one million people when completed."}, {"qText": "S1: Forecasting the weather has always been a difficult business.\nP : During a period of drought, streams and rivers dried up, the cattle died from thirst and were ruined.\nQ : Many different things affect the weather and we have to study them carefully to make accurate forecast.\nR : Ancient Egyptians had no need of weather in the Nile Valley hardly ever changes.\nS : In early times, when there were no instruments, such as thermometer or the barometer, man looked for tell-tale signs in the sky.\nS6: He made his forecasts by watching flights of the birds or the way smoke rose from fire.\nThe Proper sequence should be:", "ans": ["PRQS", "QPRS", "QRPS", "SPQR"], "correct": "QPRS", "solution": "Many different things affect the weather and we have to study them carefully to make accurate forecast. During a period of drought, streams and rivers dried up, the cattle died from thirst and were ruined. Ancient Egyptians had no need of weather in the Nile valley hardly ever changes. In early times, when there were no instruments, such as thermometer or the barometer, man looked for tell-tale signs in the sky."}, {"qText": "S1: As he passed beneath her he heard the swish of her wings.\nP : He was not falling head long now.\nQ : The monstrous terror seized him.\nR : But it only lasted a minute.\nS : He could hear nothing.\nS6: The next moment he felt his wings spread outwards.\nThe Proper sequence should be:", "ans": ["PSQR", "QSPR", "QSRP", "PRQS"], "correct": "QSRP", "solution": "The monstrous terror seized him. He could hear nothing. But it only lasted a minute. He was not falling head long now."}, {"qText": "S1: Ms. Parasuram started a Petrol Pump in Madras.\nP : A total to 12 girls now work at the pump.\nQ : She advertised in newspapers for women staff.\nR : They operate in 2 shifts.\nS : The response was good.\nS6: Thus she has shown the way for many others.\nThe Proper sequence should be:", "ans": ["PQSR", "SQPR", "QSPR", "PQRS"], "correct": "QSPR", "solution": "She advertised in newspapers for women staff. The response was good. A total to 12 girls now work at the pump. They operate in 2 shifts."}, {"qText": "S1: Sun birds are among the smallest of Indian birds.\nP : Though they are functionally similar to the humming birds of the New World, they are totally unrelated.\nQ : They do eat insects too.\nR : They are also some of the most brilliantly coloured birds.\nS : sun birds feed on nectar mostly and helped in pollination.\nS6: Our common sun birds are the purple sun bird, the glossy black species and purple rumped sun bird, the yellow and maroon species.\nThe Proper sequence should be:", "ans": ["SQPR", "RPSQ", "QPRS", "PSRQ"], "correct": "SQPR", "solution": "Sun birds feed on nectar mostly and helped in pollination. They do eat insects too. Though they are functionally similar to the humming birds of the New World, they are totally unrelated. They are also some of the most brilliantly coloured birds."}, {"qText": "S1: For decades, American society has been calling a melting pot.\nP : Differences remained - in appearence, mannerisms, customs, speech, religion and more.\nQ : The term has long been a cliche and half-truth.\nR : But homogenisation was never acheived.\nS : Yes, immigrants from diverse cultures and traditions did cast off vestiges of their native lands and become almost imperceptibly woven in to the American fabric.\nS6: In recent years, such differences accentuated by the arrival of immigrants from Asia and other parts of the world in the United States - have become something to celebrate and to nurture.\nThe Proper sequence should be:", "ans": ["QRSP", "SQRP", "SQPR", "QSRP"], "correct": "SQRP", "solution": "Yes, immigrants from diverse cultures and traditions did cast off vestiges of their native lands and become almost imperceptibly woven in to the American fabric. The term has long been a cliche and half-truth. But homogenisation was never achieved. Differences remained - in appearance, mannerisms, customs, speech, religion and more."}, {"qText": "S1: I took cigarettes from my case.\nP : But when the fit of coughing was over, he replaced it between his lips.\nQ : I lit one of them and placed it between the lips.\nR : Then with a feeble hand he removed the cigarette.\nS : Slowly he took a pull at it and coughed violently.\nS6: Then he continues to draw on it.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "QSRP", "SRPQ"], "correct": "QSRP", "solution": "I lit one of them and placed it between the lips. Slowly he took a pull at it and coughed violently. Then with a feeble hand he removed the cigarette. But when the fit of coughing was over, he replaced it between his lips."}, {"qText": "S1: There is difference between Gandhiji's concept of secularism and that of Nehru's.\nP : Nehru's idea of secularism was equal indifference to all religions and bothering about none of them.\nQ : According to Gandhiji, all religions are equally true and each scripture is worthy of respect.\nR : Such secularism which means the rejection of all religions is contrary to our culture and tradition.\nS : In Gandhiji's view, secularism stands for equal respect for all religions.\nS6: Instead of doing any good, such secularism can do harm instead of good.\nThe Proper sequence should be:", "ans": ["SQPR", "PSQR", "QSPR", "PRSQ"], "correct": "SQPR", "solution": "In Gandhiji's view, secularism stands for equal respect for all religions. According to Gandhiji, all religions are equally true and each scripture is worthy of respect. Nehru's idea of secularism was equal indifference to all religions and bothering about none of them. Such secularism which means the rejection of all religions is contrary to our culture and tradition."}, {"qText": "S1: As a dramatist Rabindranath was not what might be called a success.\nP : His dramas were moulded on the lines of the traditional Indian village dramas than the dramas of modern world.\nQ : His plays were more a catalogue of ideas than a vehicle of the expression of action.\nR : Actually the drama has always been the life of Indian people, as it deals with legends of gods and goddesses.\nS : Although in his short stories and novels he was able to create living and well defined characters, he did not seem to be able to do so in dramas.\nS6: Therefor, drama forms the essential part of the traditional Indian Culture.\nThe Proper sequence should be:", "ans": ["SRQP", "QPSR", "QSPR", "RSQP"], "correct": "QSPR", "solution": "His plays were more a catalogue of ideas than a vehicle of the expression of action. Although in his short stories and novels he was able to create living and well defined characters, he did not seem to be able to do so in dramas. His dramas were moulded on the lines of the traditional Indian village dramas than the dramas of modern world. Actually the drama has always been the life of Indian people, as it deals with legends of gods and goddesses."}, {"qText": "S1: It is regrettable that there is widespread corruption in the country at all levels.\nP : So there is hardly anything that the government can do about it now.\nQ : And there are graft and other malpractices too.\nR : The impression that corruption is universal phenomenon persists and the people not cooperate in checking this evil.\nS : Recently several offenders were brought to book, but they were not given deterrent punishment.\nS6: This is indeed a tragedy of great magnitude.\nThe Proper sequence should be:", "ans": ["QSRP", "SQRP", "RSQP", "PQSR"], "correct": "QSRP", "solution": "And there are graft and other malpractices too. Recently several offenders were brought to book, but they were not given deterrent punishment. The impression that corruption is universal phenomenon persists and the people not cooperate in checking this evil. So there is hardly anything that the government can do about it now."}, {"qText": "S1: The heart is pump of life.\nP : They have even succeeded in heart transplants.\nQ : Nowadays surgeons are able to stop a patients heart and carry out complicated operations.\nR : A few years ago it was impossible to operate on a patient whose heart was not working properly.\nS : If heart stops we die in about five minutes.\nS6: All this was made possible by the invention of heart-lung machine.\nThe Proper sequence should be:", "ans": ["SRQP", "SPRQ", "SQPR", "SRPQ"], "correct": "SRQP", "solution": "If heart stops we die in about five minutes. A few years ago it was impossible to operate on a patient whose heart was not working properly. Nowadays surgeons are able to stop a patients heart and carry out complicated operations. They have even succeeded in heart transplants"}, {"qText": "S1: Your letter was big relief.\nP : How did you exams go?\nQ : After your result, you must come here for a week.\nR : You hadn't written for over a month.\nS : I am sure you will come out with flying colours.\nS6: But don't forget to bring chocolate for Geetha.\nThe Proper sequence should be:", "ans": ["PSRQ", "QRPS", "RPSQ", "RSPQ"], "correct": "RPSQ", "solution": "You hadn't written for over a month. How did your exams go? I am sure you will come out with flying colours. After results, you must come here for a week."}, {"qText": "S1: Rammohan Roy was associated with several newspapers.\nP: Many educationists protested vigorously against these measures.\nQ: But this came to grief soon after the enactment in 1823, of new measures for the control of the press.\nR: He brought out a bilingual, Bengali-English magazine.\nS: Later, desiring an all-India circulation, he published a weekly in Persian, which was recognised then as the language of the cultured classes all over India.\nS6: Rammohan Roy even addressed a petition to the King-in-Council in England.\nThe Proper sequence should be:", "ans": ["QPRS", "RQPS", "RSPQ", "RSQP"], "correct": "RSQP", "solution": "He brought out a bilingual, Bengali-English magazine. Later, desiring an all-India circulation, he published a weekly in Persian, which was recognised then as the language of the cultured classes all over India. But this came to grief soon after the enactment in 1823, of new measures for the control of the press. Many educationists protested vigorously against these measures."}, {"qText": "S1: Different countries show different pattern of growth.\nP: Many others have a high birth rate with a low death rate.\nQ: Some have a high birth rate and still have a high death rate.\nR: The developing countries show the most rapid growth rate.\nS: Some others like the European nations, have a low birth rate and a low death rate.\nS6: Compared to this in Europe the growth rate is low.\nThe Proper sequence should be:", "ans": ["PQSR", "QSPR", "RSQP", "SPQR"], "correct": "QSPR", "solution": "Some have a high birth rate and still have a high death rate. Some others like the European nations, have a low birth rate and a low death rate. Many others have a high birth rate with a low death rate. The developing countries show the most rapid growth rate."}, {"qText": "S1: There are examinations at school which a pupil can pass by cramming the texts.\nP: But for spiritual knowledge mere memory of holy texts will be of no use in passing the texts.\nQ: One can score in them by the power of memory.\nR: A competent guru alone can provide the necessary guidance to an earnest disciple.\nS: What the text says has to be reflected upon and experienced by the speaker.\nS6: Thus, reading, reflection and experience are the three stages in gaining spiritual knowledge.\nThe Proper sequence should be:", "ans": ["QPSR", "RSPQ", "RSQP", "SRPQ"], "correct": "QPSR", "solution": "One can score in them by the power of memory. But for spiritual knowledge mere memory of holy texts will be of no use in passing the texts. What the text says has to be reflected upon and experienced by the speaker. A competent guru alone can provide the necessary guidance to an earnest disciple."}, {"qText": "S1: The domestic cat is a contradiction in itself.\nP: But the adult pet dog also sees its human family as the dominant members of the pack.\nQ: Nursed in kittenhood it develops extraordinary intimacy with mankind.\nR: The dog, like the pet cat, sees its owners as pseudo-parents.\nS: At the same time, however, the cat continues to retain its independence.\nS6: Hence it has won such a reputation for obedience and loyalty.\nThe Proper sequence should be:", "ans": ["QSPR", "QSRP", "SQPR", "SQRP"], "correct": "QSRP", "solution": "Nursed in kittenhood it develops extraordinary intimacy with mankind. At the same time, however, the cat continues to retain its independence. The dog, like the pet cat, sees its owners as pseudo-parents. But the adult pet dog also sees its human family as the dominant members of the pack."}, {"qText": "S1: He could not rise.\nP: All at once, in the distance, he heard an elephant trumpet.\nQ: He tried again with all his might, but to no use.\nR: The next moment he was on his feet.\nS: He stepped into the river.\nS6: It was colder than usual.\nThe Proper sequence should be:", "ans": ["PQSR", "PRQS", "QPRS", "QPSR"], "correct": "QPRS", "solution": "He tried again with all his might, but to no use. All at once, in the distance, he heard an elephant trumpet. The next moment he was on his feet. He stepped into the river."}, {"qText": "S1: Yawning or its absence has been related to various clinical conditions.\nP: Interestingly, some clinicians claim that those with acute physical illness don't yawn until they are on road to recovery.\nQ: It can be a symptom of brain lesions, haemorrhage, motion sickness and encephalitis.\nR: But what is currently known about yawning is essentially anecdotal, mostly because the yawn has not got the respect it deserves.\nS: On the other hand, it has been reported that psychotics rarely yawn, except those suffering from brain damage.\nS6: It is in reality a releasing stimulus.\nThe Proper sequence should be:", "ans": ["PSRQ", "PSQR", "QSPR", "QSRP"], "correct": "QSPR", "solution": "It can be a symptom of brain lesions, haemorrhage, motion sickness and encephalitis. On the other hand, it has been reported that psychotics rarely yawn, except those suffering from brain damage. Interestingly, some clinicians claim that those with acute physical illness don't yawn until they are on road to recovery. But what is currently known about yawning is essentially anecdotal, mostly because the yawn has not got the respect it deserves."}, {"qText": "S1: Man has existed for about a million years.\nP: Science, as a dominant factor in determining the beliefs of educated men, has existed for about 300 years; as a source of economic technique, for about 150 years.\nQ: When we consider how recently it has risen to power, we find ourselves forced to believe that we are at the very beginning of its work in transforming human life.\nR: In this brief period it has proved itself an incredibly powerful revolutionary force.\nS: He has possessed writing for about 6,000 years, agriculture somewhat longer, but perhaps not much longer.\nS6: What its future effects will be is a matter of conjecture, but possibly a study of its effects hitherto may make the conjecture a little less hazardous.\nThe Proper sequence should be:", "ans": ["PQSR", "PRSQ", "RQPS", "SPRQ"], "correct": "SPRQ", "solution": "He has possessed writing for about 6,000 years, agriculture somewhat longer, but perhaps not much longer. Science, as a dominant factor in determining the beliefs of educated men, has existed for about 300 years; as a source of economic technique, for about 150 years. In this brief period it has proved itself an incredibly powerful revolutionary force. When we consider how recently it has risen to power, we find ourselves forced to believe that we are at the very beginning of its work in transforming human life."}, {"qText": "S1: The path of Venus lies inside the path of the Earth.\nP: When at its farthest from the Earth, Venus is 160 million miles away.\nQ: With such a wide range between its greatest and least distances it is natural that at sometimes Venus appears much brighter than others.\nR: No other body ever comes so near the Earth, with the exception of the Moon and an occasional comet or asteroid.\nS: When Venus is at its nearest to the Earth, it is only 26 million miles away.\nS6: When at its brightest, it is easily seen with the naked aye in broad daylight.\nThe Proper sequence should be:", "ans": ["PSQR", "QPRS", "SQRP", "SRPQ"], "correct": "SRPQ", "solution": "When Venus is at its nearest to the Earth, it is only 26 million miles away. No other body ever comes so near the Earth, with the exception of the Moon and an occasional comet or asteroid. When at its farthest from the Earth, Venus is 160 million miles away. With such a wide range between its greatest and least distances it is natural that at sometimes Venus appears much brighter than others."}, {"qText": "S1: Work with retarded children, in particular, involves superhuman patience and long-delayed rewards.\nP: Another woman faithfully spent two hours a day, five days a week, with a bed-ridden retarded girl.\nQ: It was three years before the girl made her first cut in a piece of paper.\nR: The girl had never before responded to, or recognised anyone.\nS: One woman decided to teach a young brain-damaged girl how to use scissors.\nS6: After five years, the girl finally began to smile, when her foster grandparents entered the room.\nThe Proper sequence should be:", "ans": ["PSQR", "QSPR", "RQSP", "SQPR"], "correct": "SQPR", "solution": "One woman decided to teach a young brain-damaged girl how to use scissors. It was three years before the girl made her first cut in a piece of paper. Another woman faithfully spent two hours a day, five days a week, with a bed-ridden retarded girl. The girl had never before responded to, or recognised anyone."}, {"qText": "S1: He tried the door.\nP: The room was neat and clean.\nQ: Then he stepped into the room.\nR: He waited for a minute or two.\nS: It opened easily and he peeped in.\nS6: He was careful not to touch anything.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "RPQS", "SPRQ"], "correct": "SPRQ", "solution": "It opened easily and he peeped in. The room was neat and clean. He waited for a minute or two. Then he stepped into the room."}, {"qText": "S1: Frozen foods are so popular today that many people wonder how they ever lived without them.\nP: Near the North Pole, where the ground stays frozen all the year around, there is no problem of preserving foods.\nQ: Actually, people who live in cool climates have had frozen foods for a long time.\nR: Ice helped them when they could get it, but they couldn't get it very often.\nS: But people who live in warm climates have not always been able to keep food fresh.\nS6: Now refrigerators and deep freezers preserve many foods that could not be kept any other way.\nThe Proper sequence should be:", "ans": ["PQRS", "QPRS", "QPSR", "SRQP"], "correct": "QPSR", "solution": "Actually, people who live in cool climates have had frozen foods for a long time. Near the North Pole, where the ground stays frozen all the year around, there is no problem of preserving foods. But people who live in warm climates have not always been able to keep food fresh. Ice helped them when they could get it, but they couldn't get it very often."}, {"qText": "S1: Jawaharlal Nehru was born on November 14.\nP: He loved children.\nQ: On this day, children take part in many activities.\nR: Sports, music, drama and debates are arranged in schools.\nS: That is why his birthday is celebrated as Children's Day.\nS6: Exhibitions of photographs of Pandit Nehru showing his life time are also arranged in some schools.\nThe Proper sequence should be:", "ans": ["PQRS", "PSQR", "QPSR", "SPQR"], "correct": "PSQR", "solution": "He loved children. That is why his birthday is celebrated as Children's Day. On this day, children take part in many activities. Sports, music, drama and debates are arranged in schools."}, {"qText": "S1: For a conversation to be stimulating and sustained, the participants must be active talkers as well as active listeners.\nP: This is usually unnecessary, confusing and even boring to your partner.\nQ: Some people feel that they have to give long-winded explanations of their views.\nR: Make a point of throwing the conversational ball to the other person after you have presented your ideas in an abridged form.\nS: Be sure to do both in conversation.\nS6: It's better to paint the big picture first, and if your partner wants to know more, you can always fill in with details.\nThe Proper sequence should be:", "ans": ["QPSR", "SRQP", "PSRQ", "RSPQ"], "correct": "SRQP", "solution": "Be sure to do both in conversation. Make a point of throwing the conversational ball to the other person after you have presented your ideas in an abridged form. Some people feel that they have to give long-winded explanations of their views. This is usually unnecessary, confusing and even boring to your partner."}, {"qText": "S1: Gandhi's first political fast was made soon after his return from Africa.\nP: He had also received help from this man's sister.\nQ: This was when the poor labourers of the cotton mills of Ahmedabad were on strike.\nR: He was a friend of the largest mill-owner.\nS: Gandhi had made the strikers promise to remain on strike until the owners agreed to accept the decision of an arbitrator.\nS6: He did not fast against the mill owners, but in order to strengthen the determination of the strikers.\nThe Proper sequence should be:", "ans": ["PQSR", "QSRP", "RPQS", "SRPQ"], "correct": "QSRP", "solution": "This was when the poor labourers of the cotton mills of Ahmedabad were on strike. Gandhi had made the strikers promise to remain on strike until the owners agreed to accept the decision of an arbitrator. He was a friend of the largest mill-owner. He had also received help from this man's sister."}, {"qText": "S1: Kabir knew that Ramananda got up very Early in the morning and went down on the steps of the 'ghat' to the bathe in the waters of the sacred Ganges.\nP: As Ramananda came down the steps before daybreak for his usual bath, he trod on the sleeping man.\nQ: Kabir at once jumped up and threw himself at the feet of the preacher.\nR: \"Ram, Ram\" he exclaimed in astonishment.\nS: One dark night, Kabir went to the 'ghat' and lay down on one of the river steps.\nS6: He said, \"You have given me the mantra, 'Ram, Ram,' I have become our disciple\".\nThe Proper sequence should be:", "ans": ["PQSR", "PRQS", "RQPS", "SPRQ"], "correct": "SPRQ", "solution": "One dark night, Kabir went to the 'ghat' and lay down on one of the river steps. As Ramananda came down the steps before daybreak for his usual bath, he trod on the sleeping man. \"Ram, Ram\" he exclaimed in astonishment. Kabir at once jumped up and threw himself at the feet of the preacher."}, {"qText": "S1: We must also understand that the fruits of labour are sweeter than the gifts of fortune.\nP: Moreover, too much of thinking is also a disease.\nQ: Indeed, thought and action can be separately analysed but can never be separated from each other.\nR: Hence, thought to be complete demands action and action without thought also has no value.\nS: It keeps us depressed and gloomy.\nS6: The best life, therefore, is lived both in thought and deed.\nThe Proper sequence should be:", "ans": ["PSRQ", "QRSP", "RQPS", "SPQR"], "correct": "QRSP", "solution": "Indeed, thought and action can be separately analysed but can never be separated from each other. Hence, thought to be complete demands action and action without thought also has no value. It keeps us depressed and gloomy. Moreover, too much of thinking is also a disease."}, {"qText": "S1: The houses in the Indus Valley were built of baked bricks.\nP: This staircase sometimes continued upwards on to the roof.\nQ: Access to the upstairs rooms was by a narrow stone staircase at the back of the house.\nR: The drains were incorporated in the walls.\nS: The houses had bathrooms and water closets, rubbish chutes and excellent drainage systems.\nS6: They led outside into covered sewers which ran down the side of the streets.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "QRPS", "SPQR"], "correct": "QPSR", "solution": "Access to the upstairs rooms was by a narrow stone staircase at the back of the house. This staircase sometimes continued upwards on to the roof. The houses had bathrooms and water closets, rubbish chutes and excellent drainage systems. The drains were incorporated in the walls."}, {"qText": "S1: Most of the perishable foods are shipped by refrigerator ships.\nP: They are placed in the refrigerated hold of the ship.\nQ: Some foods, such as bananas, are shipped before they get ripe.\nR: As the green bananas are loaded, a man watches closely the signs of yellow on them.\nS: The cool temperature keep the bananas from getting ripe during the trip.\nS6: Ripe bananas are poor travellers and even one ripe banana at the start of the trip can spoil a whole ship load of fruit.\nThe Proper sequence should be:", "ans": ["PQRS", "PSQR", "QPSR", "SRPQ"], "correct": "PQRS", "solution": "They are placed in the refrigerated hold of the ship. Some foods, such as bananas, are shipped before they get ripe. As the green bananas are loaded, a man watches closely the signs of yellow on them. The cool temperature keep the bananas from getting ripe during the trip."}, {"qText": "S1: A transformation of consciousness is now beginning to express itself in the field of theoretical architecture.\nP: In the still theoretical structure an attempt is being made to create a house that is \"a domestication of an ecosystem.\"\nQ: What is happening in the architecture is a shift from the international style of the post industrial era to a symbolic structure.\nR: Since architecture is the collective unconscious made visible, the architect does not himself always understand the full cultural implications of his own work.\nS: The new form is not a celebration of power over new materials, but a celebration of cooperation with ecosystem.\nS6: The relationship between culture and nature is changed, for the architect grows a house like a garden.\nThe Proper sequence should be:", "ans": ["PRSQ", "QPSR", "RQSP", "SQRP"], "correct": "QPSR", "solution": "What is happening in the architecture is a shift from the international style of the post industrial era to a symbolic structure. In the still theoretical structure an attempt is being made to create a house that is \"a domestication of an ecosystem.\" The new form is not a celebration of power over new materials, but a celebration of cooperation with ecosystem. Since architecture is the collective unconscious made visible, the architect does not himself always understand the full cultural implications of his own work."}, {"qText": "S1: While on a fishing trip, last summer, I watched an elderly man fishing off the edge of a dock.\nP: \"Why didn't you keep the other big ones?\" I asked.\nQ: He caught an enormous trout, but apparently not satisfied with its size, he threw it back into the war.\nR: He finally caught a small pike, threw it into his pail, and, smiling happily, prepared to live.\nS: Amazed, I watched him repeat this performance.\nS6: Cheerfully, the old man replied, \"Small frying pan.\"\nThe Proper sequence should be:", "ans": ["PSQR", "QSRP", "RPQS", "SQRP"], "correct": "QSRP", "solution": "He caught an enormous trout, but apparently not satisfied with its size, he threw it back into the war. Amazed, I watched him repeat this performance. He finally caught a small pike, threw it into his pail, and, smiling happily, prepared to live. \"Why didn't you keep the other big ones?\" I asked."}, {"qText": "S1: There was once a Persian king called Shahryar who had a beautiful wife.\nP: When the King discovered this he killed her.\nQ: He gave orders that he was to be provided with a new wife every day.\nR: He loved her very much, but she was a wicked woman.\nS: He decided that all women were wicked and that he would punish them.\nS6: After one day's marriage he would cut off her head and marry again.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "RPSQ", "SPRQ"], "correct": "RPSQ", "solution": "He loved her very much, but she was a wicked woman. When the King discovered this he killed her. He decided that all women were wicked and that he would punish them. He gave orders that he was to be provided with a new wife every day."}, {"qText": "S1: We must never allow ourselves to lapse into the evil habit of borrowing money from others.\nP: We must work hard and earn money, enough for our wants.\nQ: Even if we are fortunate enough to possess surplus wealth, we should take care not to lend out money indiscriminately.\nR: If borrowing is bad , lending is worse.\nS: Borrowing of a habitual nature prevents us from being industrious.\nS6: We must not confuse money lending with generosity.\nThe Proper sequence should be:", "ans": ["PSQR", "QSRP", "RSQP", "SPRQ"], "correct": "SPRQ", "solution": "Borrowing of a habitual nature prevents us from being industrious. We must work hard and earn money, enough for our wants. If borrowing is bad , lending is worse. Even if we are fortunate enough to possess surplus wealth, we should take care not to lend out money indiscriminately."}, {"qText": "S1: There was a time Egypt faced economic crisis.\nP: Cotton is the chief export commodity of Egypt.\nQ: Foreign trades depend on cultivation of cotton on large scale.\nR: It became necessary for Egypt to boost cotton crops.\nS: Only by means of increasing foreign trade Egypt could survive.\nS6: Egypt was able to sustain itself by its cotton produce.\nThe Proper sequence should be:", "ans": ["PQRS", "QRPS", "RPSQ", "SRQP"], "correct": "SRQP", "solution": "Only by means of increasing foreign trade Egypt could survive. It became necessary for Egypt to boost cotton crops. Foreign trades depend on cultivation of cotton on large scale. Cotton is the chief export commodity of Egypt."}, {"qText": "S1: While crossing a busy road we should obey the policeman on duty.\nP: We should always cross the road at the zebra crossing.\nQ: We must look to the signal lights and cross the road only when the road is clear.\nR: If there are no signal lights at the crossing, we should look to the right, then to the left and again to the right before crossing the road.\nS: If the road is not clear we should wait.\nS6: We should never run while crossing a road.\nThe Proper sequence should be:", "ans": ["PQRS", "PSRQ", "QRPS", "RQSP"], "correct": "QRPS", "solution": "We must look to the signal lights and cross the road only when the road is clear. If there are no signal lights at the crossing, we should look to the right, then to the left and again to the right before crossing the road. We should always cross the road at the zebra crossing. If the road is not clear we should wait."}, {"qText": "S1: The commonest form of forgetfulness, I suppose, occurs in the matter of posting letters.\nP: So common is it that I am always reluctant to trust a departing visitor to post an important letter.\nQ: As for myself, anyone who asks me to post a letter is a poor judge of character.\nR: Even if I carry the letter in my hand I am always past the first pillar box before I remember that I ought to have posted it.\nS: So little I rely on his memory that I put him on his oath before handing the letter to him.\nS6: Weary of holding it in my hand, I then put it for safety into one of my pockets and forget all about it.\nThe Proper sequence should be:", "ans": ["PRQS", "PSQR", "QSPR", "RQSP"], "correct": "PSQR", "solution": "So common is it that I am always reluctant to trust a departing visitor to post an important letter. So little I rely on his memory that I put him on his oath before handing the letter to him. As for myself, anyone who asks me to post a letter is a poor judge of character. Even if I carry the letter in my hand I am always past the first pillar box before I remember that I ought to have posted it."}, {"qText": "S1: We must learn to depend on ourselves and not look to others for help every time we are in trouble.\nP: We should not forget that those who lean too much on others tend to become weak and helpless.\nQ: Certainly we want to make friends with the rest of the world.\nR: We welcome help and cooperation from every quarter, but we must depend primarily on our own resources.\nS: We also seek the goodwill and cooperation of all those who reside in this country, whatever their race or nationality.\nS6: A country's freedom can be preserved only by her own strength and self-reliance.\nThe Proper sequence should be:", "ans": ["PQRS", "QPRS", "QSRP", "SRQP"], "correct": "PQRS", "solution": "We should not forget that those who lean too much on others tend to become weak and helpless. Certainly we want to make friends with the rest of the world. We welcome help and cooperation from every quarter, but we must depend primarily on our own resources. We also seek the goodwill and cooperation of all those who reside in this country, whatever their race or nationality."}, {"qText": "S1: Anything you do that gives you some form of regular exercise will benefit your heart.\nP: In fact, never choose an activity just because it is good for you.\nQ: By all means work up a good sweat, and even a thirst perhaps.\nR: If you can combine this with enjoyment, then so much the better.\nS: You will soon get bored of it.\nS6: But do not push too hard; tune into the warning signals from your body.\nThe Proper sequence should be:", "ans": ["PRSQ", "PSRQ", "QRPS", "RPSQ"], "correct": "RPSQ", "solution": "If you can combine this with enjoyment, then so much the better. In fact, never choose an activity just because it is good for you. You will soon get bored of it. By all means work up a good sweat, and even a thirst perhaps."}, {"qText": "S1: Proverbs contain homely but universal truths.\nP: They point out the incongruities of situations in life.\nQ: Naturally, therefore, they are translatable from one language to another.\nR: Therefore, their appeal is direct.\nS: Many of them had their birth in folk literature.\nS6: They are everyman's philosophy.\nThe Proper sequence should be:", "ans": ["QPRS", "QSPR", "RPSQ", "SPQR"], "correct": "SPQR", "solution": "Many of them had their birth in folk literature. They point out the incongruities of situations in life. Naturally, therefore, they are translatable from one language to another. Therefore, their appeal is direct."}, {"qText": "S1: Suddenly it began to climb swiftly, and I knew it was speeding eastward again till it became a speck in the blue morning.\nP: I didn't know what force they could command, but I was certain it would be sufficient.\nQ: My enemies had located me, and the next thing would be a cordon round me.\nR: That made me do some savage thinking.\nS: The aeroplane had seen my bicycle, and would conclude that I would try to escape by the road.\nS6: In that case there might be a chance on the moors to the right or left.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "RQPS", "SRQP"], "correct": "QPSR", "solution": "My enemies had located me, and the next thing would be a cordon round me. I didn't know what force they could command, but I was certain it would be sufficient. The aeroplane had seen my bicycle, and would conclude that I would try to escape by the road. That made me do some savage thinking."}, {"qText": "S1: Today the Earth has many satellites besides the moon.\nP: But the pull of the Earth keep them from doing so.\nQ: The artificial satellites do not fall because they are going too fast to do so.\nR: They are artificial satellites made by man and very much smaller than the man.\nS: As they speed along, they tend to go straight off into space.\nS6: As a result, they travel in an orbit round the Earth.\nThe Proper sequence should be:", "ans": ["PRQS", "QPSR", "RQSP", "SPRQ"], "correct": "RQSP", "solution": "They are artificial satellites made by man and very much smaller than the man. The artificial satellites do not fall because they are going too fast to do so. As they speed along, they tend to go straight off into space. But the pull of the Earth keep them from doing so."}, {"qText": "S1: There have been many myths about women in world literature.\nP: Odysseus found a way to save himself and his sailors from this evil fate.\nQ: The sirens were beautiful maidens whose songs enchanted sailors on the seas.\nR: Odysseus encounter with the sirens during his return home after the fall of Troy is typical of this.\nS: Their songs were so captivating that the sailors swam towards them and died miserable deaths.\nS6: He filled his rower's ears with wax and had himself bound to the mast so that he could hear the sweet singing without diving overboard to his death.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "QSPR", "RQSP"], "correct": "RQSP", "solution": "Odysseus encounter with the sirens during his return home after the fall of Troy is typical of this. The sirens were beautiful maidens whose songs enchanted sailors on the seas. Their songs were so captivating that the sailors swam towards them and died miserable deaths. Odysseus found a way to save himself and his sailors from this evil fate."}, {"qText": "S1: The similarity between the human body and a machine is rather superficial.\nP: Beyond that, comparison fails.\nQ: No machine grows in size; no machine sees, hears or feels.\nR: It can be summed up in the statement that both require fuel and oxygen and obtain energy.\nS: No machine thinks.\nS6: The points of difference far outweigh the points of resemblance.\nThe Proper sequence should be:", "ans": ["QSPR", "RPQS", "RPSQ", "SQPR"], "correct": "RPQS", "solution": "It can be summed up in the statement that both require fuel and oxygen and obtain energy. Beyond that, comparison fails. No machine grows in size; no machine sees, hears or feels. No machine thinks."}, {"qText": "S1: Jawaharlal Nehru was born in Allahabad on 14 Nov., 1889.\nP: Nehru met Mahatma Gandhi in February, 1920.\nQ: In 1905 he was sent to London to study at a school called Harrow.\nR: He became the first Prime Minister of Independent India on 15 August, 1947.\nS: He married Kamla Kaul in 1915.\nS6: He died on 27 May, 1964.\nThe Proper sequence should be:", "ans": ["QRPS", "QSPR", "RPQS", "SQRP"], "correct": "QSPR", "solution": "In 1905 he was sent to London to study at a school called Harrow. He married Kamla Kaul in 1915. Nehru met Mahatma Gandhi in February, 1920. He became the first Prime Minister of Independent India on 15 August, 1947."}, {"qText": "S1: In other words, grammar grows and changes, and there is no such thing as correct use of English for the past, the present and the future.\nP: \"The door is broke.\"\nQ: Yet this would have been correct in Shakespeare's time.\nR: Today, only an uneducated person would say,\"My arm is broke.\"\nS: For example, in Shakespeare's play Hamlet, there is the line.\nS6: All the words that man has invented are divided into eight classes, which are called parts of speech.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "RSPQ", "SPRQ"], "correct": "SPRQ", "solution": "For example, in Shakespeare's play Hamlet, there is the line. \"The door is broke.\" Today, only an uneducated person would say,\"My arm is broke.\" Yet this would have been correct in Shakespeare's time."}, {"qText": "S1: The Bhagavadgita recognises the nature of man and the needs of man.\nP: All these three aspects constitute the nature of man.\nQ: It shows how the human being is a rational one, an ethical one and a spiritual one.\nR: More than all, it must be a spiritual experience.\nS: Nothing can give him fulfilment unless it satisfies his reason, his ethical conscience.\nS6: A man who does not harmonise them, is not truly human.\nThe Proper sequence should be:", "ans": ["PSQR", "PSRQ", "QPSR", "RSPQ"], "correct": "RSPQ", "solution": "More than all, it must be a spiritual experience. Nothing can give him fulfilment unless it satisfies his reason, his ethical conscience. All these three aspects constitute the nature of man. It shows how the human being is a rational one, an ethical one and a spiritual one."}, {"qText": "S1: Silence is unnatural to man.\nP: Even his conversation is in great measure a desperate attempt to prevent a dreadful silence.\nQ: In the interval he does all he can to make a noise in the world.\nR: There are few things of which he stand in more fear than of the absence of noise.\nS: He begins with a cry and ends it in stillness.\nS6: He knows that ninety nine percent of human conversation means no more than the buzzing of a fly, but he longs to join in the buzz and to prove that he is a man and not a wax-work figure.\nThe Proper sequence should be:", "ans": ["PQRS", "PRQS", "QPRS", "SQRP"], "correct": "SQRP", "solution": "He begins with a cry and ends it in stillness. In the interval he does all he can to make a noise in the world. There are few things of which he stand in more fear than of the absence of noise. Even his conversation is in great measure a desperate attempt to prevent a dreadful silence."}, {"qText": "S1: During the middle ages the manufacture of cloth was divided amongst a number of associations of skilled workers who performed different operations required in its production.\nP: But the association of skilled workers lacked capital to buy it.\nQ: Consequently, he began to assume the role of the employer.\nR: With the mechanisation of these operations, complicated apparatus became necessary for economic production.\nS: The banker, therefore, stepped in to finance the industrialisation of these operations.\nS6: This was one of the reasons why the industry flourished in such rich countries as Flanders, Italy and Britain.\nThe Proper sequence should be:", "ans": ["PRQS", "PRSQ", "RPQS", "RPSQ"], "correct": "RPSQ", "solution": "With the mechanisation of these operations, complicated apparatus became necessary for economic production. But the association of skilled workers lacked capital to buy it. The banker, therefore, stepped in to finance the industrialisation of these operations. Consequently, he began to assume the role of the employer."}, {"qText": "S1: I put the phone down and shook my head in bewilderment.\nP: Then I am taken in tow by some moonlighting hare-brain with a passion for veteran aircraft, flying his own Mosquito through the night who happens to spot me.\nQ: What a night, what an incredible night!\nR: Then I get lost and short of fuel.\nS: First I lose my radio and all my instruments.\nS6: And finally a half-drunk ground-duty officer has the sense to put his runaway lights on in time to save me.\nThe Proper sequence should be:", "ans": ["QPSR", "QSRP", "SPRQ", "SRPQ"], "correct": "QSRP", "solution": "What a night, what an incredible night! First I lose my radio and all my instruments. Then I get lost and short of fuel. Then I am taken in tow by some moonlighting hare-brain with a passion for veteran aircraft, flying his own Mosquito through the night who happens to spot me."}, {"qText": "S1: It is very easy to acquire bad habits.\nP: If we do not continue to do it, we feel unhappy.\nQ: The more we do a thing, the more we tend to like doing it.\nR: The force of habit should be fought against.\nS: This is called the force of habit.\nS6: Even good things should be done from time to time only.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "RPSQ", "SQRP"], "correct": "QPSR", "solution": "The more we do a thing, the more we tend to like doing it. If we do not continue to do it, we feel unhappy. This is called the force of habit. The force of habit should be fought against."}, {"qText": "S1: Gandhiji had a vast amount of daily business to transact.\nP: Yet Gandhiji was never too busy to withdraw temporarily from business affairs for recurrent periods of contemplation.\nQ: Under present day conditions, that is the fate of any leader of any great movement.\nR: In setting apart those times for contemplation gandhiji was being true, not only to himself, but to India.\nS: If he had not made this his practice, he would not, I suppose,have been able to go on doing his business, because his spells of contemplation were the source of his inexhaustible strength.\nS6: His practice on this point is something that is characteristic of the Indian tradition.\nThe Proper sequence should be:", "ans": ["PRSQ", "QPSR", "RSPQ", "SRPQ"], "correct": "QPSR", "solution": "Under present day conditions, that is the fate of any leader of any great movement. Yet Gandhiji was never too busy to withdraw temporarily from business affairs for recurrent periods of contemplation. If he had not made this his practice, he would not, I suppose,have been able to go on doing his business, because his spells of contemplation were the source of his inexhaustible strength. In setting apart those times for contemplation gandhiji was being true, not only to himself, but to India."}, {"qText": "S1: A farmer was taking the grain to the mill in sacks.\nP: It was too heavy for him to lift.\nQ: On the way the horse stumbled, and one of the sacks fell to the ground.\nR: Presently he saw a rider coming towards him.\nS: He stood waiting till he found somebody to help him.\nS6: But the farmer saw that he was none other than the nobleman.\nThe Proper sequence should be:", "ans": ["PRQS", "PSQR", "QPRS", "QPSR"], "correct": "QPSR", "solution": "On the way the horse stumbled, and one of the sacks fell to the ground. It was too heavy for him to lift. He stood waiting till he found somebody to help him. Presently he saw a rider coming towards him."}, {"qText": "S1: There is nothing strange in the fact that so many foreign students should wish to learn English.\nP: If any valuable book is written in another language, an English translation of it sure to be speedily published.\nQ: Anyone who masters the English tongue acquires a key.\nR: Most books found to be generally useful are written in English.\nS: The English speaking people want no monopoly of knowledge.\nS6: This key will open to him whatever is valuable in the literature of the world.\nThe Proper sequence should be:", "ans": ["SQRP", "SRPQ", "RSPQ", "RPSQ"], "correct": "RPSQ", "solution": "Most books found to be generally useful are written in English. If any valuable book is written in another language, an English translation of it sure to be speedily published. The English speaking people want no monopoly of knowledge. Anyone who masters the English tongue acquires a key."}, {"qText": "S1: The time has come for us to consider seriously the question of a Bharat brand of English.\nP: I am not suggesting here a mongrelisation of the language.\nQ: English must adopt the complexion of our life and assimilate its idiom.\nR: Now the time is ripe for it to come to the dusty street, market place and under the banyan tree.\nS: So far English has had a comparatively confined existence in our country, chiefly in the halls of learning, justice or administration.\nS6: Bharat English will respect the rule of law and maintain the dignity of grammar, but still have a swadeshi stamp about it.\nThe Proper sequence should be:", "ans": ["QPSR", "RQSP", "SRPQ", "SRQP"], "correct": "SRPQ", "solution": "So far English has had a comparatively confined existence in our country, chiefly in the halls of learning, justice or administration. Now the time is ripe for it to come to the dusty street, market place and under the banyan tree. I am not suggesting here a mongrelisation of the language. English must adopt the complexion of our life and assimilate its idiom."}, {"qText": "S1: Some old people are oppressed by the fear of death.\nP: An individual human existence should be like a river-small at first, narrowly contained within its banks, and rushing passionately past boulders and over waterfalls.\nQ: In the young there is a justification for this feeling.\nR: Young men who have reason to fear that they will be killed in battle may justifiably feel bitter in the thought that they have been cheated of the best thing that life has to offer.\nS: But in the old man who has known human joys and sorrows, the fear of death is somewhat object and ignoble, and the best way to overcome it is to make your interests gradually wider and more impersonal.\nS6: Gradually the river grows wider, the banks recede, the waters flow more quietly, and in the end, without any visible break, they become merged in the sea and painlessly lose their individual being.\nThe Proper sequence should be:", "ans": ["PQSR", "QPSR", "QRSP", "RSQP"], "correct": "QRSP", "solution": "In the young there is a justification for this feeling. Young men who have reason to fear that they will be killed in battle may justifiably feel bitter in the thought that they have been cheated of the best thing that life has to offer. But in the old man who has known human joys and sorrows, the fear of death is somewhat object and ignoble, and the best way to overcome it is to make your interests gradually wider and more impersonal. An individual human existence should be like a river-small at first, narrowly contained within its banks, and rushing passionately past boulders and over waterfalls."}, {"qText": "S1: It was early 1943 and the war in the East was going disastrously.\nP: How this unlikely bunch of middle aged civilians accomplished their missions makes fascinating reading.\nQ: To stop the sinkings a spy ring had to be broken, a German ship assaulted, and a secret radio transmitter silenced.\nR: U-boats were torpedoing Allied ships in the Indian ocean faster than they could be replaced.\nS: And the only people who could do the job were a handful of British businessmen in Calcutta-all men not called out for active service.\nS6: Boarding party, James Leasor's latest best-seller is a record of this tale of heroics tinged with irony and humour.\nThe Proper sequence should be:", "ans": ["PRSQ", "QSRP", "RQSP", "SQPR"], "correct": "RQSP", "solution": "U-boats were torpedoing Allied ships in the Indian ocean faster than they could be replaced. To stop the sinkings a spy ring had to be broken, a German ship assaulted, and a secret radio transmitter silenced. And the only people who could do the job were a handful of British businessmen in Calcutta-all men not called out for active service. How this unlikely bunch of middle aged civilians accomplished their missions makes fascinating reading."}, {"qText": "S1: The distinction between state or sovereign and government is developed by Rousseau with utmost exactness and accuracy.\nP: While 'state' denotes the community as a whole, created by social pact and manifesting itself in supreme general will, 'government' denotes merely the individual or groups of individuals that is designated by the community to carry into effect the sovereign will.\nQ: Government, to Rousseau, means executive power.\nR: The individuals, to whom this power is assigned are the officers or the agents of the sovereign.\nS: The government is created not by any contract but by a decree of the sovereign, and its function is in no sense to make but only to administer law.\nS6: Collectively, they may be called 'prence' or 'magistracy'.\nThe Proper sequence should be:", "ans": ["PSQR", "QSPR", "RPQS", "SQRP"], "correct": "QSPR", "solution": "Government, to Rousseau, means executive power. The government is created not by any contract but by a decree of the sovereign, and its function is in no sense to make but only to administer law. While 'state' denotes the community as a whole, created by social pact and manifesting itself in supreme general will, 'government' denotes merely the individual or groups of individuals that is designated by the community to carry into effect the sovereign will. The individuals, to whom this power is assigned are the officers or the agents of the sovereign."}, {"qText": "S1: Primitive man was helpless and weak.\nP: He conceived of some divinity behind this.\nQ: As ages passed, he began to think and to investigate nature's mysteries.\nR: He bowed down before natural phenomena.\nS: The flash of lightning, the clap of thunder struck him with awe.\nS6: Today the knowledge gained from science has armed him with superhuman strength.\nThe Proper sequence should be:", "ans": ["PSQR", "RPSQ", "RSPQ", "RSQP"], "correct": "RPSQ", "solution": "He bowed down before natural phenomena. He conceived of some divinity behind this. The flash of lightning, the clap of thunder struck him with awe. As ages passed, he began to think and to investigate nature's mysteries."}, {"qText": "S1: We and all other animals breathe in and breathe out air all the time.\nP: If we stop breathing, we die.\nQ: It is because of this fact that we are able to live.\nR: It is called the atmosphere.\nS: All parts of the earth are surrounded by air.\nS6: It is a part of the earth.\nThe Proper sequence should be:", "ans": ["PQRS", "PRQS", "QPSR", "SRQP"], "correct": "QPSR", "solution": "It is because of this fact that we are able to live. If we stop breathing, we die. All parts of the earth are surrounded by air. It is called the atmosphere."}, {"qText": "S1: Trucks, trains planes and refrigerator ships are new ways of carrying food.\nP: In many countries, women carry food to market on their heads.\nQ: High in the Andes Mountains long lines of Illamas, each with a heavy bag of grain, pick their way along rocky trails.\nR: But a great deal of food is still carried on the heads of women and the backs of animals.\nS: Over the desert sands, camels carry loads of salt, dates and cheese from one oasis to another.\nS6: And in a lonely bay, a fisherman still rows home with the day's catch.\nThe Proper sequence should be:", "ans": ["PQRS", "RPQS", "RPSQ", "RSQP"], "correct": "RPSQ", "solution": "But a great deal of food is still carried on the heads of women and the backs of animals. In many countries, women carry food to market on their heads. Over the desert sands, camels carry loads of salt, dates and cheese from one oasis to another. High in the Andes Mountains long lines of Illamas, each with a heavy bag of grain, pick their way along rocky trails."}, {"qText": "S1: This is the story of a tram that woke up at dead of night and went off on a trip all by itself to end in a disaster.\nP: In the early morning of 19 January it suddenly started backing out of the depot on its own.\nQ: Tramways sources explained that power supply to the overhead wires at the siding had been switched off for some repair work.\nR: It went up a quarter mile away, crashed into state bus which caught fire went it smashed into an electric feeder box and a water tap.\nS: There was presumably, some defect in the reversal handle of the tram and its main switch had not been put off.\nS6: As a result, when the power supply was restored in the early morning the tram began to move.\nThe Proper sequence should be:", "ans": ["PQRS", "PRQS", "RPSQ", "RSPQ"], "correct": "PRQS", "solution": "In the early morning of 19 January it suddenly started backing out of the depot on its own. It went up a quarter mile away, crashed into state bus which caught fire went it smashed into an electric feeder box and a water tap. Tramways sources explained that power supply to the overhead wires at the siding had been switched off for some repair work. There was presumably, some defect in the reversal handle of the tram and its main switch had not been put off."}, {"qText": "S1: Growing up means not only getting larger, but also using our senses and our brains to become more aware of the things around us.\nP: Not only does he have a memory but he is able to think and reason.\nQ: In this, man differs from all other animals.\nR: Before we spray our roadside plants or turn sewage into our rivers, we should pause to think what the results of our actions are likely to be.\nS: That is to say, he is able to plan what he is going to do in the light of his experience before he does it.\nS6: In other words, we must develop and use our ability to reason, because the destruction or the preservation of the places in which we live depends on us.\nThe Proper sequence should be:", "ans": ["QPSR", "QRSP", "SPQR", "SPRQ"], "correct": "QPSR", "solution": "In this, man differs from all other animals. Not only does he have a memory but he is able to think and reason. That is to say, he is able to plan what he is going to do in the light of his experience before he does it. Before we spray our roadside plants or turn sewage into our rivers, we should pause to think what the results of our actions are likely to be."}, {"qText": "S1: But Mr. Ford was by no means the inventor of mass production.\nP: It is difficult, indeed, to say who was.\nQ: Brilliant men perfected cotton gins and looms.\nR: The invention of the steam-engine gave manufacturers the cheap power they needed.\nS: When the first large mills for the manufacture of cloth were built, mass production began.\nS6: When one huge machine began to perform rapidly due operations previously done slowly by hand, the age of mass production was born.\nThe Proper sequence should be:", "ans": ["PQRS", "PSQR", "PSRQ", "SPQR"], "correct": "PSRQ", "solution": "It is difficult, indeed, to say who was. When the first large mills for the manufacture of cloth were built, mass production began. The invention of the steam-engine gave manufacturers the cheap power they needed. Brilliant men perfected cotton gins and looms."}, {"qText": "S1: Obesity is a curse of modern times.\nP: As a result, what is lost is the natural goodness of roughage and important nutrients.\nQ: Invariably, fat and sugar which cause obesity are added to make food more palatable.\nR: In these days, food gets more refined and cooking methods are more intricate.\nS: Therefore, there are more obese people today than ever before.\nS6: This is because today's changed life styles often mean less physical exertion and an over indulgence in unhealthy food.\nThe Proper sequence should be:", "ans": ["QPRS", "RPQS", "RPSQ", "RQPS"], "correct": "RQPS", "solution": "In these days, food gets more refined and cooking methods are more intricate. Invariably, fat and sugar which cause obesity are added to make food more palatable. As a result, what is lost is the natural goodness of roughage and important nutrients. Therefore, there are more obese people today than ever before."}, {"qText": "S1: I was awakened in the night by a noise in the house.\nP: I quickly put on my dressing gown and crept downstairs.\nQ: In the living room I discovered two burglars breaking into my desk.\nR: As I switched on the light I saw that it was 2 o'clock.\nS: They were both tall, dark men.\nS6: As soon as they saw me standing there, they rushed to the window and jumped out.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "PSRQ", "RPQS"], "correct": "RPQS", "solution": "As I switched on the light I saw that it was 2 o'clock. I quickly put on my dressing gown and crept downstairs. In the living room I discovered two burglars breaking into my desk. They were both tall, dark men."}, {"qText": "S1: It is true we cannot bring about social equality by law and that therefore there are still inequalities in Indian society.\nP: In the United States of America, for instance, Negroes have equal rights under the constitution but unfortunately these rights are not always given to them freely by the White majority.\nQ: It takes time for people to change their way of thinking.\nR: This is a problem common to many countries.\nS: It is only when we realise that social equality means not only that men are equal before the law, but also equal in the eyes of god that we can begin to have a completely caste less society.\nS6: The secular state as found in India, recognises the importance of religion to the individual by giving him freedom to practice it and tell others about it, within the limits of the constitution.\nThe Proper sequence should be:", "ans": ["RPQS", "RQPS", "SPQR", "SRQP"], "correct": "RPQS", "solution": "This is a problem common to many countries. In the United States of America, for instance, Negroes have equal rights under the constitution but unfortunately these rights are not always given to them freely by the White majority. It takes time for people to change their way of thinking. It is only when we realise that social equality means not only that men are equal before the law, but also equal in the eyes of god that we can begin to have a completely caste less society."}, {"qText": "S1: Ms. Subramaniam started a petrol pump in Madras.\nP: A total of twelve girls now work at the pump.\nQ: She advertised in newspaper for women staff.\nR: They operate in two shifts.\nS: The response was good.\nS6: Thus she has shown the way for many others.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "QSPR", "SQPR"], "correct": "QSPR", "solution": "She advertised in newspaper for women staff. The response was good. A total of twelve girls now work at the pump. They operate in two shifts."}, {"qText": "S1: Science means finding out how things actually do happen.\nP: He showed that a light object falls to the ground at the same rate as a heavy object.\nQ: It does not mean laying down principles as to how they ought to happen.\nR: This did not agree with the views of most learned men of that time.\nS: The most famous example of this concerns Galileo's discovery about falling bodies.\nS6: But Galileo proved his point experimentally by dropping weights from the Leaning Tower of Pisa.\nThe Proper sequence should be:", "ans": ["PSQR", "QSPR", "RQPS", "SQPR"], "correct": "QSPR", "solution": "It does not mean laying down principles as to how they ought to happen. The most famous example of this concerns Galileo's discovery about falling bodies. He showed that a light object falls to the ground at the same rate as a heavy object. This did not agree with the views of most learned men of that time."}, {"qText": "S1: Moncure Conway devoted his life to two great objects : freedom of thought, and freedom of the individual.\nP: They threaten both kinds of freedom.\nQ: But something also has been lost.\nR: There are now dangers, somewhat different in form from those of the past ages.\nS: In regard to both these objects, something has been gained since his time.\nS6: Unless a vigorous and vigilant public opinion can be aroused in defence of them, there will be much less of both a hundred years hence than there is now.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "RSPQ", "SQRP"], "correct": "SQRP", "solution": "In regard to both these objects, something has been gained since his time. But something also has been lost. There are now dangers, somewhat different in form from those of the past ages. They threaten both kinds of freedom."}, {"qText": "S1: Human ways of life have steadily changed.\nP: From that time to this, civilisation has always been changing.\nQ: About ten thousand years ago, man lived entirely by hunting.\nR: Ancient Egypt-Greece-the Roman Empire-the Dark Ages and the Middle Ages - the Renaissance-the age of modern science and of modern nations one has succeeded the other; and history has never stood still.\nS: A settled, civilised life began only when agriculture was discovered.\nS6: During the last few years change has been even more rapid than usual.\nThe Proper sequence should be:", "ans": ["QSPR", "QSRP", "RSQP", "SPRQ"], "correct": "QSRP", "solution": "About ten thousand years ago, man lived entirely by hunting. A settled, civilised life began only when agriculture was discovered. Ancient Egypt-Greece-the Roman Empire-the Dark Ages and the Middle Ages - the Renaissance-the age of modern science and of modern nations one has succeeded the other; and history has never stood still. From that time to this, civilisation has always been changing."}, {"qText": "S1: The city is almost a slum and stinks most of the time.\nP: The slush on the road did not deter them.\nQ: The occasional slips and falls were considered a small price to pay for the trip.\nR: They were excited, fascinated by the sight of fresh snow on the road.\nS: Even so, it looked beautiful to tourists of various categories.\nS6: But some visitors came away with the unforgettable sight of young labourers scantily clad.\nThe Proper sequence should be:", "ans": ["QPRS", "RQPS", "RSQP", "SPQR"], "correct": "SPQR", "solution": "Even so, it looked beautiful to tourists of various categories. The slush on the road did not deter them. The occasional slips and falls were considered a small price to pay for the trip. They were excited, fascinated by the sight of fresh snow on the road."}, {"qText": "S1: When a body grows into a young man, he finds himself in a new and strange world.\nP: The relationship remains but its nature changes.\nQ: The emotional ties that he had with them are now loosened.\nR: The old pattern of his life in which his parents were the nucleus around which his life revolved now undergoes a change.\nS: He finds in himself an emotional void which he must somehow fill.\nS6: At this stage of his life he is like a body without a soul, an eye without light or a flower without fragrance.\nThe Proper sequence should be:", "ans": ["PRQS", "RQPS", "RSQP", "SRPQ"], "correct": "RQPS", "solution": "The old pattern of his life in which his parents were the nucleus around which his life revolved now undergoes a change. The emotional ties that he had with them are now loosened. The relationship remains but its nature changes. He finds in himself an emotional void which he must somehow fill."}, {"qText": "S1: Ingratitude stings strongest where relationship is closest.\nP: Expectation turns innocent relationship into commerce.\nQ: Human relationship is adulterated with sly commerce.\nR: In commerce, of course, give and take is understood.\nS: Most relationships are founded on mutual expectations.\nS6: From any warm and healthy human relationship expectation of returns has to be weeded out.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "RPSQ", "SRQP"], "correct": "RPSQ", "solution": "In commerce, of course, give and take is understood. Expectation turns innocent relationship into commerce. Most relationships are founded on mutual expectations. Human relationship is adulterated with sly commerce."}, {"qText": "S1: If you want to do well in your examinations you need to be able to think for yourself which means not just following the guide-books but write what you think yourself.\nP: That will not help much.\nQ: Few if any students do this.\nR: By discussing things with other students, with your teachers, and with any intelligent people you meet you will find you can pick up a lot of new ideas but it is not good first accepting these ideas, swallowing them undigested and then repeating them in the examination.\nS: At first you will find it difficult but if you go on trying you will find clear independent thought becomes easier.\nS6: If however you turn these ideas over in our mind accepting those which you agree with and fitting them into your stock of knowledge and rejecting the others you may get somewhere.\nThe Proper sequence should be:", "ans": ["PSQR", "QSRP", "RSQP", "SRQP"], "correct": "QSRP", "solution": "Few if any students do this. At first you will find it difficult but if you go on trying you will find clear independent thought becomes easier. By discussing things with other students, with your teachers, and with any intelligent people you meet you will find you can pick up a lot of new ideas but it is not good first accepting these ideas, swallowing them undigested and then repeating them in the examination. That will not help much."}, {"qText": "S1: We are living in an age in which technology has suddenly 'annihilated distance'.\nP: Are we going to let this consciousness of our variety make us fear and hate each other?\nQ: Physically we are now all neighbours, psychologically we are still strangers to each other.\nR: How are we going to react?\nS: We have never been so conscious of our variety as we are now that we have come to such close quarters.\nS6: In that event, we should be dooming ourselves to wipe each other out.\nThe Proper sequence should be:", "ans": ["PQSR", "PSQR", "QSRP", "RQSP"], "correct": "QSRP", "solution": "Physically we are now all neighbours, psychologically we are still strangers to each other. We have never been so conscious of our variety as we are now that we have come to such close quarters. How are we going to react? Are we going to let this consciousness of our variety make us fear and hate each other?"}, {"qText": "S1: As a dramatist Rabindranath was not what might be called a success.\nP: His dramas were moulded more on the lines of the traditional Indian village dramas than the dramas of the modern world.\nQ: His plays were more a catalogue of ideas than a vehicle of the expression of action.\nR: Actually drama has always been the life of the Indian people, as it deals with legends of gods and goddesses.\nS: Although in his short stories and novels he was able to create living and well-defined characters, he did not seem to be able to do so in his dramas.\nS6: Therefore, drama forms the essential part of the traditional Indian culture.\nThe Proper sequence should be:", "ans": ["QPSR", "QSPR", "RSQP", "SRQP"], "correct": "QSPR", "solution": "His plays were more a catalogue of ideas than a vehicle of the expression of action. Although in his short stories and novels he was able to create living and well-defined characters, he did not seem to be able to do so in his dramas. His dramas were moulded more on the lines of the traditional Indian village dramas than the dramas of the modern world. Actually drama has always been the life of the Indian people, as it deals with legends of gods and goddesses."}, {"qText": "S1: One of the most dangerous insect pests is the locust.\nP: At first they look just like ordinary grasshoppers, which are harmless and unable to fly very far.\nQ: Until about thirty years ago, no one knew where locusts came from or why they appeared in the different countries they attacked.\nR: Then they change in appearance and develop wings which enable them to fly long distance.\nS: Then it was discovered that there are two stages in the life of locusts.\nS6: At this stage, they gather in huge numbers and rise from the ground on theri powerful wings in cloud.\nThe Proper sequence should be:", "ans": ["PSQR", "PSRQ", "QSPR", "QSRP"], "correct": "QSPR", "solution": "Until about thirty years ago, no one knew where locusts came from or why they appeared in the different countries they attacked. Then it was discovered that there are two stages in the life of locusts. At first they look just like ordinary grasshoppers, which are harmless and unable to fly very far. Then they change in appearance and develop wings which enable them to fly long distance."}, {"qText": "S1: In 1857, fighting broke out all over the country.\nP: Everywhere the people rose in rebellion.\nQ: In March 1858 British troops attacked the fort of Jhansi.\nR: Thousands of people were killed on both sides.\nS: The British fought back.\nS6: The Rani's troops fought back bravely.\nThe Proper sequence should be:", "ans": ["PSRQ", "QSPR", "RPSQ", "SQPR"], "correct": "PSRQ", "solution": "Everywhere the people rose in rebellion. The British fought back. Thousands of people were killed on both sides. In March 1858 British troops attacked the fort of Jhansi."}, {"qText": "S1: Savita was lonely in the house.\nP: She was very good at that.\nQ: She sat all day in a little room off the main drawing room.\nR: She would sit on the rug and do needle work.\nS: It was a little room with nothing in it but a few chairs and a rug.\nS6: It was the only thing she had learnt from the Convent school.\nThe Proper sequence should be:", "ans": ["PQRS", "QSRP", "RSPQ", "SRPQ"], "correct": "QSRP", "solution": "She sat all day in a little room off the main drawing room. It was a little room with nothing in it but a few chairs and a rug. She would sit on the rug and do needle work. She was very good at that."}, {"qText": "S1: We talk about democracy, but when it comes to any particular thing, we prefer a man belonging to our caste and community.\nP: We must be in a position to respect a man as a man.\nQ: It means our democracy is a phoney kind of democracy.\nR: We must extend opportunities of development to those who deserve them.\nS: Our weakness for our own caste and community should not influence our decision.\nS6: Favouritism and nepotism have been responsible for much discontent in our country.\nThe Proper sequence should be:", "ans": ["PQRS", "QPRS", "RPQS", "SRPQ"], "correct": "QPRS", "solution": "It means our democracy is a phoney kind of democracy. We must be in a position to respect a man as a man. We must extend oppurtunities of development to those who deserve them. Our weakness for our own caste and community should not influence our decision."}, {"qText": "S1: A man handed a pair of trousers to the departmental store-clerk and said,\"I'd like these altered, please\".\nP: He said that free alteration is not possible without a receipt.\nQ: The man said,\"Okay, I'd like to return the trousers\". The clerk took them back and returned his money.\nR: The man pushed the money and said,\"Now I want to buy them\". The clerk put the trousers in a bag, issued receipt and handed him both.\nS: The clerk asked for the sales receipt but after searching his pockets the man replied that he had lost it.\nS6: Triumphantly he put the trousers and the receipt on the counter and said,'I'd like to have these altered, please.\"\nThe Proper sequence should be:", "ans": ["PSQR", "PSRQ", "QRPS", "SPQR"], "correct": "SPQR", "solution": "The clerk asked for the sales receipt but after searching his pockets the man replied that he had lost it. He said that free alteration is not possible without a receipt. The man said,\"Okay, I'd like to return the trousers\". The clerk took them back and returned his money. The man pushed the money and said,\"Now I want to buy them\". The clerk put the trousers in a bag, issued receipt and handed him both."}, {"qText": "S1: Forecasting the weather has always been a difficult business.\nP: During a period of drought, streams and rivers dried up, the cattle died from thirst and the crops were ruined.\nQ: Many different things affect the weather and we have to study them carefully to make an accurate forecast.\nR: Ancient Egyptians had no need of this weather in the Nile valley hardly ever changes.\nS: In early times, when there were no instruments, such as thermometer or the barometer, man looked for tell-tale signs in the sky.\nS6: He made his forecasts by watching flights of the birds or the way smoke rose from fire.\nThe Proper sequence should be:", "ans": ["PRQS", "QPRS", "QRPS", "SPQR"], "correct": "QPRS", "solution": "Many different things affect the weather and we have to study them carefully to make an accurate forecast. During a period of drought, streams and rivers dried up, the cattle died from thirst and the crops were ruined. Ancient Egyptians had no need of this weather in the Nile valley hardly ever changes. In early times, when there were no instruments, such as thermometer or the barometer, man looked for tell-tale signs in the sky."}, {"qText": "S1: The motor car is one of the useful gifts of modern science.\nP: One of these is the smoke and pollution that it creates.\nQ: It has made short and medium distance journeys fast and comfortable.\nR: The other is that it has made journey by road hazardous.\nS: Yet we can't say that a motor car is a blessing without disadvantages.\nS6: Finally in this age of energy crisis a personal car is an expensive thing.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "RSPQ", "SPQR"], "correct": "QSPR", "solution": "It has made short and medium distance journeys fast and comfortable. Yet we can't say that a motor car is a blessing without disadvantages. One of these is the smoke and pollution that it creates. The other is that it has made journey by road hazardous."}, {"qText": "S1: The earliest reference to the playing card has been found in China, as long ago as the tenth century.\nP: They appeared in Italy around 1320.\nQ: Long before that the Chinese use paper money which was similar in design to the playing cards.\nR: It is believed that perhaps travelling gypsies introduced them to Europe.\nS: In olden days cards were used both for telling fortune and playing games.\nS6: The current pack of 52 cards was only regulated in the seventeenth century.\nThe Proper sequence should be:", "ans": ["QRSP", "QSRP", "RQSP", "RSQP"], "correct": "QRSP", "solution": "Long before that the Chinese use paper money which was similar in design to the playing cards. It is believed that perhaps travelling gypsies introduced them to Europe. In olden days cards were used both for telling fortune and playing games. They appeared in Italy around 1320."}, {"qText": "S1: Evolution is not progress.\nP: And yet, for all their differences, it is not wholly wrong to identify evolution with progress.\nQ: As a noted scientist had said,\"the tapeworm in its inglorious lot in man's intestine is an outcome of evolution as well as the lark at heaven's gate.\"\nR: Three hundred million years after the first land creatures crawled out of the sea, the one-called amoeba is man himself.\nS: The physical facts of evolution betray such advance.\nS6: For, like progress, evolution does, over the long run, imply betterment.\nThe Proper sequence should be:", "ans": ["QPSR", "RPSQ", "SPQR", "SRQP"], "correct": "SPQR", "solution": "The physical facts of evolution betray such advance. And yet, for all their differences, it is not wholly wrong to identify evolution with progress. As a noted scientist had said,\"the tapeworm in its inglorious lot in man's intestine is an outcome of evolution as well as the lark at heaven's gate.\" Three hundred million years after the first land creatures crawled out of the sea, the one-called amoeba is man himself."}, {"qText": "S1: As I say, I was born and brought up in an atmosphere of the confluence of three movements, all of which were revolutionary.\nP: I was born in a family which had to live its own life, which led me from my young days to seek guidance for my own self-expression in my own inner standard of judgement.\nQ: No poet should borrow his medium ready-made from some shop of respectability.\nR: But the language which belonged to the people had to be modulated according to the urging which I as an individual had.\nS: The medium of expression, doubtless, was my mother tongue.\nS6: He should not only have his own seeds but prepare his own soil.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "PSRQ", "QSRP"], "correct": "PSRQ", "solution": "I was born in a family which had to live its own life, which led me from my young days to seek guidance for my own self-expression in my own inner standard of judgement. The medium of expression, doubtless, was my mother tongue. But the language which belonged to the people had to be modulated according to the urging which I as an individual had. No poet should borrow his medium ready-made from some shop of respectability."}, {"qText": "S1: Welcome to Madam Tussaud's.\nP: Famous faces, notorious faces haunt these halls; royalty, and world leaders mingling with sports stars and murderers.\nQ: But don't expect any responses to your smiles or greetings.\nR: Don't be surprised at anything you see here.\nS: See how many you can recognise.\nS6: These life-like, casually posed figures are mere wax statues, though they may look alive.\nThe Proper sequence should be:", "ans": ["PSRQ", "QRPS", "RPSQ", "SQRP"], "correct": "RPSQ", "solution": "Don't be surprised at anything you see here. Famous faces, notorious faces haunt these halls; royalty, and world leaders mingling with sports stars and murderers. See how many you can recognise. But don't expect any responses to your smiles or greetings."}, {"qText": "S1: In the last few years, there has been increasing realisation of the importance of fibrous diet.\nP: Its role in human nutrition was not fully understood.\nQ: Plants contain indigestible substances in their cell-walls, and these contain fibre.\nR: Later research has thrown light on many other ingredients that are not digested by man.\nS: In the early days, people only knew that this fibre prevented constipation.\nS6: This has resulted in a better appreciation of the role of fibrous food in human health.\nThe Proper sequence should be:", "ans": ["PQRS", "QSRP", "SPRQ", "SQPR"], "correct": "SPRQ", "solution": "In the early days, people only knew that this fibre prevented constipation. Its role in human nutrition was not fully understood. Later research has thrown light on many other ingredients that are not digested by man. Plants contain indigestible substances in their cell-walls, and these contain fibre."}, {"qText": "S1: The 'age of computers' is considered to have begun in 1946.\nP: Those early computers were huge and heavy affairs, with problems of speed and size.\nQ: It was only with the introduction of electronics that the computers really came of age.\nR: But computers were in use long before that.\nS: They had several rotating shafts and gears which almost always doomed them to slow operation.\nS6: And now it is difficult to find a field where computers are not used.\nThe Proper sequence should be:", "ans": ["PRQS", "PRSQ", "RPQS", "RPSQ"], "correct": "RPSQ", "solution": "But computers were in use long before that. Those early computers were huge and heavy affairs, with problems of speed and size. They had several rotating shafts and gears which almost always doomed them to slow operation. It was only with the introduction of electronics that the computers really came of age."}, {"qText": "S1: After the firing that evening the street that used to be full of people was completely deserted.\nP: Nor were any windows open or lighted.\nQ: Suddenly I detected a movement to my left.\nR: There was no trace of any human being and all doors were firmly closed.\nS: Surprisingly, even the stray dogs had disappeared.\nS6: I was so frightened that I ran for my life.\nThe Proper sequence should be:", "ans": ["PQRS", "PSQR", "RPSQ", "RSPQ"], "correct": "RPSQ", "solution": "There was no trace of any human being and all doors were firmly closed. Nor were any windows open or lighted. Surprisingly, even the stray dogs had disappeared. Suddenly I detected a movement to my left."}, {"qText": "S1: Hungary, with a population of about ten million, lies between Czechoslovakia to the north and Yugoslavia to the south.\nP: Here a great deal of grain is grown.\nQ: In recent years, however, progress has been made also in the field of industrialisation.\nR: Most of this country consists of an extremely fertile plain, through which the river Danube flows.\nS: In addition to grain, the plain produces potatoes, sugar, wine and livestock.\nS6: The new industries derive mainly from agricultural production.\nThe Proper sequence should be:", "ans": ["PRSQ", "QRSP", "RPSQ", "RQSP"], "correct": "RPSQ", "solution": "Most of this country consists of an extremely fertile plain, through which the river Danube flows. Here a great deal of grain is grown. In addition to grain, the plain produces potatoes, sugar, wine and livestock. In recent years, however, progress has been made also in the field of industrialisation."}, {"qText": "S1: When Weiner was travelling in India, he visited a factory where he saw small frail children sitting on damp ground.\nP: And the answer he got was that they were weaving carpets there.\nQ: So he asked,\"What are they doing there?\"\nR: And then he decided to study the problems of child labourers in India.\nS: Weiner was shocked at the plight of the child workers.\nS6: Recently he has published this book and it is winning him acclaim all over the world.\nThe Proper sequence should be:", "ans": ["PQRS", "QPSR", "RPQS", "RPSQ"], "correct": "QPSR", "solution": "So he asked,\"What are they doing there?\" And the answer he got was that they were weaving carpets there. Weiner was shocked at the plight of the child workers. And then he decided to study the problems of child labourers in India."}, {"qText": "S1: There are divergent theories of education.\nP: There is still another which holds that education has to be considered rather in relation to community than to the other.\nQ: Yet again, some believe that a right proportion of all the theories should go into every system.\nR: The other holds that the purpose of education is to impart culture.\nS: The first considers that the sole purpose of education is to provide opportunities for growth.\nS6: No actual education proceeds wholly and completely on any one of the theories.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "SRPQ", "SRQP"], "correct": "SRPQ", "solution": "The first considers that the sole purpose of education is to provide opportunities for growth. The other holds that the purpose of education is to impart culture. There is still another which holds that education has to be considered rather in relation to community than to the other. Yet again, some believe that a right proportion of all the theories should go into every system."}, {"qText": "S1: We don't see many banyan trees in our cities now-a-days.\nP: But in our overcrowded cities, where there is barely enough living space for people, banyan trees don't have much of a chance.\nQ: These trees like to have plenty of space in which to spread themselves out.\nR: Of course, many parks have banyan trees.\nS: After all, a full grown banyan takes up as large an area as a three-storey apartment building.\nS6: And every village has at least one.\nThe Proper sequence should be:", "ans": ["PQRS", "QPSR", "RSQP", "SRPQ"], "correct": "QPSR", "solution": "These trees like to have plenty of space in which to spread themselves out. But in our overcrowded cities, where there is barely enough living space for people, banyan trees don't have much of a chance. After all, a full grown banyan takes up as large an area as a three-storey apartment building. Of course, many parks have banyan trees."}, {"qText": "S1: While talking to a group, one should feel self-confident and courageous.\nP: Nor is it a gift bestowed by providence on only a few.\nQ: One should also learn how to think calmly and clearly.\nR: It is like the ability to play golf.\nS: It is not as difficult as most men imagine.\nS6: Any man can develop his capacity if he has the desire to do so.\nThe Proper sequence should be:", "ans": ["QRSP", "QSPR", "RSQP", "SQPR"], "correct": "QSPR", "solution": "One should also learn how to think calmly and clearly. It is not as difficult as most men imagine. Nor is it a gift bestowed by providence on only a few. It is like the ability to play golf."}, {"qText": "S1: Nobody likes staying at home on a public holiday - especially if the weather is fine.\nP: We had brought plenty of food with us and we got it out of the car.\nQ: The only difficulty was that millions of other people had the same idea.\nR: Now everything was ready so we sat down near a path at the foot of a hill.\nS: We moved out of the city slowly behind a long line of cars, but at last we came to a quiet country road and, after sometime, stopped at a lonely farm.\nS6: It was very peaceful in the cool grass-until we heard bells ringing at the top of the hill.\nThe Proper sequence should be:", "ans": ["PQRS", "PSQR", "QSPR", "SPQR"], "correct": "QSPR", "solution": "The only difficulty was that millions of other people had the same idea. We moved out of the city slowly behind a long line of cars, but at last we came to a quiet country road and, after sometime, stopped at a lonely farm. We had brought plenty of food with us and we got it out of the car. Now everything was ready so we sat down near a path at the foot of a hill."}, {"qText": "S1: In hunting and gathering societies people live in what anthropologists call \"the seasonal round\".\nP: When the salmon are running, it comes to the stream; when the wild grasses must be gathered, the band moves on again.\nQ: The tribal band is delicately adjusted to nature.\nR: It circulates through space in the rhythm of the seasons each year.\nS: It moves through space with the flow of time.\nS6: The circle is not broken into a line; the tribe does not stay in one place altering nature to suit the needs of the human settlement.\nThe Proper sequence should be:", "ans": ["PRQS", "QPRS", "QSPR", "RPQS"], "correct": "QSPR", "solution": "The tribal band is delicately adjusted to nature. It moves through space with the flow of time. When the salmon are running, it comes to the stream; when the wild grasses must be gathered, the band moves on again. It circulates through space in the rhythm of the seasons each year."}, {"qText": "S1: Reena went shopping one morning.\nP: Disappointed she turned around and returned to the parking lot.\nQ: She got out and walked to the nearest shop.\nR: She drove her car into the parking lot and stopped.\nS: It was there that she realised that she'd forgotten her purse at home.\nS6: She drove hoe with an empty shopping basket.\nThe Proper sequence should be:", "ans": ["PQRS", "QPRS", "RQSP", "RSQP"], "correct": "RQSP", "solution": "She drove her car into the parking lot and stopped. She got out and walked to the nearest shop. It was there that she realised that she'd forgotten her purse at home. Disappointed she turned around and returned to the parking lot."}, {"qText": "S1: Those are fortunate people who have good, true and faithful friends.\nP: It is a scared attachment or a bond of intimacy between two persons of a congenial mind.\nQ: True friendship increases our happiness in prosperity and diminishes our misery in adversity.\nR: Friendship often springs from similarity of taste, feelings and sentiments.\nS: However, true friendship should be based on truth and such vices as selfishness, greed and falsehood should be kept out of it.\nS6: It must be borne in mind that prosperity breeds and multiplies friends and adversity tests them.\nThe Proper sequence should be:", "ans": ["PQRS", "QRPS", "RPQS", "SPRQ"], "correct": "RPQS", "solution": "Friendship often springs from similarity of taste, feelings and sentiments. It is a scared attachment or a bond of intimacy between two persons of a congenial mind. True friendship increases our happiness in prosperity and diminishes our misery in adversity. However, true friendship should be based on truth and such vices as selfishness, greed and falsehood should be kept out of it."}, {"qText": "S1: In the eighteenth century people expected most of their children to die before they were grown up.\nP: Improvement began at the beginning of the nineteenth century, chiefly owing to vaccination.\nQ: The general death rate in 1948(10.8) was the lowest ever recorded up to that date.\nR: In 1920 the infant mortality in England and Wales was 80 per thousand, in 1948 it was 34 per thousand.\nS: It has continued ever since and is still continuing.\nS6: There is no obvious limit to the improvement of health that can be brought about by medicine.\nThe Proper sequence should be:", "ans": ["PSRQ", "QRPS", "RQPS", "SPQR"], "correct": "PSRQ", "solution": "Improvement began at the beginning of the nineteenth century, chiefly owing to vaccination. It has continued ever since and is still continuing. In 1920 the infant mortality in England and Wales was 80 per thousand, in 1948 it was 34 per thousand. The general death rate in 1948(10.8) was the lowest ever recorded up to that date."}, {"qText": "S1: The exact cause of migraine is still not known.\nP: Several factors like digestive disorders and psychological disturbances, have been said to be causative factors.\nQ: Certain foods like cheese, chocolate or red wine have also been found to trigger off an attack.\nR: The causative factors are numerous : psychologically, anxiety and frustration play an important part.\nS: It seems to be hereditary and a majority of sufferers are women.\nS6: On the other hand physical overexertion, fatigue, irregularities in dietary habits, prolonged eye strain are common precipitating factors.\nThe Proper sequence should be:", "ans": ["QPRS", "RQPS", "SPQR", "SQPR"], "correct": "SPQR", "solution": "It seems to be hereditary and a majority of sufferers are women. Several factors like digestive disorders and psychological disturbances, have been said to be causative factors. Certain foods like cheese, chocolate or red wine have also been found to trigger off an attack. The causative factors are numerous : psychologically, anxiety and frustration play an important part."}, {"qText": "S1: The real cause for the rise and fall of the sea level was not known to men for a long time.\nP: They found out that the Moon is a satellite and it travels a regular path around the Earth.\nQ: As time passed and knowledge increased, men began to learn more about the heaven and the stars and the planets.\nR: They noticed that the Moon rose each day about an hour later than it rose the day before and the peak of the high tide also comes about an hour later each day.\nS: Some imagined that the Earth itself was alive and the rising and falling of the tide was caused by the breathing of the Earth's big body.\nS6: So they concluded that the Moon and the tide are connected in some way.\nThe Proper sequence should be:", "ans": ["PRQS", "QPRS", "SQPR", "SRQP"], "correct": "SQPR", "solution": "Some imagined that the Earth itself was alive and the rising and falling of the tide was caused by the breathing of the Earth's big body. As time passed and knowledge increased, men began to learn more about the heaven and the stars and the planets. They found out that the Moon is a satellite and it travels a regular path around the Earth. They noticed that the Moon rose each day about an hour later than it rose the day before and the peak of the high tide also comes about an hour later each day."}, {"qText": "S1: The future beckons to us.\nP: In fact we have hard work ahead.\nQ: Where do we go and what shall be our endeavour?\nR: We shall also have to fight and end poverty, ignorance and disease.\nS: It will be to bring freedom and opportunity to the common man.\nS6: There is no resting for anyone of us till we redeem our pledge in full.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "QSRP", "SRPQ"], "correct": "QSRP", "solution": "Where do we go and what shall be our endeavour? It will be to bring freedom and opportunity to the common man. We shall also have to fight and end poverty, ignorance and disease. In fact we have hard work ahead."}, {"qText": "S1: Machines have parts made of iron.\nP: They must be painted or chrome plated.\nQ: Some parts rub against each other.\nR: Iron gets rusted.\nS: They must be lubricated with oil or grease.\nS6: When the machine is not in use, it should be covered.\nThe Proper sequence should be:", "ans": ["PRQS", "QRPS", "QSRP", "RPQS"], "correct": "RPQS", "solution": "Iron gets rusted. They must be painted or chrome plated. Some parts rub against each other. They must be lubricated with oil or grease."}, {"qText": "S1: At the age of four, Jagadish Chandra Bose was sent to a village 'pathshala'.\nP: This step proved beneficial to the boy, for he thus became familiar with his mother tongue and learnt to read and write it.\nQ: This was very unusual because a man of his father's status was expected to send his son to an English school.\nR: He also became acquainted with some people of the rich treasures of Indian culture.\nS: At the same time he mixed with children of all castes and lost the sense of class superiority.\nS6: His mother, too, reinforced what he learnt and did at school.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "RSQP", "SQRP"], "correct": "QPSR", "solution": "This was very unusual because a man of his father's status was expected to send his son to an English school. This step proved beneficial to the boy, for he thus became familiar with his mother tongue and learnt to read and write it. At the same time he mixed with children of all castes and lost the sense of class superiority. He also became acquainted with some people of the rich treasures of Indian culture."}, {"qText": "S1: I never took payment for speaking.\nP: The Sunday Society would then assure me that on these terms I might lecture on anything I liked and how I liked.\nQ: It often happened that provincial Sunday societies offered me the usual ten genuine fee to give the usual sort of lecture, avoiding controversial politics and religion.\nR: Occasionally to avoid embarrassing other lecturers who lived by lecturing, the account was settled by a debit and credit entry, that is, I was credited with the usual fee and expenses and gave it back as a donation to the society.\nS: I always replied that I never lectured on anything but very controversial politics and religion and that my fee was the price of my railway ticket third class if the place was farther off than I could afford to go at my own expense.\nS6: In this way I secured perfect freedom of speech, and was warmed against the accusation of being a professional agitator.\nThe Proper sequence should be:", "ans": ["QSPR", "QSRP", "SQPR", "SQRP"], "correct": "QSRP", "solution": "It often happened that provincial Sunday societies offered me the usual ten genuine fee to give the usual sort of lecture, avoiding controversial politics and religion. I always replied that I never lectured on anything but very controversial politics and religion and that my fee was the price of my railway ticket third class if the place was farther off than I could afford to go at my own expense. Occasionally to avoid embarrassing other lecturers who lived by lecturing, the account was settled by a debit and credit entry, that is, I was credited with the usual fee and expenses and gave it back as a donation to the society. The Sunday Society would then assure me that on these terms I might lecture on anything I liked and how I liked."}, {"qText": "S1: In ancient Indian history the city of Ujjain was quite famous.\nP: Here lived at one time the poet Kalidasa.\nQ: He was a famous learned astronomer.\nR: And here also worked and visited Rajah Jaysingh of Jaipur.\nS: It was always renowned as a seat of learning.\nS6: So one can see what a great love all who care for India must feel for the ancientry of Ujjain.\nThe Proper sequence should be:", "ans": ["PSRQ", "QSRP", "SPRQ", "SRPQ"], "correct": "SPRQ", "solution": "It was always renowned as a seat of learning. Here lived at one time the poet Kalidasa. And here also worked and visited Rajah Jaysingh of Jaipur. He was a famous learned astronomer."}, {"qText": "S1: Useful human beings are divided into two classes : those whose work is work and pleasure; and those whose work and pleasure are one.\nP: The long hours in the office or factory give them keen appetite for pleasure even in its most modest forms.\nQ: Their life is a natural harmony.\nR: Of these the former are in majority.\nS: But fortune's favoured children belong to the second class.\nS6: For them the working hours are never long enough.\nThe Proper sequence should be:", "ans": ["PSQR", "QPRS", "RPSQ", "SQPR"], "correct": "RPSQ", "solution": "Of these the former are in majority. The long hours in the office or factory give them keen appetite for pleasure even in its most modest forms. But fortune's favoured children belong to the second class. Their life is a natural harmony."}, {"qText": "S1: Governments are instituted among men to secure their certain inalienable rights.\nP: Accordingly, men are more disposed to suffer than to right themselves by abolishing the forms of governments to which they are accustomed.\nQ: But prudence will dictate that governments long established should not be changed for light and transient causes.\nR: They derive their just powers from the consent of the governed, and therefore, can also be changed by them.\nS: But whenever any form of government becomes destructive of these rights of the people, it is their duty to throw off such a government.\nS6: Such was the necessity which constrained the united colonies of America to give up their allegiance to the British Crown and declare themselves free and independent states.\nThe Proper sequence should be:", "ans": ["PRSQ", "QRPS", "RQPS", "SRQP"], "correct": "RQPS", "solution": "They derive their just powers from the consent of the governed, and therefore, can also be changed by them. But prudence will dictate that governments long established should not be changed for light and transient causes. Accordingly, men are more disposed to suffer than to right themselves by abolishing the forms of governments to which they are accustomed. But whenever any form of government becomes destructive of these rights of the people, it is their duty to throw off such a government."}, {"qText": "S1: Just as some men like to play football or tennis, so some men like to climb mountains.\nP: This is often very difficult to do, for mountains are not just big hills.\nQ: Paths are usually very steep, and some mountain sides are straight up and down, so that it may take many hours to climb as little as one hundred feet.\nR: There is always the danger that you may fall off and be killed or injured.\nS: Men talk about conquering a mountain, and the wonderful feeling it is to reach the top of a mountain after climbing for hours and may be, even for days.\nS6: You look down and see the whole country below you.\nThe Proper sequence should be:", "ans": ["PQRS", "QPSR", "RQPS", "SRQP"], "correct": "PQRS", "solution": "This is often very difficult to do, for mountains are not just big hills. Paths are usually very steep, and some mountain sides are straight up and down, so that it may take many hours to climb as little as one hundred feet. There is always the danger that you may fall off and be killed or injured. Men talk about conquering a mountain, and the wonderful feeling it is to reach the top of a mountain after climbing for hours and may be, even for days."}, {"qText": "S1: The fifty seven storey Wool-worth Tower is in New York.\nP: Soon it became one of the famous buildings in the world.\nQ: It was completed in 1912.\nR: Americans took pride in this tall skyscraper.\nS: However, it was not long before five other buildings topped the Woolworth Tower.\nS6: A new champion is the Empire State Building which rises 102 storeys into the sky.\nThe Proper sequence should be:", "ans": ["PQRS", "QPRS", "QRSP", "RPQS"], "correct": "QPRS", "solution": "It was completed in 1912. Soon it became one of the famous buildings in the world. Americans took pride in this tall skyscraper. However, it was not long before five other buildings topped the Woolworth Tower."}, {"qText": "S1: A certain young man was entrusted to the care of a teacher.\nP: This dullard will come to grief if I send him away without a single lesson, thought the teacher.\nQ: He was so dull of mind that he could not, even in three months, time, learn as much as a single lesson.\nR: The young man came to ask the teacher's permission to go home.\nS: It's my business to provide agood education to my pupils, to get on in life.\nS6: The teacher asked him to wait.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "RQPS", "SRQP"], "correct": "QPSR", "solution": "He was so dull of mind that he could not, even in three months, time, learn as much as a single lesson. This dullard will come to grief if I send him away without a single lesson, thought the teacher. It's my business to provide agood education to my pupils, to get on in life. The young man came to ask the teacher's permission to go home."}, {"qText": "S1: American private lives may seem shallow.\nP: Students would walk away with books they had not paid for.\nQ: A Chinese journalist commented on a curious institution: the library.\nR: Their public morality, however, impressed visitors.\nS: But in general they returned them.\nS6: This would not happen in China, he said.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "RPSQ", "RQPS"], "correct": "RQPS", "solution": "Their public morality, however, impressed visitors. A Chinese journalist commented on a curious institution: the library. Students would walk away with books they had not paid for. But in general they returned them."}, {"qText": "S1: Widowhood in India used to be specially miserable.\nP: There were widows even in ages ranging from five to ten.\nQ: A widow was a widow always.\nR: However, several communities began to rebel against the ill-treatment of widows.\nS: She could not marry again however tender in age she might be.\nS6: Today nobody looks upon remarriage of widows with disgust or disapproval.\nThe Proper sequence should be:", "ans": ["PRSQ", "QSPR", "RSQP", "SPQR"], "correct": "QSPR", "solution": "A widow was a widow always. She could not marry again however tender in age she might be. There were widows even in ages ranging from five to ten. However, several communities began to rebel against the ill-treatment of widows."}, {"qText": "S1: Production of coins starts with the buying of unmixed metals and their testing by the Assay Department.\nP: These ingots are reheated until the temperature is hot enough for hot rolling.\nQ: During this stage, the ingots pass through a series of rollers until they form long, thin sheets which are the thickness of a coin.\nR: From these thin strips, blank discs are punched.\nS: Then the metals are alloyed in oil - fired or electric arc furnaces, and cast into ingots 40 cm wide, 15 cm thick and 6 m long.\nS6: The blanks are heated to soften them, then rolled so that the rim is raised and are stamped with the design of the coin.\nThe Proper sequence should be:", "ans": ["PRSQ", "PSQR", "SPQR", "SQRP"], "correct": "SPQR", "solution": "Then the metals are alloyed in oil - fired or electric arc furnaces, and cast into ingots 40 cm wide, 15 cm thick and 6 m long. These ingots are reheated until the temperature is hot enough for hot rolling. During this stage, the ingots pass through a series of rollers until they form long, thin sheets which are the thickness of a coin. From these thin strips, blank discs are punched."}, {"qText": "S1: Much of our adult behaviour and our attitudes are determined by our upbringing.\nP: But the process does not stop here.\nQ: In particular by the effects of that small part of society which is our family.\nR: As we grow we are constantly and increasingly affected by new forces such as the social pressure of our friends and the larger world of society.\nS: The family and our early life have profound effect on our later life.\nS6: Psychologists have studied these forces in depth.\nThe Proper sequence should be:", "ans": ["PRSQ", "QSPR", "QPSR", "SRPQ"], "correct": "QSPR", "solution": "In particular by the effects of that small part of society which is our family. The family and our early life have profound effect on our later life. But the process does not stop here. As we grow we are constantly and increasingly affected by new forces such as the social pressure of our friends and the larger world of society."}, {"qText": "S1: He took two cigarettes from my case.\nP: But when the fit of coughing was over, he replaced it between his lips.\nQ: He lit one of them and placed it between the lips.\nR: Then with a feeble hand he removed the cigarette.\nS: Slowly he took a pull at it and coughed violently.\nS6: Then he continued to draw on it.\nThe Proper sequence should be:", "ans": ["PSQR ", "QPSR", "QSRP", "SRPQ"], "correct": "QSRP", "solution": "He lit one of them and placed it between the lips. Slowly he took a pull at it and coughed violently. Then with a feeble hand he removed the cigarette. But when the fit of coughing was over, he replaced it between his lips."}, {"qText": "S1: Progress and success are attained in slow degrees.\nP: But slow progress makes us grow impatient, disheartened and discouraged.\nQ: The general tendency is to find fault with the system.\nR: It is for this reason that people condemn and criticise the government.\nS: People expect miracles and nothing short of a magical transformation can convince them.\nS6: However, we must realise the truth that perfection is attained in slow proportions to the amount of labour put in by us.\nThe Proper sequence should be:", "ans": ["PSQR", "QPSR", "RSPQ", "SQRP"], "correct": "PSQR", "solution": "But slow progress makes us grow impatient, disheartened and discouraged. People expect miracles and nothing short of a magical transformation can convince them. The general tendency is to find fault with the system. It is for this reason that people condemn and criticise the government."}, {"qText": "S1: Plastic containers are being used more and more to package soft drinks, milk, oil, fruit juices, ketchup, etc.\nP: Most people think that this is the right thing to do, as it is economical.\nQ: Plastic containers are cheap and light.\nR: It is easier to transport materials packaged in them than in glass bottles.\nS: They also involve the least transport costs.\nS6: Yet as plastics do not decompose by bacteria or naturally in the air, they are a big threat to the environment.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "QRSP", "QSPR"], "correct": "PQSR", "solution": "Most people think that this is the right thing to do, as it is economical. Plastic containers are cheap and light. They also involve the least transport costs. It is easier to transport materials packaged in them than in glass bottles."}, {"qText": "S1: Your letter was a big relief.\nP: How did your exams go?\nQ: After your result, you must come here for a week.\nR: You hadn't written for over a month.\nS: I am sure you will come out with flying colours.\nS6: But don't forget to bring chocolate for Geeta.\nThe Proper sequence should be:", "ans": ["PSRQ", "QRPS", "RPSQ", "RSPQ"], "correct": "RPSQ", "solution": "You hadn't written for over a month. How did your exams go? I am sure you will come out with flying colours. After your result, you must come here for a week."}, {"qText": "S1: Ram Mohan Roy was a lover of his country.\nP: He said that it would be a good plan to build an English school or college.\nQ: One evening he was talking with David and a few friends on the wisest way of uplifting the mind and character of the people of India.\nR: But he thought of subjects beyond watches.\nS: David was a watchmaker.\nS6: Indians and Europeans met next year to put this idea into shape.\nThe Proper sequence should be:", "ans": ["PSQR", "QSRP", "RSPQ", "SPRQ"], "correct": "QSRP", "solution": "One evening he was talking with David and a few friends on the wisest way of uplifting the mind and character of the people of India. David was a watchmaker. But he thought of subjects beyond watches. He said that it would be a good plan to build an English school or college."}, {"qText": "S1: The role of the precious yellow metal is undergoing a dramatic change.\nP: In developing countries like India, where gold is used mainly for ornaments, a distinct change in attitude is in the offing.\nQ: Slowly, the use of gold in the form of ornaments will be on the decline and even if gold prices shoot up, women folk would not like to sell off their ornaments.\nR: The yellow metal will soon be treated as an investment instrument.\nS: The maxim, \"Larger the gold reserves, richer the country\" will not hold good for a long time.\nS6: Again, it would not be an economic proposition to buy and sell gold ornaments as an instrument of investment as buying would be costlier and selling will be at a discount.\nThe Proper sequence should be:", "ans": ["PSQR", "PSRQ", "SPQR", "SPRQ"], "correct": "SPRQ", "solution": "The maxim, \"Larger the gold reserves, richer the country\" will not hold good for a long time. In developing countries like India, where gold is used mainly for ornaments, a distinct change in attitude is in the offing. The yellow metal will soon be treated as an investment instrument. Slowly, the use of gold in the form of ornaments will be on the decline and even if gold prices shoot up, women folk would not like to sell off their ornaments."}, {"qText": "S1: The December dance and music season in Madras is like the annual tropical cyclone.\nP: A few among the new aspirants dazzle with the colour of youth, like fresh saplings.\nQ: It rains an abundance of music for over a fortnight.\nR: Thick clouds of expectation charge the atmosphere with voluminous advertisements.\nS: At the end of it one is left with the feeling that the music of only those artists seasoned by careful nurturing, stands tall like well rooted trees.\nS6: Many a hastily planted shrub gets washed away in the storm.\nThe Proper sequence should be:", "ans": ["QRPS", "QRSP", "RQPS", "RQSP"], "correct": "QRPS", "solution": "It rains an abundance of music for over a fortnight. Thick clouds of expectation charge the atmosphere with voluminous advertisements. A few among the new aspirants dazzle with the colour of youth, like fresh saplings. At the end of it one is left with the feeling that the music of only those artists seasoned by careful nurturing, stands tall like well rooted trees."}, {"qText": "S1: The coming of the computer sparked the need for remotely operated controls.\nP: It is silicon chip that is at the heart of the remote control.\nQ: This produces an infra-red beam, which is made up of electromagnetic waves.\nR: When you press the button on the remote control, the chip sets off an electronic vibration.\nS: The beam carries a coded signal such as switch on, raise volume, etc.\nS6: The code is based on binary digits.\nThe Proper sequence should be:", "ans": ["PQRS", "PQSR", "PRQS", "RPQS"], "correct": "PRQS", "solution": "It is silicon chip that is at the heart of the remote control. When you press the button on the remote control, the chip sets off an electronic vibration. This produces an infra-red beam, which is made up of electromagnetic waves. The beam carries a coded signal such as switch on, raise volume, etc."}, {"qText": "S1: Go to the library and see the clerk.\nP: When you have chosen the books you wish to take home, you take them to the clerk with the tickets.\nQ: You will probably have to sign a form promising to take care of the books.\nR: Then you are usually given two or three ticket with your name and address on them.\nS: The clerk keeps the tickets until you return the books.\nS6: He stamps the books with a date.\nThe Proper sequence should be:", "ans": ["PQRS", "QRPS", "RQSP", "SPRQ"], "correct": "QRPS", "solution": "You will probably have to sign a form promising to take care of the books. Then you are usually given two or three ticket with your name and address on them. When you have chosen the books you wish to take home, you take them to the clerk with the tickets. The clerk keeps the tickets until you return the books."}, {"qText": "S1: There were no finger prints anywhere.\nP: First of all it was impossible even for a child to enter through the hole in the roof.\nQ: When the investigators tried to reconstruct the crime, they came up against facts.\nR: Moreover, when the detectives tried to push a silver vase, it was found to be double the sizeof the hole.\nS: Again, the size of the hole was examined by the experts who said that nothing had been passed through it.\nS6: These conclusions made the detectives think that it was a fake theft.\nThe Proper sequence should be:", "ans": ["PQRS", "PSRQ", "QPRS", "SQPR"], "correct": "QPRS", "solution": "When the investigators tried to reconstruct the crime, they came up against facts. First of all it was impossible even for a child to enter through the hole in the roof. Moreover, when the detectives tried to push a silver vase, it was found to be double the sizeof the hole. Again, the size of the hole was examined by the experts who said that nothing had been passed through it."}, {"qText": "S1: In the middle of one side of the square sits the Chairman of the committee, the most important person in the room.\nP: For a committee is not just a mere collection of individuals.\nQ: On him rests much of the responsibility for the success or failure of the committee.\nR: While this is happening we have an opportunity to get the 'feel' of this committee.\nS: As the meeting opens, he runs briskly through a number of formalities.\nS6: From the moment its members meet, it begins to have a sort nebulous life of its own.\nThe Proper sequence should be:", "ans": ["PQRS", "QSRP", "RSQP", "SQPR"], "correct": "QSRP", "solution": "On him rests much of the responsibility for the success or failure of the committee. As the meeting opens, he runs briskly through a number of formalities. While this is happening we have an opportunity to get the 'feel' of this committee. For a committee is not just a mere collection of individuals."}, {"qText": "S1: Over the centuries the face of the earth has become crowded with monuments and memorials.\nP: Films, pictures and even miniature models can be made of the relics for prosperity interested in knowing about them.\nQ: Some people however would contend that antiquity should be preserved for future generations.\nR: If they were all to be preserved we will have very little space for other, more useful, things.\nS: Personally, I do not agree with their contention.\nS6: We must have more space for building new things and developing open countryside.\nThe Proper sequence should be:", "ans": ["PQRS", "QRSP", "RQSP", "SQRP"], "correct": "RQSP", "solution": "If they were all to be preserved we will have very little space for other, more useful, things. Some people however would contend that antiquity should be preserved for future generations. Personally, I do not agree with their contention. Films, pictures and even miniature models can be made of the relics for prosperity interested in knowing about them."}, {"qText": "S1: Helen Keller has an ageless quality about her in keeping with her amazing life story.\nP: Although warmed by this human reaction, she has no wish to be set aside from the rest of mankind.\nQ: She is an inspiration to both blind and the seeing everywhere.\nR: When she visited Japan after World War II, boys and girls from remote villages ran to her, crying \"Helen Keller\".\nS: Blind, deaf and mute from early childhood, she rose above her triple handicap to become one of the best known characters in the modern world.\nS6: She believes the blind should live and work with their fellows, with full responsibility.\nThe Proper sequence should be:", "ans": ["RSPQ", "RSQP", "SRQP", "SQRP"], "correct": "SQRP", "solution": "Blind, deaf and mute from early childhood, she rose above her triple handicap to become one of the best known characters in the modern world. She is an inspiration to both blind and the seeing everywhere. When she visited Japan after World War II, boys and girls from remote villages ran to her, crying \"Helen Keller\". Although warmed by this human reaction, she has no wish to be set aside from the rest of mankind."}, {"qText": "S1: This year many States have been badly affected by the drought situation prevailing in the country.\nP: No better is the situation elsewhere, where floods have ravaged the standing crop.\nQ: Though some have been less affected, even these are facing an uphill task in managing the situation.\nR: Especially pitiable is the plight of the poor farmer who cannot afford a tubewell to irrigate his land.\nS: Here the predicament is more equitable, for everybody's land is similarly submerged under ten feet of water.\nS6: Either way, it seems the lot of the Indian farmer to be at the mercy of the elements.\nThe Proper sequence should be:", "ans": ["RSPQ", "QRPS", "PSRQ", "PRQS"], "correct": "QRPS", "solution": "Though some have been less affected, even these are facing an uphill task in managing the situation. Especially pitiable is the plight of the poor farmer who cannot afford a tubewell to irrigate his land. No better is the situation elsewhere, where floods have ravaged the standing crop. Here the predicament is more equitable, for everybody's land is similarly submerged under ten feet of water."}, {"qText": "S1: There is a touching story of Professor Hardy visiting Ramanujan as he lay desperately ill in hospital at Putney.\nP: \"No Hardy, that is not a dull number in the very least.\nQ: Hardy, who was a very shy man, could not find the words for his distress.\nR: It was 1729.\nS: The best he could do, as he got to the bedside was : \"I say, Ramanujan, I thought the number of the taxi I came down in was a very dull number.\"\nS6: It is the lowest number that can be expressed in two different ways as the sum of two cubes.\"\nThe Proper sequence should be:", "ans": ["PRSQ", "QSPR", "QSRP", "SQRP"], "correct": "QSRP", "solution": "Hardy, who was a very shy man, could not find the words for his distress. The best he could do, as he got to the bedside was : \"I say, Ramanujan, I thought the number of the taxi I came down in was a very dull number.\" It was 1729. \"No Hardy, that is not a dull number in the very least."}, {"qText": "S1: I also demand adventure for myself.\nP: As a physiologist I can try experiments on myself.\nQ: Life without danger would be like life without mustard.\nR: Love of adventure does not mean love of thrills.\nS: I can also participate in wars and revolutions of which I approve.\nS6: The satisfaction of adventure is something much more solid than a thrill.\nThe Proper sequence should be:", "ans": ["PRQS", "QPSR", "RPSQ", "SQRP"], "correct": "SQRP", "solution": "I can also participate in wars and revolutions of which I approve. Life without danger would be like life without mustard. Love of adventure does not mean love of thrills. As a physiologist I can try experiments on myself."}, {"qText": "S1: A small pool in the rocks outside my cottage in the Mussoorie hills provides me endless delight.\nP: I stood very still, anxious that it should drink its fill.\nQ: And once I saw a barking deer, head lowered at the edge of the pool.\nR: Water beetles paddle the surface, while tiny fish lurk in the shallows.\nS: Sometimes a spotted fork tail bird comes to drink, hopping delicately from rock to rock.\nS6: It did and then, looking up, saw me and leapt across the ravine to disappear into the forest.\nThe Proper sequence should be:", "ans": ["PRSQ", "PSQR", "RSQP", "SQPR"], "correct": "RSQP", "solution": "Water beetles paddle the surface, while tiny fish lurk in the shallows. Sometimes a spotted fork tail bird comes to drink, hopping delicately from rock to rock. And once I saw a barking deer, head lowered at the edge of the pool. I stood very still, anxious that it should drink its fill."}, {"qText": "S1: Always remember that regular and frequent practice is essential if you are to learn to write well.\nP: Even with the most famous writers, inspiration is rare.\nQ: Writing is 99 percent hard work and one percent inspiration, so the sooner you get into the habit of writing, the better.\nR: It is no good waiting until you have an inspiration before you write.\nS: You learn to write by writing.\nS6: If you keep your eyes and ears open, you will find plenty of things to write about around you to be able to discipline yourself to write.\nThe Proper sequence should be:", "ans": ["QPSR", "RPSQ", "SPRQ", "SRPQ"], "correct": "SRPQ", "solution": "You learn to write by writing. It is no good waiting until you have an inspiration before you write. Even with the most famous writers, inspiration is rare. Writing is 99 percent hard work and one percent inspiration, so the sooner you get into the habit of writing, the better."}, {"qText": "S1: A father, having offered to take the baby out in a perambulator, was tempted by the sunny morning to slip into a pub for a glass of beer.\nP: Indignant at her husband's behaviour, she decided to teach him a lesson.\nQ: She wheeled away the pram.\nR: A little later, his wife came by, where to her horror, she discovered her sleeping baby.\nS: Leaving the pram outside, he disappeared inside the bar.\nS6: She waited for him, anticipating the white face and quivering lips which would soon appear with the news that the baby had been stolen.\nThe Proper sequence should be:", "ans": ["PQSR", "RQPS", "SPQR", "SRPQ"], "correct": "SRPQ", "solution": "Leaving the pram outside, he disappeared inside the bar. A little later, his wife came by, where to her horror, she discovered her sleeping baby. Indignant at her husband's behaviour, she decided to teach him a lesson. She wheeled away the pram."}, {"qText": "S1: In the present day it is not necessary that generals or great officers should fight with their own hands, because it is their duty to direct he movements of their followers.\nP: But in the ancient times, kings and great lords were obliged to put themselves into the very front.\nQ: Therefore, it was of great consequence that they should be strong men and dexterous in the use of their arms.\nR: The artillery and the soldiers shoot at the enemy, and men seldom mingle and fight hand to hand.\nS: They fought like ordinary men with the lance and other weapons.\nS6: Robert Bruce was so remarkably active and powerful that he came through many personal dangers.\nThe Proper sequence should be:", "ans": ["PQSR", "QRSP", "RPSQ", "SQRP"], "correct": "RPSQ", "solution": "The artillery and the soldiers shoot at the enemy, and men seldom mingle and fight hand to hand. But in the ancient times, kings and great lords were obliged to put themselves into the very front. They fought like ordinary men with the lance and other weapons. Therefore, it was of great consequence that they should be strong men and dexterous in the use of their arms."}, {"qText": "S1: And then Gandhi came.\nP: Get off the backs of these peasants and workers, he told us, all you who live by their exploitation.\nQ: He was like a powerful current of fresh air, like a beam of light, like a whirlwind that upset many things.\nR: He spoke their language and constantly drew their attention to their appalling conditions.\nS: He didn't descend from the top, he seemed to emerge from the masses of India.\nS6: Political freedom took new shape then and acquired a new content then.\nThe Proper sequence should be:", "ans": ["PRSQ", "QSRP", "RSQP", "SRQP"], "correct": "SRQP", "solution": "He didn't descend from the top, he seemed to emerge from the masses of India. He spoke their language and constantly drew their attention to their appalling conditions. He was like a powerful current of fresh air, like a beam of light, like a whirlwind that upset many things. Get off the backs of these peasants and workers, he told us, all you who live by their exploitation."}, {"qText": "S1: Love for the country is a necessity.\nP: But it should in no way exceed the limits and take the shape of jingoism.\nQ: Similarly nationalism has to be sacrificed at the altar of internationalism.\nR: There is no reason why the nations of the world cannot treat one another as belonging to one family of nations.\nS: Provincialism has to be sacrificed in the interest of the nation as a whole.\nS6: God created the globe, but man drew lines on it to demarcate countries and sow the seeds of hatred and enmity on it.\nThe Proper sequence should be:", "ans": ["PSQR", "QRSP", "RQPS", "SPRQ"], "correct": "PSQR", "solution": "But it should in no way exceed the limits and take the shape of jingoism. Provincialism has to be sacrificed in the interest of the nation as a whole. Similarly nationalism has to be sacrificed at the altar of internationalism. There is no reason why the nations of the world cannot treat one another as belonging to one family of nations."}, {"qText": "S1: There has been an alarming increase in the number of vehicles on Delhi roads.\nP: The pedestrians has, however, been the worst sufferer.\nQ: There is no place where the pedestrian can move freely without the fear of traffic.\nR: Zebra crossings like the pavements are no longer safe.\nS: This has further aggravated the problem of pollution in the city.\nS6: Should the pedestrians case be allowed to go by default?\nThe Proper sequence should be:", "ans": ["PQRS", "SPRQ", "SQRP", "SRPQ"], "correct": "SPRQ", "solution": "This has further aggravated the problem of pollution in the city. The pedestrians has, however, been the worst sufferer. Zebra crossings like the pavements are no longer safe. There is no place where the pedestrian can move freely without the fear of traffic."}, {"qText": "S1: Our own country is a little world in itself with an infinite variety and places for us to discover.\nP: I wish I had more time, so that I could visit the odd nooks and corners of India.\nQ: I have travelled a great deal in this country and I have grown in years.\nR: And yet I have not seen many parts of the country we love so much and seek to serve.\nS: I would like to go there in the company of bright children whose minds are opening out with wonder and curiosity as they make new discoveries.\nS6: I should like to go with them, not so much to the great cities of India as to the mountains and the forests and the great rivers and the old monuments, all of which tell us something of India's story.\nThe Proper sequence should be:", "ans": ["PQSR", "QRPS", "RPQS", "SPQR"], "correct": "QRPS", "solution": "I have travelled a great deal in this country and I have grown in years. And yet I have not seen many parts of the country we love so much and seek to serve. I wish I had more time, so that I could visit the odd nooks and corners of India. I would like to go there in the company of bright children whose minds are opening out with wonder and curiosity as they make new discoveries."}, {"qText": "S1: The mail is first collected from different letter boxes.\nP: From there it is sent to the head post office.\nQ: It is then sorted out at the sorting office.\nR: The mail is again sorted out at the head office by the concerned beat postman.\nS: The sorted mail is sent to the zonal post office.\nS6: Finally it is delivered to us.\nThe Proper sequence should be:", "ans": ["QPRS", "QSPR", "RPQS", "RSQP"], "correct": "QPRS", "solution": "It is then sorted out at the sorting office. From there it is sent to the head post office. The mail is again sorted out at the head office by the concerned beat postman. The sorted mail is sent to the zonal post office."}, {"qText": "S1: Mr. Ford, it is commonly reported, once declared that history was \"bunk\".\nP: Yet the American, generally speaking, is by no means ignorant of history or uninfluenced by his knowledge of it.\nQ: This remarkable utterance of his, if indeed he made it, was in itself an outcome of history.\nR: The Americans know more about our history than we know about theirs, though I hope that will soon be remedied.\nS: Such contempt for all things past, and such engaging frankness in expressing it were themselves the outcome of the social history of the United States in the 19th century.\nS6: And the American's conception of his own country as the representative of freedom and of democracy is the product of history as popularly taught and conceived over there.\nThe Proper sequence should be:", "ans": ["QSPR", "RPSQ", "SPRQ", "SQRP"], "correct": "QSPR", "solution": "This remarkable utterance of his, if indeed he made it, was in itself an outcome of history. Such contempt for all things past, and such engaging frankness in expressing it were themselves the outcome of the social history of the United States in the 19th century. Yet the American, generally speaking, is by no means ignorant of history or uninfluenced by his knowledge of it. The Americans know more about our history than we know about theirs, though I hope that will soon be remedied."}, {"qText": "S1: She used to work at the desk next to mine in the office several years ago.\nP: But it must have been exasperating that a male sitting beside her was doing the same work as she was and being paid more.\nQ: She is certain to be still there , in the same old brown suit and fur lined boots.\nR: She was as kind as she was efficient.\nS: Now she and all her friends have won their long campaign for the justice of equal pay to be recognised.\nS6: I am glad that their demands have been accepted.\nThe Proper sequence should be:", "ans": ["QRPS", "RQPS", "SPQR", "SPRQ"], "correct": "QRPS", "solution": "She is certain to be still there , in the same old brown suit and fur lined boots. She was as kind as she was efficient. But it must have been exasperating that a male sitting beside her was doing the same work as she was and being paid more. Now she and all her friends have won their long campaign for the justice of equal pay to be recognised."}, {"qText": "S1: Of the various kinds of insect defences that of the North American fungus - eating beetle is quite unusual.\nP: Both ants as well as mammals such as deer mice feed on this beetle.\nQ: This little beetle is able to recognise the kind of predator coming towards it and accordingly adopts a suitable defence.\nR: When facing a deer mouse, the beetle secretes an irritant from certain glands in its abdomen.\nS: While the beetle simply rolls itself into a compact ball in the face of an ant attack, it copes with the deer mouse differently.\nS6: The beetle's chemical secretion keeps the deer mouse at bay.\nThe Proper sequence should be:", "ans": ["PQSR", "PRQS", "QPSR", "QRPS"], "correct": "QPSR", "solution": "This little beetle is able to recognise the kind of predator coming towards it and accordingly adopts a suitable defence. Both ants as well as mammals such as deer mice feed on this beetle. While the beetle simply rolls itself into a compact ball in the face of an ant attack, it copes with the deer mouse differently. When facing a deer mouse, the beetle secretes an irritant from certain glands in its abdomen."}, {"qText": "S1: In a good many cases unnecessary timidity makes the trouble worse than it need be.\nP: I am not, of course, thinking of extreme forms of defiance.\nQ: If you show that you are afraid of them, you give promise of good hunting, whereas if you show indifference, they begin to doubt their own power and, therefore, tend to let you alone.\nR: A dog will bark more loudly and bite more easily when people are afraid of him than when they treat him with contempt, and the human herd has something of this same characteristic.\nS: Public opinion is always more tyrannical towards those who obviously fear it than towards those who feel indifferent to it.\nS6: If you hold in Delhi the views that are conventional in Delhi, you much accept the consequences.\nThe Proper sequence should be:", "ans": ["QPRS", "RSPQ", "SRPQ", "SRQP"], "correct": "RSPQ", "solution": "A dog will bark more loudly and bite more easily when people are afraid of him than when they treat him with contempt, and the human herd has something of this same characteristic. Public opinion is always more tyrannical towards those who obviously fear it than towards those who feel indifferent to it. I am not, of course, thinking of extreme forms of defiance. If you show that you are afraid of them, you give promise of good hunting, whereas if you show indifference, they begin to doubt their own power and, therefore, tend to let you alone."}, {"qText": "S1: You live either in a village or a town of India.\nP: Many villages and towns form a tehsil or a taluka.\nQ: There are also some areas in our country called Union Territories.\nR: Many tehsils or talukas form a district and many districts form a State.\nS: These, together with all the states of our country make India.\nS6: India is our motherland.\nThe Proper sequence should be:", "ans": ["PQRS", "PRQS", "QPRS", "RPQS"], "correct": "PRQS", "solution": "Many villages and towns form a tehsil or a taluka. Many tehsils or talukas form a district and many districts form a State. There are also some areas in our country called Union Territories. These, together with all the states of our country make India."}, {"qText": "S1: The tooth had abscessed and was causing considerable pain.\nP: Finally, in desperation, she went inside a wooden pyramid model and sat down praying for miracles.\nQ: Since it was Sunday morning, no dentist was available.\nR: What happened she is not sure, but after ten minutes the pain simply faded away.\nS: Common pain killers had been of no avail.\nS6: It has not returned to this day.\nThe Proper sequence should be:", "ans": ["PSRQ", "QSPR", "QRSP", "SRQP"], "correct": "QSPR", "solution": "Since it was Sunday morning, no dentist was available. Common pain killers had been of no avail. Finally, in desperation, she went inside a wooden pyramid model and sat down praying for miracles. What happened she is not sure, but after ten minutes the pain simply faded away."}, {"qText": "S1: The third five - year plan ran into rough weather from the very start.\nP: Large funds had to be diverted from development to defence.\nQ: Food situation became critical and prices began to rise steep after the Indo - Pak conflict.\nR: During this period, there was also the war with Pakistan in 1965.\nS: There was the China War in 1962 which completely upset our economy.\nS6: The government had to resort to devaluation of the rupee.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "RPQS", "SPRQ"], "correct": "PSRQ", "solution": "Large funds had to be diverted from development to defence. There was the China War in 1962 which completely upset our economy. During this period, there was also the war with Pakistan in 1965. Food situation became critical and prices began to rise steep after the Indo - Pak conflict."}, {"qText": "S1: The art of growing old is one which the passage of time has forced upon my attention.\nP: One of these is undue absorption in the past.\nQ: One's thoughts must be directed to the future and to things about which these is something to be done.\nR: Psychologically, there are two dangers to be guarded against in old age.\nS: It does not do to live in memories, in regrets for the good old days, or in sadness about friends who are dead.\nS6: this is not always easy; one's own past is a gradually increasing weight.\nThe Proper sequence should be:", "ans": ["QPRS", "RPQS", "RPSQ", "QSRP"], "correct": "RPSQ", "solution": "Psychologically, there are two dangers to be guarded against in old age. One of these is undue absorption in the past. It does not do to live in memories, in regrets for the good old days, or in sadness about friends who are dead. One's thoughts must be directed to the future and to things about which these is something to be done."}, {"qText": "S1: Religion is not a matter of mere dogmatic conformity.\nP: It is not merely going through the ritual prescribed to us.\nQ: It is not a question of ceremonial piety.\nR: Unless that kind of transformation occurs, you are not an authentically religious man.\nS: It is the remaking of your own self, the transformation of your nature.\nS6: A man of that character is free from fear, free from hatred.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "SPQR", "SPRQ"], "correct": "QPSR", "solution": "It is not a question of ceremonial piety. It is not merely going through the ritual prescribed to us. It is the remaking of your own self, the transformation of your nature. Unless that kind of transformation occurs, you are not an authentically religious man."}, {"qText": "S1: The right way to get people do things the way you want is not to compel them, drive them or for that matter even beg them or entreat them.\nP: The sure way to antagonise an individual is to give him the impression that you are out to force or compel him to do something.\nQ: The correct way is, therefore, to arouse a want in them and make them do, whatever you want them to do willingly, happily and eagerly.\nR: It is the most difficult thing in the world to make an individual do anything against his will.\nS: Even young, innocent children resent being made to do things.\nS6: The secret of motivation, therefore, lies in your ability to arouse the right kind of want or thirst in the other people.\nThe Proper sequence should be:", "ans": ["PRQS", "QSPR", "RPSQ", "SRQP"], "correct": "RPSQ", "solution": "It is the most difficult thing in the world to make an individual do anything against his will. The sure way to antagonise an individual is to give him the impression that you are out to force or compel him to do something. Even young, innocent children resent being made to do things. The correct way is, therefore, to arouse a want in them and make them do, whatever you want them to do willingly, happily and eagerly."}, {"qText": "S1: Urban problem differ from State to State and city to city.\nP: Most of the cities have neither water nor the required pipelines.\nQ: The population in these cities has grown beyond the planners imagination.\nR: However, certain basic problems are common to all cities.\nS: Only broad macro - planning done for such cities, without envisaging the future growth, and this has failed to meet the requirements.\nS6: There is no underground drainage system in most cities, and the narrow historical roads are already congested.\nThe Proper sequence should be:", "ans": ["PQSR", "QPSR", "RQPS", "RSQP"], "correct": "RSQP", "solution": "However, certain basic problems are common to all cities. Only broad macro - planning done for such cities, without envisaging the future growth, and this has failed to meet the requirements. The population in these cities has grown beyond the planners imagination. Most of the cities have neither water nor the required pipelines."}, {"qText": "S1: Exercising daily is a must for good health.\nP: Luckily, there is no link between the amount of money spent and beneficent exercise, else the poor would have creaking bodies for ever.\nQ: While some cost you nothing, others may require the investment of some amount of money.\nR: However, it is important to remember that exercises should not be overdone.\nS: It can take any form from sedentary ones like walking to vigorous work - outs like a game of squash.\nS6: The key word, always, is moderation.\nThe Proper sequence should be:", "ans": ["PQSR", "QPRS", "RSQP", "SQPR"], "correct": "PQSR", "solution": "Luckily, there is no link between the amount of money spent and beneficent exercise, else the poor would have creaking bodies for ever. While some cost you nothing, others may require the investment of some amount of money. It can take any form from sedentary ones like walking to vigorous work - outs like a game of squash. However, it is important to remember that exercises should not be overdone."}, {"qText": "S1: There is no transportation system in any city that can compare in efficiency with the circulatory system of the body.\nP: The larger one goes from the heart to the various other parts of the body.\nQ: If you imagine two systems of pipes, one large and one small, both meeting at a central pumping station, you'll have an idea of the circulatory system.\nR: These pipes are called arteries, veins and capillaries.\nS: The smaller system of pipes goes from the heart to the lungs and back.\nS6: Arteries are blood vessels in which blood is going away from the heart.\nThe Proper sequence should be:", "ans": ["PQSR", "QSPR", "RSQP", "SPRQ"], "correct": "QSPR", "solution": "If you imagine two systems of pipes, one large and one small, both meeting at a central pumping station, you'll have an idea of the circulatory system. The smaller system of pipes goes from the heart to the lungs and back. The larger one goes from the heart to the various other parts of the body. These pipes are called arteries, veins and capillaries."}, {"qText": "S1: It is regrettable that there is widespread corruption in the country at all levels.\nP: So there is hardly anything that the government can do about it.\nQ: And there are graft and other malpractices too.\nR: The impression that corruption is a universal phenomenon persists and the people do not cooperate in checking this evil.\nS: Recently several offenders were brought to book, but they were not given deterrent punishment.\nS6: This is indeed a tragedy of great magnitude.\nThe Proper sequence should be:", "ans": ["PQSR", "QSRP", "RSQP", "SQRP"], "correct": "QSRP", "solution": "And there are graft and other malpractices too. Recently several offenders were brought to book, but they were not given deterrent punishment. The impression that corruption is a universal phenomenon persists and the people do not cooperate in checking this evil. So there is hardly anything that the government can do about it."}, {"qText": "S1: The press enables us to know about the world and happenings around us.\nP: It governs the current ideas in the country and controls the course of events.\nQ: There is no doubt that the newspaper is the only teacher of the common man.\nR: It is indeed the mouthpiece of the people.\nS: It is feared that in the absence of the press, government would be less responsible, the judge less honest and civil servant lees efficient.\nS6: While moulding it mends and mending it moulds the public opinion.\nThe Proper sequence should be:", "ans": ["PQRS", "QPSR", "RSQP", "SRPQ"], "correct": "PQRS", "solution": "It governs the current ideas in the country and controls the course of events. There is no doubt that the newspaper is the only teacher of the common man. It is indeed the mouthpiece of the people. It is feared that in the absence of the press, government would be less responsible, the judge less honest and civil servant lees efficient."}, {"qText": "S1: Of the scholars who compose a university, some may be expected to devote an unbroken leisure to learning, their fellows having the advantage of their knowledge from their conversation, and the world perhaps from their writings.\nP: Others, however, will engage themselves to teach as well as to learn.\nQ: Those who come to be taught at a university have to provide evidence that they are not merely beginners and not only do they have displayed before them the learning of their teachers, but they are offered a curriculum of study, to be followed by a test and the award of a degree.\nR: But here again, it is the special manner of the pedagogic enterprise which distinguishes a university.\nS: A place of learning without this could scarcely be called university.\nS6: There classes of persons, then, go to compose a university as we know it - the scholar, the scholar who is also a teacher, and those who come to be taught, the undergraduate.\nThe Proper sequence should be:", "ans": ["QPSR", "RQSP", "SPRQ", "SRPQ"], "correct": "QPSR", "solution": "Those who come to be taught at a university have to provide evidence that they are not merely beginners and not only do they have displayed before them the learning of their teachers, but they are offered a curriculum of study, to be followed by a test and the award of a degree. Others, however, will engage themselves to teach as well as to learn. A place of learning without this could scarcely be called university. But here again, it is the special manner of the pedagogic enterprise which distinguishes a university."}, {"qText": "S1: Several sub-cities have been planned around the capital.\nP: Dwarka is the first among them.\nQ: They are expected to alleviate the problem of housing.\nR: It is coming up in the south-west of the capital.\nS: It will cater to one million people when completed.\nS6: Hopefully the housing problem will not be as cute as at present after these sub-cities are built.\nThe Proper sequence should be:", "ans": ["PQRS", "PRSQ", "QPRS", "QRSP"], "correct": "QPRS", "solution": "They are expected to alleviate the problem of housing. Dwarka is the first among them. It is coming up in the south-west of the capital. It will cater to one million people when completed."}, {"qText": "S1: India's non-alignment has not been an attitude of negative neutrality.\nP: In other words, it is not an aloofness from or indifference to other nations.\nQ: Instead, it has been an attitude of constructive neutrality.\nR: On the contrary, India has been taking a keen interest in all international developments.\nS: India wants the goodwill of all nations and is hostile towards none.\nS6: This policy has been accepted, if not actually appreciated by the leading powers of the world.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPRS", "QRPS", "SQRP"], "correct": "QPRS", "solution": "Instead, it has been an attitude of constructive neutrality. In other words, it is not an aloofness from or indifference to other nations. On the contrary, India has been taking a keen interest in all international developments. India wants the goodwill of all nations and is hostile towards none."}, {"qText": "S1: We speak today of self-determination in politics.\nP: So long as one is conscious of a restraint, it is possible to resist it or to bear it as a necessary evil and to keep free in spirit.\nQ: Slavery begins when one ceases to feel the restraint and it depends on if the evil is accepted as good.\nR: There is, however, a subtler domination exercised in the sphere of ideas by one culture on another.\nS: Political subjection primarily means restraint ion the outer life of people.\nS6: Cultural subjection is ordinarily of an unconscious character and it implies slavery from the very start.\nThe Proper sequence should be:", "ans": ["RSPQ", "RSQP", "SPQR", "SPRQ"], "correct": "SPQR", "solution": "Political subjection primarily means restraint ion the outer life of people. So long as one is conscious of a restraint, it is possible to resist it or to bear it as a necessary evil and to keep free in spirit. Slavery begins when one ceases to feel the restraint and it depends on if the evil is accepted as good. There is, however, a subtler domination exercised in the sphere of ideas by one culture on another."}, {"qText": "S1: Music, like literature, is an art that deals with sound.\nP: Literature makes use of words which are sounds.\nQ: They also have meanings.\nR: And the writer must be concerned with the effect produced by the sounds he uses.\nS: But words are not only sounds.\nS6: They refer to specific things other than themselves such as objects an ideas.\nThe Proper sequence should be:", "ans": ["PRSQ", "PSQR", "RPSQ", "SRPQ"], "correct": "PRSQ", "solution": "Literature makes use of words which are sounds. And the writer must be concerned with the effect produced by the sounds he uses. But words are not only sounds. They also have meanings."}, {"qText": "S1: Why then, do sharks attack?\nP: \"The only way a shark can warn you is with its mouth and teeth,\" says Baldridge.\nQ: In murky water it may simply be a case of mistaken identity.\nR: Snork bumps and open - mouthed slashings are ways of trying to frighten you off.\nS: But the most persuasive explanation is that they perceive their victim as a threat.\nS6: Attacks of this kind may be generated by a swimmer who unwittingly interrupts a courting procedure, trespasses in a shark's territory and cuts off its escape route.\nThe Proper sequence should be:", "ans": ["PRQS", "PRSQ", "QPRS", "QSPR"], "correct": "QPRS", "solution": "In murky water it may simply be a case of mistaken identity. \"The only way a shark can warn you is with its mouth and teeth,\" says Baldridge. Snork bumps and open - mouthed slashings are ways of trying to frighten you off. But the most persuasive explanation is that they perceive their victim as a threat."}, {"qText": "S1: The essence of democracy is the active participation of the people in government affair.\nP: When the people are active watchmen and participants, we have that fertile soil in which democracy flourishes.\nQ: This democracy of ours is founded upon a faith in the overall judgement of the people as a whole.\nR: When the people do not participate, the spirit of democratic action dies.\nS: When the people are honestly and clearly informed, their common sense can be relied upon to carry the nation safely through any crisis.\nS6: By and large it is the actual practice of our way of life.\nThe Proper sequence should be:", "ans": ["PRSQ", "PSRQ", "RPSQ", "SPQR"], "correct": "RPSQ", "solution": "When the people do not participate, the spirit of democratic action dies. When the people are active watchmen and participants, we have that fertile soil in which democracy flourishes. When the people are honestly and clearly informed, their common sense can be relied upon to carry the nation safely through any crisis. This democracy of ours is founded upon a faith in the overall judgement of the people as a whole."}, {"qText": "S1: We don't know whether the machines are the masters or we are.\nP: They must be given or rather 'fed' with coal and given petrol to drink from time to time.\nQ: Already man spends most of his time looking after and waiting upon them.\nR: Yet he has grown so dependent on them that they have almost become the masters now.\nS: It is very true that they were made for the sole purpose of being man's servants.\nS6: And if they don't get their meals when they expect them, they will just refuse to work.\nThe Proper sequence should be:", "ans": ["RSPQ", "RSQP", "SPQR", "SRQP"], "correct": "SRQP", "solution": "It is very true that they were made for the sole purpose of being man's servants. Yet he has grown so dependent on them that they have almost become the masters now. Already man spends most of his time looking after and waiting upon them. They must be given or rather 'fed' with coal and given petrol to drink from time to time."}, {"qText": "S1: Instantly the full load yanked Gordy towards the side of the bridge.\nP: But the pull of the cable was too much.\nQ: He could hardly feel the cable, slipping through his fingers, ripping off his gloves, and streaking over the railing like an escaping snake.\nR: It smashed his hands hard against the top of the railing, causing a split - second feeling of fierce pain followed by numbness.\nS: He held on to the cable; it had been hard work lifting it, and he did not want to have to start over again.\nS6: Feeling a sharp burning sensation where the cable was speeding between his things, Gordy rose on tiptoe and as he did, the slithering coil of cable tightened around his left foot and yanked him over the railing.\nThe Proper sequence should be:", "ans": ["PRQS", "QSRP", "RPQS", "SPRQ"], "correct": "RPQS", "solution": "It smashed his hands hard against the top of the railing, causing a split - second feeling of fierce pain followed by numbness. But the pull of the cable was too much. He could hardly feel the cable, slipping through his fingers, ripping off his gloves, and streaking over the railing like an escaping snake. He held on to the cable; it had been hard work lifting it, and he did not want to have to start over again."}, {"qText": "S1: Even the newsmen and spectators were not spared.\nP: A home guard in the gallery was hit on the face.\nQ: They went only inches over the heads of newsmen in the press gallery.\nR: Three bludgeons which are hurled missed their mark.\nS: This made the scribes run helter skelter.\nS6: He fell down,his bleeding eye bulging.\nThe Proper sequence should be:", "ans": ["PSRQ", "QRPS", "RQSP", "SRQP"], "correct": "SRQP", "solution": "This made the scribes run helter skelter. Three bludgeons which are hurled missed their mark. They went only inches over the heads of newsmen in the press gallery. A home guard in the gallery was hit on the face."}, {"qText": "S1: Politeness is not a quality possessed by only one nation or race.\nP: One may observe that a man of one nation will remove his hat or fold his hands by way of greetings when he meets someone he knows.\nQ: A man of another country will not do so.\nR: It is a quality to be found among all peoples and nations in every corner of the earth.\nS: Obviously, each person follows the custom of his particular country.\nS6: In any case, we should not mock at other's habits.\nThe Proper sequence should be:", "ans": ["PRQS", "QPRS", "RPQS", "RPSQ"], "correct": "RPSQ", "solution": "It is a quality to be found among all peoples and nations in every corner of the earth. One may observe that a man of one nation will remove his hat or fold his hands by way of greetings when he meets someone he knows. Obviously, each person follows the custom of his particular country. A man of another country will not do so."}, {"qText": "S1: You might say that all through history there have been wars and that mankind has survive inspite of them.\nP: Now, if his purposes are those of destruction, each fresh advance in his mastery of nature only increases the danger from war, as men learn to destroy one another in ever great numbers, from ever great distances, and in ever more varied and ingenious ways.\nQ: He has learned to tap the hidden forces of our planet and use them for his purpose.\nR: It has even developed and become civilised inspite of them.\nS: This is true, but unfortunately as part of his development man has enormously increased his power over nature.\nS6: Man has now discovered how to release the colossal forces locked up in the atom.\nThe Proper sequence should be:", "ans": ["PQSR", "PRQS", "QPRS", "RSQP"], "correct": "RSQP", "solution": "It has even developed and become civilised inspite of them. This is true, but unfortunately as part of his development man has enormously increased his power over nature. He has learned to tap the hidden forces of our planet and use them for his purpose. Now, if his purposes are those of destruction, each fresh advance in his mastery of nature only increases the danger from war, as men learn to destroy one another in ever great numbers, from ever great distances, and in ever more varied and ingenious ways."}, {"qText": "S1: Films developed from the silent stage to the talkie stage with a tremendous mass appeal.\nP: Film makers of those days used film media to portray our struggle for freedom.\nQ: The thirties and forties were decades of tremendous social, political and cultural upheavals.\nR: That is what 'Alam Ara' did to the delirious delight of the audience and thus triggered off a revolution.\nS: In the turbulent thirties, the silent Indian films began to talk, sing and dance.\nS6: Extolling the virtues of bravery and making patriotic films was the order of the day.\nThe Proper sequence should be:", "ans": ["PSQR", "QSRP", "SRQP", "RPSQ"], "correct": "SRQP", "solution": "In the turbulent thirties, the silent Indian films began to talk, sing and dance. That is what 'Alam Ara' did to the delirious delight of the audience and thus triggered off a revolution. The thirties and forties were decades of tremendous social, political and cultural upheavals. Film makers of those days used film media to portray our struggle for freedom."}, {"qText": "S1: Life is hazardous.\nP: And prey have evolved adaptations that reduce the risk of being eaten.\nQ: Many animals are killed and eaten by other animals.\nR: And many predators die from starvation because they fail to secure prey.\nS: Predators have continued to evolve adaptations that enable them to locate and kill prey.\nS6: Everything points to a special kind of arms race with elaborate strategies and counter-strategies for attack and defence.\nThe Proper sequence should be:", "ans": ["QPRS", "QRPS", "QRSP", "SQRP"], "correct": "QRSP", "solution": "Many animals are killed and eaten by other animals. And many predators die from starvation because they fail to secure prey. Predators have continued to evolve adaptations that enable them to locate and kill prey. And prey have evolved adaptations that reduce the risk of being eaten."}, {"qText": "S1: Of course, it is silly to try to overcome fears that keep us from destroying ourselves.\nP: This is sensible.\nQ: You wait until it is out of the way before crossing.\nR: You need some fears to keep you from doing foolish things.\nS: You are afraid of an automobile coming rapidly down the street you wish to cross.\nS6: The only fears you need to avoid are silly fears which prevent you from doing what you should do.\nThe Proper sequence should be:", "ans": ["PQRS", "PRSQ", "RPSQ", "RSQP"], "correct": "RPSQ", "solution": "You need some fears to keep you from doing foolish things. This is sensible. You are afraid of an automobile coming rapidly down the street you wish to cross. You wait until it is out of the way before crossing."}, {"qText": "S1: Most people know that economics deals with such items as population, natural resources, incomes, tariffs, money and prices.\nP: Instead, it is how it organises and analyses its materials; it is the perspective from which it views the world that makes it a special field of study.\nQ: However, it is not what economics deals with that makes it a distinctive science.\nR: Indeed, the list of topics can be greatly extended.\nS: Economics is a particular view of reality.\nS6: From this view, human behaviour is seen as activity directed towards the achievement of various objectives through the use of various resources.\nThe Proper sequence should be:", "ans": ["PQSR", "QPSR", "RQPS", "RSPQ"], "correct": "RQPS", "solution": "Indeed, the list of topics can be greatly extended. However, it is not what economics deals with that makes it a distinctive science. Instead, it is how it organises and analyses its materials; it is the perspective from which it views the world that makes it a special field of study. Economics is a particular view of reality."}, {"qText": "S1: When you meet someone and discover areas of common interest and experience, you gain building blocks to develop a deeper relationship.\nP: This gives you and your partner an opportunity to decide if you would like to get to know one another better.\nQ: Remember, much of the point of conversation is to discuss different topics and experience in order to find a common bond.\nR: So, when you discover a connection, tell your partner right away.\nS: If you have enough in common, then hopefully you will want to see each other again to share common interests.\nS6: This creates a sense of familiarity and indicates your interest in discussing the topic further and sharing your ideas.\nThe Proper sequence should be:", "ans": ["RPQS", "PQRS", "QPSR", "SRQP"], "correct": "QPSR", "solution": "Remember, much of the point of conversation is to discuss different topics and experience in order to find a common bond. This gives you and your partner an opportunity to decide if you would like to get to know one another better. If you have enough in common, then hopefully you will want to see each other again to share common interests. So, when you discover a connection, tell your partner right away."}, {"qText": "S1: Egypt is located in north-east of Africa.\nP: The land should be productive.\nQ: It is on the coast of Mediterranean Sea.\nR: The important thing is not just the area.\nS: Its area is almost four times that of England.\nS6: Egypt is mostly desert or semi-desert.\nThe Proper sequence should be:", "ans": ["PQSR", "QSRP", "RPQS", "SRPQ"], "correct": "QSRP", "solution": "It is on the coast of Mediterranean Sea. Its area is almost four times that of England. The important thing is not just the area. The land should be productive."}, {"qText": "S1: The mother tongue is the true vehicle of mother wit.\nP: Another medium of speech may bring with it a current of new ideas.\nQ: It is through the vernacular (refined, though not weakened,by scholarship and taste) that the new conceptions of the mind should press their way to birth in speech.\nR: But the mother tongue is one with the air in which a man is born.\nS: This is almost universally true, except in cases so rare (like that of Joseph Conrad) as to emphasise the general rule.\nS6: A man's native speech is almost like his shadow, inseparable from his personality.\nThe Proper sequence should be:", "ans": ["PRQS", "PRSQ", "PSQR", "QRPS"], "correct": "PRQS", "solution": "Another medium of speech may bring with it a current of new ideas. But the mother tongue is one with the air in which a man is born. It is through the vernacular (refined, though not weakened,by scholarship and taste) that the new conceptions of the mind should press their way to birth in speech. This is almost universally true, except in cases so rare (like that of Joseph Conrad) as to emphasise the general rule."}, {"qText": "S1: We may consider the political privileges of citizenship.\nP: This gives the citizen the pleasant feeling that he has a share in the administration of his country.\nQ: In addition, he may himself stand as a candidate for election to any office of the republic to which he belongs.\nR: A citizen usually enjoys the right of voting of election to public bodies, and of holding public offices.\nS: These advantages are of course only enjoyed by citizens under a democratic system of government.\nS6: Under a dictatorship, people cannot choose their own representatives to run the government and the rights of voting and contesting are denied to them.\nThe Proper sequence should be:", "ans": ["PQRS", "QSPR", "RPQS", "SRQP"], "correct": "RPQS", "solution": "A citizen usually enjoys the right of voting of election to public bodies, and of holding public offices. This gives the citizen the pleasant feeling that he has a share in the administration of his country. In addition, he may himself stand as a candidate for election to any office of the republic to which he belongs. These advantages are of course only enjoyed by citizens under a democratic system of government."}, {"qText": "S1: The study of speech disorders due to brain injury suggests that patients can think without having adequate control over their language.\nP: But they succeed in playing games of chess.\nQ: Some patients, for example, fail to find the names of objects presented to them.\nR: They can even use the concepts needed for chess playing, though they are unable to express many of the concepts in ordinary language.\nS: They even find it difficult to interpret long written notices.\nS6: How they manage to do this we do not know.\nThe Proper sequence should be:", "ans": ["PSQR", "QSPR", "RPSQ", "SRPQ"], "correct": "QSPR", "solution": "Some patients, for example, fail to find the names of objects presented to them. They even find it difficult to interpret long written notices. But they succeed in playing games of chess. They can even use the concepts needed for chess playing, though they are unable to express many of the concepts in ordinary language."}, {"qText": "S1: Let me elaborate a little on what I mean by a properly channeled scientific approach.\nP: There are planners deciding the strategy.\nQ: In a major war, there are several different operations involved.\nR: There are complex issues involving communications between different nerve centres.\nS: There are factories producing the required armaments.\nS6: And of course, there are soldiers, commandos, to say nothing of intelligence men, besides many others who do their bit to make a successful attack.\nThe Proper sequence should be:", "ans": ["PSRQ", "QPSR", "RSPQ", "SRQP"], "correct": "QPSR", "solution": "In a major war, there are several different operations involved. There are planners deciding the strategy. There are factories producing the required armaments. There are complex issues involving communications between different nerve centres."}]