[{"qText": "Kiran asked me, \"Did you see the Cricket match on television last night?\"\n", "ans": ["Kiran asked me whether I saw the Cricket match on television the earlier night.", "Kiran asked me whether I had seen the Cricket match on television the earlier night.", "Kiran asked me did I see the Cricket match on television the last night.", "Kiran asked me whether I had seen the Cricket match on television the last night."], "correct": "Kiran asked me whether I had seen the Cricket match on television the earlier night.", "solution": "Kiran asked me whether I had seen the Cricket match on television the earlier night."}, {"qText": "David said to Anna, \"Mona will leave for her native place tomorrow.\"\n", "ans": ["David told Anna that Mona will leave for her native place tomorrow.", "David told Anna that Mona left for her native place the next day.", "David told Anna that Mona would be leaving for her native place tomorrow.", "David told Anna that Mona would leave for her native place the next day."], "correct": "David told Anna that Mona would leave for her native place the next day.", "solution": "David told Anna that Mona would leave for her native place the next day."}, {"qText": "I said to him, \"Why are you working so hard?\"\n", "ans": ["I asked him why he was working so hard.", "I asked him why was he working so hard.", "I asked him why had he been working so hard.", "I asked him why he had been working so hard."], "correct": "I asked him why he was working so hard.", "solution": "I asked him why he was working so hard."}, {"qText": "He said to her, \"What a cold day!\"\n", "ans": ["He told her that it was a cold day.", "He exclaimed that it was a cold day.", "He exclaimed sorrowfully that it was a cold day.", "He exclaimed that it was a very cold day."], "correct": "He exclaimed that it was a very cold day.", "solution": "The given direct speech is: \"What a cold day!\"\nTo convert this into indirect speech, we need to consider the reporting verb, which is \"He said to her.\"\nIn indirect speech, the reporting verb \"said\" changes to \"told,\" and the exclamation changes to \"exclaimed.\"\nAlso, the pronoun \"her\" changes to \"her.\"\nNow, we need to change the tense of the reported speech according to the rules of indirect speech. The exclamation \"What a cold day!\" does not have a direct equivalent in reported speech. So, we need to express the same idea using an exclamation or a suitable expression of emotion.\nAmong the options given, option D \"He exclaimed that it was a very cold day.\" fits the best, as it uses the reporting verb \"exclaimed\" and adds the intensity of \"very\" to convey the idea of the speaker's surprise or emotion about the cold day.\nHence, the correct answer is Option D."}, {"qText": "The tailor said to him, \"Will you have the suit ready by tomorrow evening?\"\n", "ans": ["The tailor asked him that he will have the suit ready by the next evening.", "The tailor asked him that he would had the suit ready by the next evening.", "The tailor asked him if he would have the suit ready by the next evening.", "The tailor asked him if he will like to the suit ready by the next evening."], "correct": "The tailor asked him if he would have the suit ready by the next evening.", "solution": "The tailor asked him if he would have the suit ready by the next evening."}, {"qText": "He said to interviewer, \"Could you please repeat the question?\"\n", "ans": ["He requested the interviewer if he could please repeat the question.", "He requested the interviewer to please repeat the question.", "He requested the interviewer to repeat the question.", "He requested the interviewer if he could repeat the question. "], "correct": "He requested the interviewer to repeat the question.", "solution": "In direct and indirect speech, when we report someone's request, we often use the verb \"requested\" followed by an indirect request. The structure of indirect speech for requests is typically: \"requested + [indirect request].\"\n\nIn this case, the original sentence is a polite request: \"Could you please repeat the question?\"\n\nThe correct indirect speech transformation is: \"He requested the interviewer to repeat the question.\"\n\nTherefore, the correct answer is Option C: He requested the interviewer to repeat the question. This option accurately conveys the original request in indirect speech without unnecessary additions or alterations."}, {"qText": "He said. \"Be quite and listen to my words.\n", "ans": ["He urged them to be quite and listen to his words.", "He urged them and said be quite and listen to his words.", "He urged they should be quite and listen to his words.", "He said you should be quite and listen to his words."], "correct": "He urged them to be quite and listen to his words.", "solution": "He urged them to be quite and listen to his words."}, {"qText": "He said to me, I have often told you not to play with fire.\n", "ans": ["He said that he has often been telling me not to play with fire.", "He told me that he had often told me not to play with fire.", "He reminded me that he often said to me not to play with fire.", "He said to me that he often told me not to play with fire."], "correct": "He told me that he had often told me not to play with fire.", "solution": "He told me that he had often told me not to play with fire."}, {"qText": "The Captain said to his men, \"Stand at ease.\"\n", "ans": ["The Captain urged his men to stand at ease.", "The Captain wanted his men to stand at ease.", "The Captain told his men that they should stand at ease.", "The Captain commanded his men to stand at ease."], "correct": "The Captain commanded his men to stand at ease.", "solution": "The Captain commanded his men to stand at ease."}, {"qText": "Pawan said to me, \"If I hear any news, I'll phone you.\"\n", "ans": ["Pawan told me that if he heard any news, he will phone me.", "Pawan told me that if he will hear my news, he will phone me.", "Pawan told me that if he had heard any news, he would phone me.", "Pawan told me that if he heard any news, he would phone me."], "correct": "Pawan told me that if he heard any news, he would phone me.", "solution": "Pawan told me that if he heard any news, he would phone me."}, {"qText": "He said,\"I cannot help you at present because I am myself in difficulty.\"\n", "ans": ["He said that I cannot help you at present because I myself in difficulty.", "He said that he could not help me at present because he was himself in difficulty.", "He told that he could not help you at present because he was himself in difficulty.", "He asked that he could not help you at present because he was himself in difficulty."], "correct": "He said that he could not help me at present because he was himself in difficulty.", "solution": "He said that he could not help me at present because he was himself in difficulty."}, {"qText": "He told her, \"I want to meet your father\":\n", "ans": ["He told her that I want to meet your father.", "He told her that he wanted to meet her father.", "He told her that he wanted to meet your father.", "He told her that she wanted to meet her father."], "correct": "He told her that he wanted to meet her father.", "solution": "He told her that he wanted to meet her father."}, {"qText": "He says, ''I don't want to play any more.\"\n", "ans": [" He says that he doesn't want to play any more.", "He says that I don't want to play any more.", "He says that I didn't want to play any more.", "He says that he didn't want to play any more."], "correct": " He says that he doesn't want to play any more.", "solution": "He says that he doesn't want to play any more."}, {"qText": "The government has announced, \"Taxes will be raised\":\n", "ans": ["The government has announced that taxes would be raised.", "The government has announced that taxes would raised.", "The government has announced that taxes will be raised.", "The government has announced taxes will be raised."], "correct": "The government has announced that taxes would be raised.", "solution": "In changing the given sentence from direct speech to indirect speech, we need to follow the rules of reported speech. Here, the reporting verb is \"has announced,\" and we need to adjust the sentence accordingly:\nThe original sentence is in direct speech: \"The government has announced, 'Taxes will be raised.'\"\nIn indirect speech, the reporting verb \"has announced\" remains the same, and the sentence is converted to report the statement made by the government. When reporting statements about future events, we generally change the tense of the reported speech verb from \"will\" to \"would\" to make it indirect. So, \"will be raised\" becomes \"would be raised\":\nSo, the correct transformation is: Option A: The government has announced that taxes would be raised."}, {"qText": "Mohan said, \"We shall go to see the Taj in the moonlit night\":\n", "ans": ["Mohan said that we shall go to see the Taj in the moonlit night.", " Mohan told that we shall go to see the Taj in moonlit night.", "Mohan told that we should go to see the Taj in the moonlit night.", "Mohan said that they should go to see the Taj in moonlit night."], "correct": "Mohan said that they should go to see the Taj in moonlit night.", "solution": "Mohan said that they should go to see the Taj in moonlit night."}, {"qText": "The teacher said to Ram,\"Congratulations ! Wish you success in life.\"\n", "ans": ["The teacher congratulated Ram and said wish you success in life.", "The teacher wished congratulations and success in life to Ram.", "The teacher wished congratulations to Ram and wished him success in life.", "The teacher congratulated Ram and wished him success in life."], "correct": "The teacher congratulated Ram and wished him success in life.", "solution": "The teacher congratulated Ram and wished him success in life."}, {"qText": "The poor examine said,\"O God, take pity on me.\"\n", "ans": ["The poor examine prayed to God to take pity on him.", "The poor examine, involving God, implored him to take pity on him.", "The poor examine exclaimed that God take pity on him.", "The poor examine asked God to take pity on him."], "correct": "The poor examine prayed to God to take pity on him.", "solution": "The poor examine prayed to God to take pity on him."}, {"qText": "\"Where will you be tomorrow,\" I said, \"in case I have to ring you ?\"\n", "ans": ["I asked where you will be the next day in case I will ring him.", "I asked where he would be the next day in case I had to ring him.", "I said to him where he will be in case I have to ring him.", "I enquired about his where about the next day in case I would have to ring up."], "correct": "I asked where he would be the next day in case I had to ring him.", "solution": "I asked where he would be the next day in case I had to ring him."}, {"qText": "Seeta said to me, \" Can you give me your pen ?\"\n", "ans": ["Seeta asked me can I give her my pen.", "Seeta asked me if I can give me your pen.", "Seeta asked me if I could give her my pen.", "Seeta asked me if i could give her my pen."], "correct": "Seeta asked me if I could give her my pen.", "solution": "Seeta asked me if I could give her my pen."}, {"qText": "The father warned his son that he should be beware of him.\n", "ans": ["The father warned his son, \"beware of him !\"", "The father warned his son, \"Watch that chap !\"", "The father warned his son, \"Be careful about him.\"", "The father warned his son, \"Don't fall into the trap.\""], "correct": "The father warned his son, \"beware of him !\"", "solution": "The father warned his son, \"beware of him !\""}, {"qText": "Manna asked Rohan, \"Have you sat in a trolley bus before ?\"\n", "ans": ["Manna asked Rohan had he sat in a trolley bus earlier.", "Manna asked Rohan had he sat in a trolley bus before.", "Manna asked Rohan if he sat on a trolley bus before.", "Manna asked Rohan if he has ever sat in a trolley bus."], "correct": "Manna asked Rohan had he sat in a trolley bus earlier.", "solution": "Manna asked Rohan had he sat in a trolley bus earlier."}, {"qText": " Farhan asked Geeta, \"Could you lend me a hundred rupees until tomorrow ?\"\n", "ans": ["Farhan asked Geeta whether she could lend him a hundred rupees until tomorrow.", "Farhan asked Geeta whether she could lend him a hundred rupees until the next day.", "Farhan asked Geeta whether she could lend me a hundred rupees untill the next day.", "Farhan asked whether Geeta could lend me a hundred rupees until the next day. "], "correct": "Farhan asked Geeta whether she could lend him a hundred rupees until the next day.", "solution": "Farhan asked Geeta whether she could lend him a hundred rupees until the next day."}, {"qText": "\"What about going for swim,\" he said, \"It's quite fine now.\"\n", "ans": ["He asked me what about going for a swim as it was quite fine then.", "He proposed going for swim as it was quite fine.", "He suggested going for a swim as it was quite fine.", "He advised me to go for a swim as it was quite fine."], "correct": "He asked me what about going for a swim as it was quite fine then.", "solution": "He asked me what about going for a swim as it was quite fine then."}, {"qText": "\"You can't bathe in this sea,\" he said to me, \"it's very rough.\"\n", "ans": ["He said that I can't bathe in this sea because it's very rough.", "He said that you couldn't bathe in the sea if it was very rough.", "He said that I couldn't bathe in that sea as it was very rough.", "He said that you can't bathe in this sea since it was very rough."], "correct": "He said that I couldn't bathe in that sea as it was very rough.", "solution": "He said that I couldn't bathe in that sea as it was very rough."}, {"qText": "Vissu said, \"We passed by a beautiful lake when we went on a trip to Goa.\"\n", "ans": ["Vissu said that they passed by a beautiful lake when they had gone on a trip to Goa.", "Vissu said that they has passed by a beautiful lake when they went on a trip to Goa.", "Vissu said that they had passed by a beautiful lake when they had gone on a trip to Goa.", "Vissu said they passed by a beautiful lake when they went on a trip to Goa."], "correct": "Vissu said that they had passed by a beautiful lake when they had gone on a trip to Goa.", "solution": "Vissu said that they had passed by a beautiful lake when they had gone on a trip to Goa."}, {"qText": "He said to me, \"I expect you to attend the function.\"\n", "ans": ["He told me that he expects me to attend the function.", "He told me that he expected me to attended the function.", "He told me that he expected me to have attended the function.", "He told me that he expected me to attend the function."], "correct": "He told me that he expected me to attend the function.", "solution": "When converting direct speech to indirect speech, we need to make certain changes. The reporting verb \"said\" changes to \"told,\" and the pronouns and tenses also change accordingly. In this case, \"I\" changes to \"me,\" \"expect\" changes to \"expected,\" and \"attend\" remains the same as it is in the infinitive form. The correct option is D."}, {"qText": "He said, \"Why didn't you send your application to me ?\"\n", "ans": ["He enquired why I had not sent my application to him.", "He enquired why I did not send my application to him.", "He enquired why had I not sent my application to him.", "He enquired why did I not send my application to him."], "correct": "He enquired why I had not sent my application to him.", "solution": "He enquired why I had not sent my application to him."}, {"qText": "Dinesh asked, \"Are you going to the party tomorrow, Rani ?\"\n", "ans": ["Dinesh asked whether Rani was going to the party the next day.", "Dinesh asked Rani whether you are going to the party the next day.", "Dinesh asked Rani whether she was going to the party the next day.", "Dinesh asked Rani are you going to the party tomorrow."], "correct": "Dinesh asked Rani whether she was going to the party the next day.", "solution": "Dinesh asked Rani whether she was going to the party the next day."}, {"qText": "Suresh asked, \" How long will it take to travel from Germany to South Africa ?\"\n", "ans": ["Suresh asked how long it will take to travel from Germany to South Africa.", "Suresh asked how long would it take to travel from Germany to South Africa.", "Suresh asked how long it would take to travel from Germany to South Africa.", "Suresh was asking how long must it take to travel from Germany to South Africa."], "correct": "Suresh asked how long it would take to travel from Germany to South Africa.", "solution": "Suresh asked how long it would take to travel from Germany to South Africa."}, {"qText": "\"What did you see at the South Pole ?\" Ashok asked Anil.\n", "ans": ["Ashok asked Anil if he saw anything at the South Pole.", "Ashok asked Anil What he had seen at the South Pole.", "Ashok asked Anil What did he see at the South Pole.", "Ashok asked Anil that he saw anything at the South Pole."], "correct": "Ashok asked Anil What he had seen at the South Pole.", "solution": "Ashok asked Anil what he had seen at the South Pole."}, {"qText": "My father said to us, \"We should study and get a good division in the examination.\"\n", "ans": ["My father said us that we should study and got a good division in the examination.", "My father told us that we should studied and got a good division in the examination.", "My father told us that we should study and get a good division in the examination.", "My father told to us that we should study and get a good division in the examination."], "correct": "My father told us that we should study and get a good division in the examination.", "solution": "My father told us that we should study and get a good division in the examination."}, {"qText": "\"If you don't keep quiet I shall shoot you\", he said to her in a calm voice.", "ans": ["He warned her to shoot if she didn't keep quiet calmly.", "He said calmly that I shall shoot you if you don't be quiet.", "He warned her calmly that he would shoot her if she didn't keep quiet.", "Calmly he warned her that be quiet or else he will have to shoot her."], "correct": "He warned her calmly that he would shoot her if she didn't keep quiet.", "solution": "He warned her calmly that he would shoot her if she didn't keep quiet."}, {"qText": "I told him that he was not working hard.", "ans": ["I said to him, \"You are not working hard.\"", "I told to him, \"You are not working hard.\"", "I said, \"You are not working hard.\"", "I said to him, \"He is not working hard.\""], "correct": "I said to him, \"You are not working hard.\"", "solution": "I said to him, \"You are not working hard.\""}, {"qText": "His father ordered him to go to his room and study.", "ans": ["His father said, \"Go to your room and study.\"", "His father said to him, \"Go and study in your room.\"", "His father shouted, \"Go right now to your study room\"", "His father said firmly, \"Go and study in your room.\""], "correct": "His father said, \"Go to your room and study.\"", "solution": "His father said, \"Go to your room and study.\""}, {"qText": "He said to his father, \"Please increase my pocket-money.\"", "ans": ["He told his father, \"Please increase the pocket-money\"", "He pleaded his father to please increase my pocket money.", "He requested his father to increase his pocket-money.", "He asked his father to increase his pocket-money."], "correct": "He requested his father to increase his pocket-money.", "solution": "He requested his father to increase his pocket-money"}, {"qText": "She said that her brother was getting married.", "ans": ["She said, \"Her brother is getting married.\"", "She told, \"Her brother is getting married.\"", "She said, \"My brother is getting married.\"", "She said, \"My brother was getting married.\""], "correct": "She said, \"My brother is getting married.\"", "solution": "She said, \"My brother is getting married.\""}, {"qText": "The boy said, \"Who dare call you a thief?\"", "ans": ["The boy enquired who dared call him a thief.", "The boy asked who called him a thief.", "The boy told that who dared call him a thief.", "The boy wondered who dared call a thief."], "correct": "The boy enquired who dared call him a thief.", "solution": "In changing the given sentence from direct speech to indirect speech, we need to follow the rules of reported speech. Here, the reporting verb is \"enquired,\" and we need to adjust the sentence accordingly:\n\nThe original sentence is in direct speech: \"The boy said, 'Who dare call you a thief?'\"\n\nIn indirect speech, the reporting verb \"said\" is changed to \"enquired,\" and the question is converted into a reported question. The pronoun \"you\" is changed to \"him\" to match the subject in the reporting clause:\n\nSo, the correct transformation is: Option A: The boy enquired who dared call him a thief."}, {"qText": "She exclaimed with sorrow that was a very miserable plight.", "ans": ["She said with sorrow, \"What a pity it is.\"", "She said, \"What a mystery it is.\"", "She said, \"What a miserable sight it is.\"", "She said, \"What a miserable plight it is.\""], "correct": "She said, \"What a miserable plight it is.\"", "solution": "She said, \"What a miserable plight it is.\""}, {"qText": "Dhruv said that he was sick and tired of working for that company.", "ans": ["Dhruv said, \"I am sick and tired of working for this company.\"", "Dhruv said, \"He was tired of that company.\"", "Dhruv said to me, \"I am sick and tired of working for this company.\"", "Dhruv said, \"I will be tired of working for that company.\""], "correct": "Dhruv said, \"I am sick and tired of working for this company.\"", "solution": "Dhruv said, \"I am sick and tired of working for this company.\""}, {"qText": "\"Are you alone, my son?\" asked a soft voice close behind me.", "ans": ["A soft voice asked that what I was doing there alone.", "A soft voice said to me are you alone son.", "A soft voice from my back asked If I was alone.", "A soft voice behind me asked If I was alone."], "correct": "A soft voice behind me asked If I was alone.", "solution": "A soft voice behind me asked If I was alone."}, {"qText": "She said to him, \"Why don't you go today?\"", "ans": ["She asked him why he did not go that day.", "She said to him why he don", "She asked him not to go that day.", "She asked him why he did not go today."], "correct": "She asked him why he did not go that day.", "solution": "She asked him why he did not go that day."}, {"qText": "He exclaimed with joy that India had won the Sahara Cup.", "ans": ["He said, \"India has won the Sahara Cup\"", "He said, \"India won the Sahara Cup\"", "He said, \"How! India will win the Sahara Cup\"", "He said, \"Hurrah! India has won the Sahara Cup\""], "correct": "He said, \"Hurrah! India has won the Sahara Cup\"", "solution": "He said, \"Hurrah! India has won the Sahara Cup\""}, {"qText": "The little girl said to her mother, \"Did the sun rise in the East?\"", "ans": ["The little girl said to her mother that the sun rose in the East.", "The little girl asked her mother if the sun rose in the East.", "The little girl said to her mother if the sun rises in the East.", "The little girl asked her mother if the sun is in the East."], "correct": "The little girl asked her mother if the sun rose in the East.", "solution": "The little girl asked her mother if the sun rose in the East."}, {"qText": "The man said, \"No, I refused to confers guilt.\"", "ans": ["The man emphatically refused to confers guilt.", "The man refused to confers his guilt.", "The man told that he did not confers guilt.", "The man was stubborn enough to confers guilt."], "correct": "The man emphatically refused to confers guilt.", "solution": "The man emphatically refused to confers guilt."}, {"qText": "Nita ordered her servant to bring her cup of tea.", "ans": ["Nita told her servant, \"Bring a cup of tea.\"", "Nita said, \"Bring me a cup of tea.\"", "Nita said to her servant, \"Bring me a cup of tea.\"", "Nita told her servant, \"Bring her that cup of tea.\""], "correct": "Nita said to her servant, \"Bring me a cup of tea.\"", "solution": "Nita said to her servant, \"Bring me a cup of tea.\""}, {"qText": "My cousin said, \"My room-mate had snored throughout the night.\"", "ans": ["my cousin said that her room-mate snored throughout the night.", "my cousin told me that her room-mate snored throughout the night.", "my cousin complained to me that her room-mate is snoring throughout the night.", "my cousin felt that her room-mate may be snoring throughout the night."], "correct": "my cousin said that her room-mate snored throughout the night.", "solution": "My cousin said that her room-mate snored throughout the night."}, {"qText": "\"Please don't go away\", she said.", "ans": ["She said to please her and not go away.", "She told me to go away.", "She begged me not to go away.", "She begged that I not go away."], "correct": "She begged me not to go away.", "solution": "She begged me not to go away."}, {"qText": "She said to her friend, \"I know where is everyone\"", "ans": ["She told that she knew where was everyone.", "She told her friend that she knew where everyone was.", "She told her friend that she knew where is everyone.", "She told her friend that she knows where was everyone."], "correct": "She told her friend that she knew where everyone was.", "solution": "She told her friend that she knew where everyone was."}, {"qText": "He said to her, \"Are you coming to the party?\"", "ans": ["He asked her whether she was coming to the party.", "He told her if she was coming to the party.", "He asked her if she was coming to the party.", "He asked her if she will be coming to the party."], "correct": "He asked her if she was coming to the party.", "solution": "He asked her if she was coming to the party."}, {"qText": "My friend said to me, \"Has your father returned from Calcutta?\"", "ans": ["My friend said to me that my father has returned from Calcutta.", "My friend asked me if my father had returned from Calcutta. ", "My friend told me that his father had returned from Calcutta.", "My friend enquired me if his father had returned from Calcutta."], "correct": "My friend asked me if my father had returned from Calcutta. ", "solution": "My friend asked me if my father had returned from Calcutta."}, {"qText": "He said, \"What a beautiful scene!\"", "ans": ["He said that what a beautiful scene it was.", "He wondered that it was a beautiful scene.", "He exclaimed what a beautiful scene it was.", "He exclaimed that it was a very beautiful scene."], "correct": "He exclaimed that it was a very beautiful scene.", "solution": "He exclaimed that it was a very beautiful scene."}, {"qText": "Gavaskar said, \"Bravo! Azhar, you have done well.\"", "ans": ["Gavaskar exclaimed with joy that Azhar had done well.", "Gavaskar called Azhar and exclaimed that he had done well.", "Gavaskar congratulated Azhar, saying that he had done well.", "Gavaskar praised Azhar for his having done well."], "correct": "Gavaskar congratulated Azhar, saying that he had done well.", "solution": "Gavaskar congratulated Azhar, saying that he had done well."}, {"qText": "He said, \"May God grant peace to the departed soul!\"", "ans": ["He wished by God to grant peace to the departed soul.", "He wished that God may grant peace to the departed soul.", "He prayed that might God grant peace to the departed soul.", "He prayed that God would grant peace to the departed soul."], "correct": "He prayed that God would grant peace to the departed soul.", "solution": "He prayed that God would grant peace to the departed soul."}, {"qText": "Mary said to Robert, \"Let him come, then we shall see.\" ", "ans": ["Mary said to Robert that if he came, they would see him.", "Mary told Robert that they shall see him if he came.", "Mary told Robert that once he came, they would see him.", "Mary told Robert that they would see him if he might come."], "correct": "Mary told Robert that they would see him if he might come.", "solution": "Mary told Robert that they would see him if he might come."}, {"qText": "The spectators said, \"Bravo! well played, Ravi.\"", "ans": ["The spectators called Ravi bravo because he had played well.", "The spectators said that Ravi played well and applauded him.", "The spectators encouraged Ravi saying that he played well.", "The spectators applauded Ravi, saying that he had played well."], "correct": "The spectators applauded Ravi, saying that he had played well.", "solution": "The spectators applauded Ravi, saying that he had played well."}, {"qText": "The sage said, \"God helps those who help themselves.\"", "ans": ["The sage said that God helps those who help themselves.", "The sage said that God helped those whose helped themselves.", "The sage said that God helps those who helped themselves.", "The sage said that God helped those who help themselves."], "correct": "The sage said that God helps those who help themselves.", "solution": "The sage said that God helps those who help themselves."}, {"qText": "He said, \"Where shall I be this time next year!\"", "ans": ["He asked that where should he be that time next year.", "He wondered where he should be that time the next year.", "He contemplated where shall he be that time the following year.", "He wondered where he would be that time the following year."], "correct": "He wondered where he would be that time the following year.", "solution": "He wondered where he would be that time the following year."}, {"qText": "He said , \"I saw a book here.\"", "ans": ["He said that he saw a book here.", "He said that he saw a book there.", "He said that he had seen a book here.", "He said that he had seen a book there."], "correct": "He said that he had seen a book there.", "solution": "He said that he had seen a book there."}, {"qText": "He said to me, \"Where is the post office?\"", "ans": ["He wanted to know where the post office was.", "He asked me that where the post office was.", "He asked me where the post office was.", "He asked me where was the post office."], "correct": "He asked me where the post office was.", "solution": "He asked me where the post office was."}, {"qText": "\"Are you alone, my son?\" asked a soft voice close behind me.", "ans": ["A soft voice from my back asked if I was alone.", "A soft voice said to me are you alone son.", "A soft voice asked that what I was doing there alone. ", "A soft voice behind me asked if I was alone."], "correct": "A soft voice behind me asked if I was alone.", "solution": "A soft voice behind me asked if I was alone."}, {"qText": "He said, \"I have often told you not to waste your time.\"", "ans": ["He said that he had often told not to waste your time.", "He said that he had often told him not to waste your time.", "He said that he had often suggested to him not to waste his time. ", "He told that he had often told him not to waste his time."], "correct": "He told that he had often told him not to waste his time.", "solution": "He told that he had often told him not to waste his time."}, {"qText": "\"If you don't keep quiet I shall shoot you, \" he said to her in a calm voice.", "ans": ["He warned her to shoot if she didn't keep quiet calmly.", "He said calmly that i shall shoot you if you don't be quiet.", "He warned her calmly that he would shoot her if she didn't keep quiet.", "Calmly he warned her that be quiet or else he will have to shoot her."], "correct": "He warned her calmly that he would shoot her if she didn't keep quiet.", "solution": "He warned her calmly that he would shoot her if she didn't keep quiet."}, {"qText": "\"Please don't go away\", she said.", "ans": ["She said to please her and not go away.", "She told me not to go away.", "She begged that I not go away.", "She begged me not to go away."], "correct": "She begged me not to go away.", "solution": "She begged me not to go away."}, {"qText": "Rajesh said, \"I bought a car yesterday.\"", "ans": ["Rajesh said that I have bought a car the previous day.", "Rajesh told us that he had bought a car yesterday. ", "Rajesh said that he bought a car the previous day.", "Rajesh said that he had bought a car the previous day."], "correct": "Rajesh said that he had bought a car the previous day.", "solution": "Rajesh said that he had bought a car the previous day."}, {"qText": "He said to me, \"What time do the offices close?\"", "ans": ["He wanted to know what time the offices close.", "He asked me what time did the offices close.", "He asked me what time the offices closed.", "He asked me what time the offices did close."], "correct": "He asked me what time the offices closed.", "solution": "He asked me what time the offices closed."}, {"qText": "He said, \"The mice will play, when the cat is away.\"", "ans": ["He said that the mice will play when the cat is away.", "He said that the mice would play when the cat was away.", "He said that the mice would play when the cat would be away.", "He said that the mice shall play, when the cat is away."], "correct": "He said that the mice would play when the cat was away.", "solution": "He said that the mice would play when the cat was away."}, {"qText": "He said, \"I must go next week.\"", "ans": ["He said that he must go next week.", "He said that he must go the following week.", "He said that he would have to go the following week.", "He said that he was to go the following week."], "correct": "He said that he would have to go the following week.", "solution": "He said that he would have to go the following week."}, {"qText": "Rajan said, \"O that I were a child again!\"", "ans": ["Rajan exclaimed with wonder that he was a child again.", "Rajan wondered that were he a child again.", "Rajan strongly wished that he had been a child again.", "Rajan prayed that he were a child again."], "correct": "Rajan strongly wished that he had been a child again.", "solution": "Rajan strongly wished that he had been a child again."}, {"qText": "He said, \"I clean my teeth twice a day.\"", "ans": ["He said that he cleaned his teeth twice a day.", "He said that he cleans his teeth twice a day.", "He said that he used to clean his teeth twice a day.", "He said that he is used to cleaning his teeth twice a day."], "correct": "He said that he cleans his teeth twice a day.", "solution": "In indirect speech, when converting a present tense statement made in the past into reported speech, the reporting verb (\"said\" in this case) remains in the past tense, but the tense of the verb in the reported speech can either remain the same if the statement is still true or change accordingly. In this sentence, the original statement is in present tense (\"I clean my teeth twice a day\"). So, when reporting it, the tense of the verb \"clean\" doesn't need to change. Hence, the correct option is B, where the reported speech maintains the present tense: \"He said that he cleans his teeth twice a day.\""}, {"qText": "The employer said to the workman, \"I cannot pay you higher wages.\"", "ans": ["The employer told the workman that he could not be paid higher wages.", "The employer told the workman that he could not pay him higher wages.", "The employer forbade the workman to pay higher wages.", "The employer warned the workman that he cannot pay him higher wages."], "correct": "The employer told the workman that he could not pay him higher wages.", "solution": "The employer told the workman that he could not pay him higher wages."}, {"qText": "Pinki said to Gaurav, \"Will you help me in my work just now?\"", "ans": ["Pinki asked Gaurav if he would help her in her work just then.", "Pinki questioned to Gaurav that will you help me in my work just now.", "Pinki told Gaurav whether he will help her in her work just now.", "Pinki asked to Gaurav that will he help her in her work just now."], "correct": "Pinki asked Gaurav if he would help her in her work just then.", "solution": "Pinki asked Gaurav if he would help her in her work just then."}, {"qText": "He said to his servant, \"Why are you so lazy today?\"", "ans": ["He asked his servant why he was so lazy that day.", "He asked his servant why he had been so lazy that day.", "He asked his servant why he was being so lazy that day.", "He asked his servant why was he so lazy that day."], "correct": "He asked his servant why he was so lazy that day.", "solution": "He asked his servant why he was so lazy that day."}, {"qText": "He said to her, \"Don't read so fast.\"", "ans": ["He told her not to read so fast.", "He advised her don't read so fast.", "He requested her not to read so fast.", "He ordered her not to read so fast."], "correct": "He told her not to read so fast.", "solution": "He told her not to read so fast."}, {"qText": "I said to my brother, \"Let us go to some hill station for a change.\" ", "ans": ["I asked my brother to go to some hill station for a change.", "I asked my brother if he would go to some hill station for a change.", "I permitted my brother to go to some hill station for a change.", "I suggested my brother that we should go to some hill station for a change."], "correct": "I suggested my brother that we should go to some hill station for a change.", "solution": "I suggested my brother that we should go to some hill station for a change."}, {"qText": "He said to them, \"Don't make a noise.\"", "ans": ["He told them that don't make a noise.", "He told them not to make noise.", "He told them not to make a noise.", "He asked them not to make a noise."], "correct": "He asked them not to make a noise.", "solution": "He asked them not to make a noise."}, {"qText": "My cousin said, \"My room-mate snored throughout the night.\"", "ans": ["My cousin said that her room-mate had snored throughout the night.", "My cousin told me that her room-mate snored throughout the night.", "My cousin complained to me that her room-mate is snoring throughout the night.", "My cousin felt that her room-mate may be snoring throughout the night."], "correct": "My cousin said that her room-mate had snored throughout the night.", "solution": "My cousin said that her room-mate had snored throughout the night."}, {"qText": "Sarita said to me, \"I will do it now or never.\"", "ans": ["Sarita told me that I would do it then or never.", "Sarita told me that she would do it now or never.", "Sarita told me that she will do that now or never.", "Sarita told me that she would do it then or never."], "correct": "Sarita told me that she would do it then or never.", "solution": "Sarita told me that she would do it then or never."}, {"qText": "He said, \"Can you sing?\" And I said, \"No\".", "ans": ["He asked me that could I sing and I refused.", "He asked me if I could sing and I said that I couldn't.", "I denied, when he asked me if I could sing.", "He asked me if I could sing and I said no."], "correct": "He asked me if I could sing and I said that I couldn't.", "solution": "He asked me if I could sing and I said that I couldn't."}, {"qText": "\"I don't know the way. Do you?\" he asked.", "ans": ["He said that he didn't know the way and did I know it.", "He told that he was not knowing the way, but wondered if I knew.", "He said that he didn't know the way and asked me if I did.", "He asked me if I knew the way which he didn't."], "correct": "He said that he didn't know the way and asked me if I did.", "solution": "He said that he didn't know the way and asked me if I did."}, {"qText": "The Manager said, \"Well, what can I do for you?\"", "ans": ["The Manager asked what he could do for him. ", "The Manager wondered what he could do for him.", "The Manager wanted to know what he could do for him.", "The Manager said that he couldn't do anything for him."], "correct": "The Manager wanted to know what he could do for him.", "solution": "The Manager wanted to know what he could do for him."}, {"qText": "The teacher said, \"Be quiet, boys.\"", "ans": ["The teacher said that they boys should be quiet. ", "The teacher called the boys and ordered them to be quiet. ", "The teacher urged the boys to be quiet.", "The teacher commanded the boys that they be quiet."], "correct": "The teacher urged the boys to be quiet.", "solution": "The teacher urged the boys to be quiet."}, {"qText": "He asked his teacher, \"Need I read this chapter?\"", "ans": ["He asked his teacher whether there was a need to read that chapter.", "He asked his teacher whether he needed to read this chapter.", "He asked his teacher if it was necessary to read this chapter.", "He asked his teacher if he had to read that chapter."], "correct": "He asked his teacher if he had to read that chapter.", "solution": "He asked his teacher if he had to read that chapter."}, {"qText": "She said to him, \"Why don't you go today?\"", "ans": ["She said to him that why he don't go today.", "She asked him if he was going that day.", "She asked him why he did not go today.", "She asked him why he did not go that day."], "correct": "She asked him why he did not go that day.", "solution": "She asked him why he did not go that day."}, {"qText": "He said to her, \"May you succeed!\"", "ans": ["He told her that she might succeed.", "He prayed to God that she may succeed.", "He wished her success.", "He said to her that she might succeed."], "correct": "He wished her success.", "solution": "He wished her success."}, {"qText": "He said, \"Will you listen to such a man?\"", "ans": ["He asked them will you listen to such a man.", "He asked them are you listening to such a man.", "He asked them whether they would listen to such a man.", "He asked them whether they will listen to such a man."], "correct": "He asked them whether they would listen to such a man.", "solution": "He asked them whether they would listen to such a man."}, {"qText": "The traveller enquired to the farmer if he could tell him the way to the nearest inn.", "ans": ["The traveller said to the farmer, \"Where is the nearest inn?\"", "The traveller said to the farmer, \"Which is the way to the nearest inn?\" ", "The traveller said to the farmer, \"Can you tell me the way to the nearest inn?\"", "The traveller said to the farmer, \"Can you tell me where is the nearest inn?\""], "correct": "The traveller said to the farmer, \"Can you tell me the way to the nearest inn?\"", "solution": "The traveller said to the farmer, \"Can you tell me the way to the nearest inn?\""}, {"qText": "Samuel said to Remiel, \"Where do you usually go swimming?\"", "ans": ["Samuel asked Remiel where he usually went swimming.", "Samuel said to Remiel where he usually goes swimming.", "Samuel asked if Remiel usually went swimming.", "Samuel told Remiel where he usually had been going swimming."], "correct": "Samuel asked Remiel where he usually went swimming.", "solution": "Samuel asked Remiel where he usually went swimming."}, {"qText": "She said to her brother, \"Don't be late, we'll be waiting for you.\"", "ans": ["She said to her brother not to be late for they would have been waiting for him.", "She requested her brother not to be late for they would be waiting for him.", "She requested her brother not to be late for we would be waiting for him.", "She said to her brother that he should not be late for she would be waiting for him."], "correct": "She requested her brother not to be late for they would be waiting for him.", "solution": "She requested her brother not to be late for they would be waiting for him."}, {"qText": "The doctor said to the patient, \"How do you feel now? Has the pain gone down?\"", "ans": ["The doctor asked the patient how he was feeling then and if the pain was down.", "The doctor asked the patient how he felt then and if the pain had gone down.", "The doctor asked the patient how he had felt when the pain was gone.", "The doctor asked the patient how he is feeling now and if the pain has gone down."], "correct": "The doctor asked the patient how he felt then and if the pain had gone down.", "solution": "The doctor asked the patient how he felt then and if the pain had gone down."}, {"qText": "The porter respectfully assured the lady that he would take care of her baggage while she bought her ticket.", "ans": ["The porter said, \"I would take care of your baggage while you buy your ticket, Madam.\"", "The porter said, \"I will take care of your baggage while you buy your ticket, Madam.\"", "The porter said, \"I would take care of your baggage while you bought your ticket, Madam.\"", "The porter said to the lady,\"I would take care of your baggage while you bought your ticket.\""], "correct": "The porter said, \"I will take care of your baggage while you buy your ticket, Madam.\"", "solution": "The porter said, \"I will take care of your baggage while you buy your ticket, Madam.\""}, {"qText": "They said, \"It was raining heavily,when they came out of the theatre.\"", "ans": ["They said that it was raining heavily, when they had come out of the theatre.", "They said that it had been raining heavily, when they came out of the theatre.", "They said that it rained when they had come out of the theatre.", "They said that it had been raining heavily, when they had come out of the theatre."], "correct": "They said that it had been raining heavily, when they came out of the theatre.", "solution": "They said that it had been raining heavily, when they came out of the theatre."}, {"qText": "He said, \"The government is writing letters.\"", "ans": ["He said that the government is writing letters.", "He said that the government was writing letters.", "He said that the government will write letters.", "He said that the government wrote letters."], "correct": "He said that the government was writing letters.", "solution": "He said that the government was writing letters."}, {"qText": "\"Don't play on the grass, boys,\" she said.", "ans": ["She ordered the boys \"Don't play on the grass.\"", "She said to the boys that they should not play on the grass.", "She told the boys that they should not be playing on the grass.", "She told the boys not to play on the grass."], "correct": "She told the boys not to play on the grass.", "solution": "She told the boys not to play on the grass."}, {"qText": "\"What a terrible storm it is!\" he said.", "ans": ["He exclaimed that it was a terrible storm.", "He exclaimed that it has been a terrible storm.", "He exclaimed that it will be a terrible storm.", "He exclaimed that it is a terrible storm."], "correct": "He exclaimed that it was a terrible storm.", "solution": "He exclaimed that it was a terrible storm."}, {"qText": "He asked me why I was late.", "ans": ["He asked me, \"Why are you late?\"", "He asked me, \"Why I was late?\"", "He asked me, \"Why you are late?\"", "He asked me, \"Why am I late?\""], "correct": "He asked me, \"Why are you late?\"", "solution": "He asked me, \"Why are you late?\""}, {"qText": "The Captain commanded his men to stand at ease.", "ans": ["The Captain commanded, \"Men, stand at ease.\"", "The Captain said, \"These men need to stand at ease.\"", "The Captain said, \"You can stand at ease. \"", "The Captain said to his men, \"Stand at ease. \""], "correct": "The Captain said to his men, \"Stand at ease. \"", "solution": "The Captain said to his men, \"Stand at ease.\""}, {"qText": "Wardha said to her sister, \"How long do you intend to stay here?\"", "ans": ["Wardha asked her sister that how long she intended to stay there.", "Wardha asked her sister how long she intended to stay there.", "Wardha asked to her sister how long she intended to stay here.", "Wardha asked her sister how long she intended to stay here."], "correct": "Wardha asked her sister how long she intended to stay there.", "solution": "Wardha asked her sister how long she intended to stay there."}, {"qText": "The teacher said, \"Students, we live in deeds, not in years.\"", "ans": ["The teacher said that we live in deeds, not in years.", "The teacher said to students we live in deeds, not in years.", "The teacher said to the students that we live in deeds, not in years.", "The teacher said to the students that we lived in deeds, not in years."], "correct": "The teacher said to the students that we live in deeds, not in years.", "solution": "The teacher said to the students that we live in deeds, not in years."}, {"qText": "\"The last thing I want for my daughter is a boy who drinks !\" said Brinda.", "ans": ["Brinda proclaimed that the last thing she wanted for her daughter was a boy who drank.", "Brinda said that the last thing she would want for her daughter was a boy who drank.", "Brinda told that the last thing she wants for her daughter is a boy who drank.", "Brinda complained that the last thing she wants for her daughter is a boy who drank."], "correct": "Brinda proclaimed that the last thing she wanted for her daughter was a boy who drank.", "solution": "Brinda proclaimed that the last thing she wanted for her daughter was a boy who drank."}, {"qText": "Looking at the Taj Mahal the tourist said, \"What an exquisitely beautiful creation !\"", "ans": ["Looking Taj Mahal the tourist told that it is an exquisitely beautiful creation.", "Looking at the Taj Mahal the tourist exclaimed in wonder that what an exquisitely beautiful creation.", "Looking Taj Mahal the tourist said what an exquisitely beautiful creation it was indeed.", "Looking at the Taj Mahal the tourist exclaimed in wonder that it was indeed an exquisitely beautiful creation."], "correct": "Looking at the Taj Mahal the tourist exclaimed in wonder that it was indeed an exquisitely beautiful creation.", "solution": "Looking at the Taj Mahal the tourist exclaimed in wonder that it was indeed an exquisitely beautiful creation."}, {"qText": "He said, \"I have passed the examination.\"", "ans": ["He said that he had passed the examination.", "He announced that he has passed the examination.", "He said that he had to pass the examination", "He said that he has passed the examination."], "correct": "He said that he had passed the examination.", "solution": "He said that he had passed the examination."}, {"qText": "The doctor says, \"It is better you undergo a surgery next week.\"", "ans": ["The doctor advised me to undergo a surgery the following week.", "The doctor says that it is better I undergo a surgery the following week.", "The doctor says that it was better I under went a surgery the coming week.", "The doctor advises that it is better I under went a surgery the following week."], "correct": "The doctor says that it is better I undergo a surgery the following week.", "solution": "The doctor says that it is better I undergo a surgery the following week."}, {"qText": "The traveller said, \"What a beautiful sight!\"", "ans": ["The traveller exclaimed that it was an beautiful sight.", "The traveller exclaimed that it was a beautiful sight.", "The traveller said that it was beautiful.", "The traveller remarked the beautiful sight."], "correct": "The traveller exclaimed that it was a beautiful sight.", "solution": "The traveller exclaimed that it was a beautiful sight."}, {"qText": "He said that I needn't wait there.", "ans": ["He said, \"You needn't wait here.\"", "He said, \"I needn't wait there.\"", "He said, \"You needn't wait there.\"", "He said, \"I needn't wait her.\""], "correct": "He said, \"You needn't wait here.\"", "solution": "He said, \"You needn't wait here.\""}, {"qText": "The policeman said to the violent crowd,\"Stop all this or you will be arrested.\"", "ans": ["The policeman said to the violent crowd to stop all this or be arrested.", "The policeman said to the violent crowd that they should stop or else be arrested.", "The policeman advised the violent crowd to stop or else be arrested.", "The policeman ordered the violent crowd to stop all that or they would be arrested."], "correct": "The policeman ordered the violent crowd to stop all that or they would be arrested.", "solution": "The policeman ordered the violent crowd to stop all that or they would be arrested."}, {"qText": "Sachin said, \"My grandfather recites the Geeta every morning.\"", "ans": ["Sachin told that his grandfather has cited the Geeta every morning.", "Sachin told that his grandfather recited the Geeta every morning.", "Sachin said that his grandfather recites the Geeta every morning.", "Sachin said that his grandfather recited the Geeta every morning."], "correct": "Sachin said that his grandfather recited the Geeta every morning.", "solution": "Sachin said that his grandfather recited the Geeta every morning."}, {"qText": "The teacher said, \"Rajiv, come to my desk with your exercise book now.\"", "ans": ["The teacher ordered Rajiv to come to her desk with his exercise book now", "The teacher ordered Rajiv to come to her desk with his exercise book then.", "The teacher ordered Rajiv to go to her desk with his exercise book now.", "The teacher said to Rajiv come to her desk with his exercise book then."], "correct": "The teacher ordered Rajiv to come to her desk with his exercise book then.", "solution": "The teacher ordered Rajiv to come to her desk with his exercise book then."}, {"qText": "\"What's that noise? It sounds like an aeroplane,\" said Ravi.", "ans": ["Ravi asked what the noise was, adding that it sounded like an aeroplane.", "Ravi demanded to know what the noise was, saying that it sounded like an aeroplane.", "Ravi asked what the noise could have been saying that it sounded like an aeroplane.", "Ravi wondered about the noise thinking that it sounded like an aeroplane."], "correct": "Ravi asked what the noise was, adding that it sounded like an aeroplane.", "solution": "Ravi asked what the noise was, adding that it sounded like an aeroplane."}, {"qText": "\"Tomorrow gives me no time !\"said Amanda.", "ans": ["Amanda exclaimed that tomorrow gives her no time.", "Amanda said that tomorrow gave her no time at all.", "Amanda exclaimed that tomorrow had given her no time.", "Amanda exclaimed that the following day gave her no time."], "correct": "Amanda exclaimed that the following day gave her no time.", "solution": "Amanda exclaimed that the following day gave her no time."}, {"qText": "Naren said, \"Why are you still waiting here, Binod?\"", "ans": ["Naren asked Binod why he was still waiting there.", "Naren asked Binod that why he was still waiting there.", "Naren asked Binod why he is still waiting there.", "Naren asked Binod that why you were still waiting there."], "correct": "Naren asked Binod why he was still waiting there.", "solution": "Naren asked Binod why he was still waiting there."}, {"qText": "The teacher asked the student when he would submit his assignment.", "ans": ["The teacher said to the student, \"When will you submit your assignment?\"", "The teacher asked the student, \"When will you submit his assignment?\"", "The teacher asked the student, \"When would you submit his assignment?\"", "The teacher asked the student, \"When would he submit his assignment?\""], "correct": "The teacher said to the student, \"When will you submit your assignment?\"", "solution": "The teacher said to the student, \"When will you submit your assignment?\""}, {"qText": "I said to the worker, \"How do you like your job ?\"", "ans": ["I told the worker how he liked his job.", "I asked the worker how you like your job.", "I asked the worker how he liked his job.", "I asked the worker how you liked his job."], "correct": "I asked the worker how he liked his job.", "solution": "I asked the worker how he liked his job."}, {"qText": "Suma said to him, \"Am I to wait for you forever?\"", "ans": ["Suma asked him if she were to wait for him forever.", "Suma said to him if she can wait for him forever.", "Suma asked him if she was to wait for him forever.", "Suma asked him if she had to wait for him forever."], "correct": "Suma asked him if she was to wait for him forever.", "solution": "Suma asked him if she was to wait for him forever."}, {"qText": "Mr. Gupta said to his son, \"Do not take up any responsibility unless you are confident you can do it.\"", "ans": ["Mr. Gupta advised his son not to take up any responsibility unless he is confident of doing it.", "Mr. Gupta advised his son against taking up responsibility without completing it.", "Mr. Gupta advised his son to take up the responsibility of completing the task.", "Mr. Gupta advised his son not to take up any responsibility unless he was confident that he could do it."], "correct": "Mr. Gupta advised his son not to take up any responsibility unless he was confident that he could do it.", "solution": "Mr. Gupta advised his son not to take up any responsibility unless he was confident that he could do it."}, {"qText": "He told me that I was very happy.", "ans": ["He said to me, \"How happy you are !\"", "He said to me, \"How you are happy !\"", "He said to me, \"I am very happy!\"", "He said to me, \"How I am happy!\""], "correct": "He said to me, \"How happy you are !\"", "solution": "He said to me, \"How happy you are !\""}, {"qText": "\"Is that so?\" the Sahib said cheerfully.\"Well, I like village folk.\"", "ans": ["The Sahib cheerfully asked if it was such and said he likes village folk.", "The Sahib asked cheerfully whether that was so, adding that he liked village folk.", "The Sahib told with cheer that it was so and asked if he liked village folk.", "The Sahib was asking cheerfully if it was so and added that he liked village folk."], "correct": "The Sahib asked cheerfully whether that was so, adding that he liked village folk.", "solution": "The Sahib asked cheerfully whether that was so, adding that he liked village folk."}, {"qText": "The student said, \"Let me come in.\"", "ans": ["The student told that let he be allowed to come in.", "The student said that if he is allowed to come in.", "The student requested to let him come in.", "The student requested that he might be allowed to come in."], "correct": "The student requested that he might be allowed to come in.", "solution": "The student requested that he might be allowed to come in."}, {"qText": "\"Jack fell as he'd have wished,\" the mother said.\"", "ans": ["The mother said that Jack had fallen as he would have wished.", "The mother said that Jack fell as he had wished.", "The mother said that Jack has fallen as he has wished.", "The mother said that Jack had been fallen as he would have been wished."], "correct": "The mother said that Jack had fallen as he would have wished.", "solution": "The mother said that Jack had fallen as he would have wished."}, {"qText": "The Principal asked me whether I had informed the Chief Guest the revised schedule the day before.", "ans": ["The Principal said to me, \"Did I inform the Chief Guest the revised schedule the day before?\"", "The Principal said to me, \"Have I informed the Chief Guest the revised schedule the day before?\"", "The Principal said to me, \"Have you informed the Chief Guest the revised schedule yesterday?\"", "The Principal said to me,\"Did you inform the Chief Guest the revised schedule yesterday?\""], "correct": "The Principal said to me,\"Did you inform the Chief Guest the revised schedule yesterday?\"", "solution": "The Principal said to me,\"Did you inform the Chief Guest the revised schedule yesterday?\""}, {"qText": "He said to me, \"Where is the post office?\"", "ans": ["He asked me that where the post office was.", "He asked me where was the post office.", "He wanted to know where the post office was.", "He asked me where the post office was."], "correct": "He asked me where the post office was.", "solution": "He asked me where the post office was."}, {"qText": "\"Don't pull the dog's tail,\" his father said.", "ans": ["His father said that he did not pull the dog's tail.", "His father forbade him not to pull the dog's tail.", "His father told him to pull the dog's tail.", "His father told him not to pull the dog's tail."], "correct": "His father told him not to pull the dog's tail.", "solution": "His father told him not to pull the dog's tail."}, {"qText": "The man said to the boy, \"It only seems complicated because you're not used to it.\"", "ans": ["The man told the boy that it only seems complicated because he was not used to it.", "The man told the boy that it only seemed complicated because he is not used to it.", "The man told the boy that it only seemed complicated because he was not used to it.", "The man told the boy it only seems complicated, it is really not so."], "correct": "The man told the boy that it only seemed complicated because he was not used to it.", "solution": "The man told the boy that it only seemed complicated because he was not used to it."}, {"qText": "He said, \"Let me have some tea.\"", "ans": ["He said to let him have some tea.", "He asked us to let him have some tea.", "He wished that he might have some tea.", "He wished that he will have some tea."], "correct": "He asked us to let him have some tea.", "solution": "He asked us to let him have some tea."}, {"qText": "The client told his lawyer, \"I'm going away for a few days. I'll call you when I get back.\"", "ans": ["The client told his lawyer that he was going away for a few days and would call him when he got back.", "The client promised his lawyer that he was going away for a few days and would call him when he got back.", "The client told his lawyer that he is going away for a few days and will call him when he gets back.", "The client assured his lawyer that he was going away for a few days and would definitely call him when he got back."], "correct": "The client told his lawyer that he was going away for a few days and would call him when he got back.", "solution": "The client told his lawyer that he was going away for a few days and would call him when he got back."}, {"qText": "He said, \"Babies, drink milk.\"", "ans": ["He said that babies drink milk.", "He told that babies should drink milk.", "He advised the babies to drink milk.", "He said that babies drank milk."], "correct": "He advised the babies to drink milk.", "solution": "He advised the babies to drink milk."}, {"qText": "\"Can you see a woman seated on the bench in a park?\" - Alice asked her.", "ans": ["Alice asked her if she can see a woman seated on the bench in a park.", "Alice told her if she could see a woman seated on the bench in a park.", "Alice asked her if she could see a woman seated on the bench in a park.", "Alice asked her if she could have seen a woman seated on the bench in a park."], "correct": "Alice asked her if she could see a woman seated on the bench in a park.", "solution": "Alice asked her if she could see a woman seated on the bench in a park."}, {"qText": "The Chief Guest said, \"It gives me great pleasure to be here this morning.\"", "ans": ["The Chief Guest said that that gave me great pleasure to be there that morning.", "The Chief Guest said that it gives him great pleasure to be here that morning.", "The Chief Guest said that it gives him great pleasure to be here that morning.", "The Chief Guest said that it gave him great pleasure to be there that morning."], "correct": "The Chief Guest said that it gave him great pleasure to be there that morning.", "solution": "The Chief Guest said that it gave him great pleasure to be there that morning."}, {"qText": "My father said, \"Honesty is the best policy.\"", "ans": ["My father stated that honesty was the best policy.", "My father said that honesty is the best policy.", "My father said that honesty was the best policy.", "My father said that honesty has been the best policy."], "correct": "My father said that honesty is the best policy.", "solution": "My father said that honesty is the best policy."}, {"qText": "Yolanda said, \"I have to leave the class before 12:30 p.m.\"", "ans": ["Yolanda said that 1 have to leave the class before 12:30 p.m.", "Yolanda said that she has to leave the class before 12:30 p.m.", "Yolanda said that she had to leave the class before 12:30 p.m.", "Yolanda said that she has had to leave the class before 12:30 p.m."], "correct": "Yolanda said that she had to leave the class before 12:30 p.m.", "solution": "Yolanda said that she had to leave the class before 12:30 p.m."}, {"qText": "\"It's not my business,\" said the postman. \"Let the government do whatever it has to.\"", "ans": ["The postman said that it was the government's and not his business to do that.", "The postman said that the government did not do what it was expected to do.", "The postman said that it was not his business and that the government should do whatever it had to.", "The postman said that it was the business of the government to do whatever it had to."], "correct": "The postman said that it was not his business and that the government should do whatever it had to.", "solution": "The postman said that it was not his business and that the government should do whatever it had to."}, {"qText": "The mother advised her son to be careful and not to enter into a quarrel with the goons.", "ans": ["The mother advised her son, \"Be careful and not enter into a quarrel with the goons.\"", "The mother said to her son, \"Do not enter into a quarrel with the goons.\"", "The mother said to her son, \"Be careful. Do not enter into a quarrel with the goons.\"", "The mother said to her son to \"be careful.\""], "correct": "The mother said to her son, \"Be careful. Do not enter into a quarrel with the goons.\"", "solution": "The mother said to her son, \"Be careful. Do not enter into a quarrel with the goons.\""}, {"qText": "\"And you believe all this ?\" asked Sriram, in surprise.", "ans": ["Sriram asked me in surprise if I believed all this.", "Sriram asked me in disbelief if I was believing all this.", "Surprised, Sriram asked me whether I believed all that.", "Sriram was amazed that I believed all that."], "correct": "Surprised, Sriram asked me whether I believed all that.", "solution": "Surprised, Sriram asked me whether I believed all that."}, {"qText": "I said, \"I came here yesterday.\"", "ans": ["I said that I came here that day.", "I said that go here yesterday.", "I said that I had come there the previous day.", "I say that I went there the previous day."], "correct": "I said that I had come there the previous day.", "solution": "I said that I had come there the previous day."}, {"qText": "The king said, \"My force will protect the kingdom.\"", "ans": ["The king said that his force would protect the kingdom.", "The king said that the king's force will protect the kingdom.", "The king ordered that our force should protect the kingdom.", "The king commanded that his force will be protected the kingdom."], "correct": "The king said that his force would protect the kingdom.", "solution": "The king said that his force would protect the kingdom."}, {"qText": "He said, \"What a lovely voice she has!\"", "ans": ["He exclaimed that she had a very lovely voice.", "He exclaimed that she has a very lovely voice.", "He exclaimed that she did not have a lovely voice.", "He exclaimed that she does not have a lovely voice."], "correct": "He exclaimed that she had a very lovely voice.", "solution": "He exclaimed that she had a very lovely voice."}, {"qText": "She yelled, \"Please help me.\"", "ans": ["She yelled at one for some help.", "She yelled for someone to help.", "She yelled for someone to help her.", "She yelled at someone to help her."], "correct": "She yelled for someone to help her.", "solution": "She yelled for someone to help her."}, {"qText": "\"Don't hesitate to clear your doubts,\" the teacher said.", "ans": ["The teacher warned me not to hesitate in clearing my doubts.", "The teacher ordered me not to hesitate in clearing my doubts.", "The teacher persuaded me not to hesitate in clearing my doubts.", "The teacher requested me not to hesitate in clearing my doubts."], "correct": "The teacher persuaded me not to hesitate in clearing my doubts.", "solution": "The teacher persuaded me not to hesitate in clearing my doubts."}, {"qText": "The teacher said, \"Neha why are you late again today?\"", "ans": ["The teacher asked Neha why was she late again that day.", "The teacher asked Neha why she was late again today.", "The teacher asked Neha why she was late again that day?", "The teacher asked Neha why she was late again that day."], "correct": "The teacher asked Neha why she was late again that day.", "solution": "The teacher asked Neha why she was late again that day."}, {"qText": "His angry mother jeered, \"Do you suppose you know better than your father?\"", "ans": ["His angry mother jeered and asked if he was supposed to know better than his father.", "His angry mother jeered and asked whether he knew better than his father.", "His angry mother jeered and asked whether he supposed that he would know better than his father.", "His angry mother jeered and asked whether he supposed that he knew better than his father."], "correct": "His angry mother jeered and asked whether he supposed that he knew better than his father.", "solution": "His angry mother jeered and asked whether he supposed that he knew better than his father."}, {"qText": "She said to Dhiru, \"I am planning to leave tomorrow\".", "ans": ["She told Dhiru that she had planned to leave the next day.", "She told Dhiru that she is planning to leave the next day.", "She advised Dhiru that she was planning to leave next day.", "She told Dhiru that she was planning to leave the next day."], "correct": "She told Dhiru that she was planning to leave the next day.", "solution": "She told Dhiru that she was planning to leave the next day."}, {"qText": "He said, \"If I had the key with me, I could give you the solution\".", "ans": ["He said that if he had the key with him, he could give him/her the solution.", "He said if he could have the key with him,he would give him/her the solution.", "He told that if he could have the key with him, he would give him/her the solution.", "He said that If he have had the key with him, he could have given him/her the solution."], "correct": "He said that if he had the key with him, he could give him/her the solution.", "solution": "He said that if he had the key with him, he could give him/her the solution."}, {"qText": "The General said, \"Bravo! Well done, my soldiers\".", "ans": ["The General told the soldiers that they had done well.", "The General applauded his soldiers saying that they would do well.", "The General applauded his soldiers for their excellent job.", "The General applauded his soldiers saying that they had done well."], "correct": "The General applauded his soldiers saying that they had done well.", "solution": "The General applauded his soldiers saying that they had done well."}, {"qText": "He said to the interviewer, \"Could you please repeat the question?\"", "ans": ["He requested the interviewer if he could please repeat the question.", "He requested the interviewer to please repeat the question.", "He requested the interviewer to repeat the question.", "He requested the interviewer if he could repeat the question."], "correct": "He requested the interviewer to repeat the question.", "solution": "He requested the interviewer to repeat the question."}, {"qText": "The poor examinee said, \"0 God, take pity on me.\"", "ans": ["The poor examinee prayed God to take pity on him.", "The poor examinee, invoking God, implored him to take pity on him.", "The poor examinee exclaimed that God take pity on him.", "The poor examinee asked God to take pity on him."], "correct": "The poor examinee, invoking God, implored him to take pity on him.", "solution": "The poor examinee, invoking God, implored him to take pity on him."}, {"qText": "\"What about going for a swim,\" he said, \"It's quite fine now.\"", "ans": ["He asked me what about going for a swim as it was quite fine then.", "He proposed going for a swim as it was quite fine.", "He suggested going for a swim as it was quite fine.", "He advised me to go for a swim as it was quite fine."], "correct": "He asked me what about going for a swim as it was quite fine then.", "solution": "He asked me what about going for a swim as it was quite fine then."}, {"qText": "He said, \"I am glad to be here this evening.\"", "ans": ["He said that he was glad to be there that evening.", "He said he was glad to be here this evening.", "He says he was glad to be here this evening.", "He asked he is glad to be here this evening."], "correct": "He said that he was glad to be there that evening.", "solution": "He said that he was glad to be there that evening."}, {"qText": "He said, \"Be quiet and listen to my words.\"", "ans": ["He urged them to be quiet.and listen to his words.", "He asked them to be quiet and listen to his words.", "He urged them to be quiet and listen to my words.", "He requests them to be quiet and listen to his words."], "correct": "He urged them to be quiet.and listen to his words.", "solution": "He urged them to be quiet.and listen to his words."}, {"qText": "He said to her, \"Where is she going?\"", "ans": ["He asked her where she was going.", "He wanted to know where she is going.", "He wants to know where she was going.", "He said where she was going."], "correct": "He asked her where she was going.", "solution": "He asked her where she was going."}, {"qText": "Krishna said to his friends, \"Let us go to a movie today\".", "ans": ["Krishna suggested to his friends that let them go to a movie that day.", "Krishna proposed to his friends if they would go to a movie that day.", "Krishna proposed to his friends what if they would go to a movie that day.", "Krishna suggested to his friends that they should go to a movie that day."], "correct": "Krishna suggested to his friends that they should go to a movie that day.", "solution": "Krishna suggested to his friends that they should go to a movie that day."}, {"qText": "He said to her, \"Rest assured. I shall repay your loan.\"", "ans": ["He assured her that he would repay her loan.", "He told her that he would repay her loan.", "He said that he might repay her loan.", "He told her not to worry about the repayment of her loan."], "correct": "He assured her that he would repay her loan.", "solution": "He assured her that he would repay her loan."}, {"qText": "Kiran asked me, \"Did you see the cricket match on television last night?\"", "ans": ["Kiran asked me whether I saw the cricket match on television the earlier night.", "Kiran asked me whether I had seen the cricket match on television the earlier night.", "Kiran asked me did I see the cricket match on television last night.", "Kiran asked me whether I had seen the cricket match on television last night."], "correct": "Kiran asked me whether I had seen the cricket match on television the earlier night.", "solution": "Kiran asked me whether I had seen the cricket match on television the earlier night."}, {"qText": "\"I finished it several days ago,\" said Jack.", "ans": ["Jack said that he had finished it several days earlier.", "Jack said that he finished it several days earlier.", "Jack said that he finish it several days ago.", "Jack said that he finished it several days previously."], "correct": "Jack said that he had finished it several days earlier.", "solution": "Jack said that he had finished it several days earlier."}, {"qText": "\"Where will you be tomorrow,\" I said, \"in case I have to ring you?\"", "ans": ["I asked where you will be the next day in case I will ring him.", "I asked where he would be the next day in case I had to ring him.", "I said to him where he will be in case I have to ring him.", "I enquired about his whereabouts the next day in case I would have to ring up."], "correct": "I asked where he would be the next day in case I had to ring him.", "solution": "I asked where he would be the next day in case I had to ring him."}, {"qText": "\"You can't bathe in this sea,\" he said to me, \"it's very rough.\"", "ans": ["He said that I can't bathe in this sea because it's very rough.", "He said that you couldn't bathe in that sea if it was very rough.", "He said that I couldn't bathe in that sea as it was very rough.", "He said that you can't bathe in this sea since it was very rough."], "correct": "He said that I couldn't bathe in that sea as it was very rough.", "solution": "He said that I couldn't bathe in that sea as it was very rough."}, {"qText": "\"I don't know why they haven't signed the papers and accepted the gift,\" said Crene to me.", "ans": ["Crene told me that he didn't know why they hadn't signed the papers and accepted the gift.", "Crene told me that he don't know why they haven't signed the papers and accepted the gift.", "Crene told me that I don't know why they haven't signed the papers and accepted the gift.", "Crene said to me that he didn't know why they hadn't signed the papers and accepted the gift."], "correct": "Crene told me that he didn't know why they hadn't signed the papers and accepted the gift.", "solution": "Crene told me that he didn't know why they hadn't signed the papers and accepted the gift."}, {"qText": "The teacher said, \"Boys, what do you understand by this phrase ?\"", "ans": ["The teacher asked the boys what they understood by that phrase.", "The teacher asked the boys what they understood by this phrase.", "The teacher asked the boys what they understand by this phrase.", "The teacher asked the boys what they understand by that phrase."], "correct": "The teacher asked the boys what they understood by that phrase.", "solution": "The teacher asked the boys what they understood by that phrase."}, {"qText": "\"I have to go into the town today\", Mr. Rao said to the Station Master.", "ans": ["Mr. Rao told the Station Master that he had to go into the town that day.", "Mr. Rao advised the Station Master that he had to go into the town that day.", "Mr. Rao spoke to the Station Master that he had to go into the town that day.", "Mr. Rao told the Station Master that he would go into the town that day."], "correct": "Mr. Rao told the Station Master that he had to go into the town that day.", "solution": "Mr. Rao told the Station Master that he had to go into the town that day."}, {"qText": "Mother said to the baby, \"Don't play with fire\".", "ans": ["Mother warned the baby to play with fire.", "Mother warned the baby not to play with fire.", "Mother forbade the baby not to play with fire.", "Mother requested the baby not to play with fire."], "correct": "Mother warned the baby not to play with fire.", "solution": "Mother warned the baby not to play with fire."}, {"qText": "\"Do you know anything about Robots, Sonu?\" said Meeta.", "ans": ["Meeta asked Sonu whether he knows anything about Robots.", "Meeta asked Sonu if he know anything about Robots.", "Meeta asked Sonu if he had known anything about Robots", "Meeta asked Sonu if he knew anything about Robots."], "correct": "Meeta asked Sonu if he knew anything about Robots.", "solution": "Meeta asked Sonu if he knew anything about Robots."}, {"qText": "David said to Anna, \"Mona will leave for her native place tomorrow.\"", "ans": ["David told Anna that Mona will leave for her native place tomorrow.", "David told Anna that Mona left for her native place the next day.", "David told to Anna that Mona would be leaving for her native place tomorrow.", "David told Anna that Mona would leave for her native place the next day."], "correct": "David told Anna that Mona would leave for her native place the next day.", "solution": "David told Anna that Mona would leave for her native place the next day."}, {"qText": "He said to me, \"I have often told you not to play with fire.\"", "ans": ["He said that he has often been telling me not to play with fire.", "He told me that he had often told me not to play with fire.", "He reminded me that he often said to me not to play with fire.", "He said to me that he often told me not to play with fire."], "correct": "He told me that he had often told me not to play with fire.", "solution": "He told me that he had often told me not to play with fire."}, {"qText": "Seeta said to me, \"Can you give me your pen?\"", "ans": ["Seeta asked me can I give her my pen.", "Seeta asked me if I can give me your pen.", "Seeta asked me if I could give her my pen.", "Seeta asked me if I gave her my pen."], "correct": "Seeta asked me if I could give her my pen.", "solution": "Seeta asked me if I could give her my pen."}, {"qText": "She said, \"I must have a computer to computer to prepare a powerpoint presentation.\"\n", "ans": ["She said that she had to have a computer to prepare a powerpoint presentation.", "She said that she should have a computer to prepare a powerpoint presentation.", "She said that she would have a computer to prepare a powerpoint presentation.", "She said that she could have a computer to prepare a powerpoint presentation."], "correct": "She said that she had to have a computer to prepare a powerpoint presentation.", "solution": "She said that she had to have a computer to prepare a powerpoint presentation."}, {"qText": "The teacher said, \"Why can't you come to school on time, Reema ?\"", "ans": ["The teacher asked Reema why she can't come to school on time.", "The teacher asked Reema why can't she come to school on time.", "The teacher asked Reema why couldn't she come to school on time.", "The teacher asked Reema why she couldn't come to school on time."], "correct": "The teacher asked Reema why she couldn't come to school on time.", "solution": "The teacher asked Reema why she couldn't come to school on time."}, {"qText": "'I'll take a quick nap here in this soft grass', said the hare.", "ans": ["The hare said that he would take a quick nap here in this soft grass.", "The hare said that he would take a quick nap there in that soft grass.", "The hare said he will take a quick nap here in this soft grass.", "The hare said that I will take a quick nap here in this soft grass."], "correct": "The hare said that he would take a quick nap there in that soft grass.", "solution": "The hare said that he would take a quick nap there in that soft grass."}, {"qText": "\"Leave the room at once Ravi\", he shouted.", "ans": ["He ordered Ravi to leave the room at once.", "He forbade Ravi to leave the room at once.", "He suggested that Ravi should leave the room at once.", "He requested Ravi to leave the room at once."], "correct": "He ordered Ravi to leave the room at once.", "solution": "He ordered Ravi to leave the room at once."}, {"qText": "\"Please bring me a glass of water\", she said to me.", "ans": ["She requested to bring her a glass of water.", "She requested me brought her a glass of water.", "She requested me to bring her a glass of water.", "She requested me that bring her a glass of water."], "correct": "She requested me to bring her a glass of water.", "solution": "She requested me to bring her a glass of water."}, {"qText": "I said to him, \"Why are you working so hard?\"", "ans": ["I asked him why he was working so hard.", "I asked him why was he working so hard.", "I asked him why he had been working so hard.", "I asked him why had he been working so hard."], "correct": "I asked him why he was working so hard.", "solution": "I asked him why he was working so hard."}, {"qText": "Walter said, 'I cannot do it now.'", "ans": ["Walter says that he cannot do it then.", "Walter says that he could not do it now.", "Walter says that he cannot do it now.", "Walter said that he could not do it then."], "correct": "Walter said that he could not do it then.", "solution": "Walter said that he could not do it then."}, {"qText": "The father warned his son that he should be beware of him.", "ans": ["The father warned his son, \"Beware of him!\"", "The father warned his son, \"Watch that chap!\"", "The father warned his son, \"Be careful about him.\"", "The father warned his son, \"Don't fall into the trap.\""], "correct": "The father warned his son, \"Beware of him!\"", "solution": "The father warned his son, \"Beware of him!\""}, {"qText": "Rohit asked me, \"Have you read this novel?\"", "ans": ["Rohit asked me if I had read that novel.", "Rohit asked me if I could read this novel.", "Rohit asked me if I would have read that novel.", "Rohit asked me if I was reading that novel."], "correct": "Rohit asked me if I had read that novel.", "solution": "Rohit asked me if I had read that novel."}, {"qText": "The passenger said to the clerk, \" When is the next train to Hyderabad?\"", "ans": ["The passenger asked the clerk when the next train to Hyderabad was.", "The passenger enquired the clerk that when the next train was to Hyderabad.", "The passenger enquired the clerk that when was the next train to Hyderabad.", "The passenger enquired the clerk when was the next train to Hyderabad."], "correct": "The passenger asked the clerk when the next train to Hyderabad was.", "solution": "The passenger asked the clerk when the next train to Hyderabad was."}, {"qText": "My mother said to me, \"Where are you going at this time of the day?\"", "ans": ["My mother asked me where I was going at that time of the day.", "My mother told me where I was going at that time of the day.", "My mother told me not to go at that time of the day.", "My mother asked me where was I going at that time of the day."], "correct": "My mother asked me where I was going at that time of the day.", "solution": "My mother asked me where I was going at that time of the day."}, {"qText": "They said to him, \"We shall visit your house tomorrow\".", "ans": ["They said that they will go to his house the next day.", "They expressed a desire to visit his house the next day.", "They told him that they might visit his house the next day.", "They told him that they would visit his house the next day."], "correct": "They told him that they would visit his house the next day.", "solution": "They told him that they would visit his house the next day."}, {"qText": "The gardener said to the boys, \"Do not pluck the flowers\".", "ans": ["The gardener said to the boys that they should not pluck flowers.", "The gardener forbade the boys to pluck the flowers.", "The gardener told the boys that they should not pluck flowers.", "The gardener scolded the boys for plucking flowers."], "correct": "The gardener forbade the boys to pluck the flowers.", "solution": "The gardener forbade the boys to pluck the flowers."}, {"qText": "He said to her, \"What a cold day!\"", "ans": ["He told her that it was a cold day.", "He exclaimed that it was a cold day.", "He exclaimed sorrowfully that it was a cold day.", "He exclaimed that it was a very cold day."], "correct": "He exclaimed that it was a very cold day.", "solution": "He exclaimed that it was a very cold day."}, {"qText": "Pawan said to me, \"If I hear any news, I'll phone you.\"", "ans": ["Pawan told me that if he heard any news, he will phone me.", "Pawan told me that if he will hear any news, he will phone me.", "Pawan told me if he had heard any news, he, would phone me.", "Pawan told me that if he heard any news, he would phone me."], "correct": "Pawan told me that if he heard any news, he would phone me.", "solution": "Pawan told me that if he heard any news, he would phone me."}, {"qText": "Farhan asked Geeta, \"Could you lend me a hundred rupees until tomorrow?\"", "ans": ["Farhan asked Geeta whether she could lend him a hundred rupees until tomorrow.", "Farhan asked Geeta whether she could lend him a hundred rupees until the next day.", "Farhan asked Geeta whether she could lend me a hundred rupees until the next day.", "Farhan asked whether Geeta could lend me a hundred rupees until the next day."], "correct": "Farhan asked Geeta whether she could lend him a hundred rupees until the next day.", "solution": "Farhan asked Geeta whether she could lend him a hundred rupees until the next day."}, {"qText": "\"Who was the first man to fly in space?\" questioned the examiner.", "ans": ["The examiner asked who the first man to fly in space was.", "The examiner asked about the first man to fly in space.", "The examiner questioned about the first man to fly in space.", "The examiner asked who was the first man to fly in space."], "correct": "The examiner asked who the first man to fly in space was.", "solution": "The examiner asked who the first man to fly in space was."}, {"qText": "The patient asked the doctor what he should normally eat.", "ans": ["The patient exclaimed, \"What should I normally eat, doctor?\"", "The patient said, \"What I should normally eat doctor?\"", "The patient told,\"What should I normally eat?\"", "The patient said, \"What should I normally eat doctor?\""], "correct": "The patient said, \"What should I normally eat doctor?\"", "solution": "The patient said, \"What should I normally eat doctor?\""}, {"qText": "He said, \"Oh, that I had the wings of a bird\".", "ans": ["He proposed to have the wrings of a bird.", "He wished that he might have the wings of a bird.", "He wished that he could have the wings of a bird.", "He wished that he had the wings of a bird."], "correct": "He wished that he had the wings of a bird.", "solution": "He wished that he had the wings of a bird."}, {"qText": "\"Are we never to meet?\" Amit asked him.", "ans": ["Amit questioned him whether they were ever to be meet.", "Amit wondered whether they are never to meet.", "Amit said whether they were never to meet.", "Amit asked him whether they were never to meet."], "correct": "Amit asked him whether they were never to meet.", "solution": "Amit asked him whether they were never to meet."}, {"qText": "The teacher said, \"Surabhi, where are you going to spend your summer break.", "ans": ["The teacher asked Surabhi where she is going to spend her summer break.", "The teacher asked Surabhi where was she going to spend her summer break.", "The teacher asked to Surabhi where she was going to spend her summer break.", "The teacher asked Surabhi where she was going to spend her summer break."], "correct": "The teacher asked Surabhi where she was going to spend her summer break.", "solution": "The teacher asked Surabhi where she was going to spend her summer break."}, {"qText": "The tailor said to him, \"Will you have the suit ready by tomorrow evening?\"", "ans": ["The tailor asked him that he will have the suit ready by the next evening.", "The tailor asked him that he would had the suit ready by the next evening.", "The tailor asked him if he would have the suit ready by the next evening.", "The tailor asked him if he will like to have the suit ready by the next evening."], "correct": "The tailor asked him if he would have the suit ready by the next evening.", "solution": "The tailor asked him if he would have the suit ready by the next evening."}, {"qText": "The teacher said to Mahesh,\"Congratulations! Wish you success in life.\"", "ans": ["The teacher congratulated Mahesh and said wish you success in life.", "The teacher wished congratulations and success in life to Mahesh.", "The teacher said congratulations to Mahesh and wished him success in life.", "The teacher congratulated Mahesh and wished him success in life."], "correct": "The teacher congratulated Mahesh and wished him success in life.", "solution": "The teacher congratulated Mahesh and wished him success in life."}, {"qText": "Manna asked Rohan, \"Have you sat in a trolley bus before?\"", "ans": ["Manna asked Rohan whether he had sat in a trolley bus earlier.", "Manna asked Rohan had he sat in a trolley bus before.", "Manna asked Rohan if he sat on a trolley bus before.", "Manna asked Rohan if he has ever sat in a trolley bus."], "correct": "Manna asked Rohan whether he had sat in a trolley bus earlier.", "solution": "Manna asked Rohan whether he had sat in a trolley bus earlier."}, {"qText": "He said, \"I had a wonderful dream last night\".", "ans": ["He said that he saw a wonderful dream last night.", "He said that last night he had a wonderful dream.", "He said that he had had a wonderful dream the previous night.", "He said that he had seen a wonderful dream yesterday."], "correct": "He said that he had had a wonderful dream the previous night.", "solution": "He said that he had a wonderful dream the previous night."}, {"qText": "\"I gave the packet to Tom,who kept it a long time,\" said Pamela.", "ans": ["Pamela said that she had gave the packet to Tom who kept it a long time.", "Pamela said that she had given the packet to Tom,who kept it a long time.", "Pamela said that she had given the packet to Tom,who kept it for longtime", "Pamela said that she had given the packet to Tom, to keep for a long time."], "correct": "Pamela said that she had given the packet to Tom,who kept it a long time.", "solution": "Pamela said that she had given the packet to Tom,who kept it a long time."}, {"qText": "The master said that he would see me the next day.", "ans": ["\"You will be seen by me tomorrow,\"said the master.", "\"Tomorrow, I will see you,\" says the master.", "\"I will be seeing you tomorrow,\" said the master.", "\"I will see you tomorrow,\" said the master."], "correct": "\"I will see you tomorrow,\" said the master.", "solution": "\"I will see you tomorrow,\" said the master."}, {"qText": "I said to the boy,\"You have no ticket, get out before you are driven out.\"", "ans": ["I told the boy get out before you are driven out.", "I told the boy to get out before he was driven out as he had no ticket.", "I ordered the boy to get out before he was driven out.", "I told the boy that he had no ticket and that he should get out before he was driven out."], "correct": "I told the boy to get out before he was driven out as he had no ticket.", "solution": "I told the boy to get out before he was driven out as he had no ticket."}, {"qText": "He said to me, 'What are you doing?\"", "ans": ["He asked me what I was doing.", "He asked me what am I doing.", "He said to me what I was doing.", "He asked me what I am doing."], "correct": "He asked me what I was doing.", "solution": "He asked me what I was doing."}, {"qText": "She said,\"Mother,please cook me something nice today\".", "ans": ["She told her mother to cook her something nice today.", "She ordered her mother to cook her something nice that day.", "She requested her mother to cook her something nice that day.", "She asked her mother if she could cook her something nice that day."], "correct": "She requested her mother to cook her something nice that day.", "solution": "She requested her mother to cook her something nice that day."}, {"qText": "\"Have you done this sort of work before?\" said his new employer", "ans": ["His new employer asked him whether he has done that sort of work before.", "His new employer asked him whether he has done this sort of work before.", "His new employer asked him whether he had done that sort of work before.", "His new employer asked him whether he had done this sort of work before."], "correct": "His new employer asked him whether he had done that sort of work before.", "solution": "His new employer asked him whether he had done that sort of work before."}, {"qText": "The old lady declared that she was going to walk where she pleased. They had the liberty.", "ans": ["The old lady said that, \"I was going to walk where I pleased. They have the liberty\".", "The old lady: \"I am going to walk where I please. We have the liberty\".", "The old lady:\"I was going to walk where I pleased. They have the liberty\".", "The old lady: \"I am going to walk where I pleased. They had the liberty.\""], "correct": "The old lady: \"I am going to walk where I please. We have the liberty\".", "solution": "The old lady: \"I am going to walk where I please. We have the liberty\"."}, {"qText": "She said to me, \"I'm going shopping. Can I get you something?\"", "ans": ["She said she was going shopping and said to me if I wanted something.", "She said she was going shopping and asked as if I wanted something.", "She said she was going shopping and asked if she could get me something.", "She said she is going shopping and asked if she could get me something."], "correct": "She said she was going shopping and asked if she could get me something.", "solution": "She said she was going shopping and asked if she could get me something."}, {"qText": "He welcomed me to his house.", "ans": ["He said, \"Welcome to my house.\"", "He said, \"Welcome home.\"", "He said, \"Please come in.\"", "He said, \"You are welcomed here!\""], "correct": "He said, \"Welcome to my house.\"", "solution": "He said, \"Welcome to my house.\""}, {"qText": "He looked at the sky and said, \"How beautifully the clouds are floating!\"", "ans": ["He looked at the sky and exclaimed with joy that the clouds were floating beautifully.", "Looking at the sky he told that the clouds are floating beautifully.", "He looked at the sky and said that the clouds very beautifully are floating.", "He looked at the sky and said that the floating clouds are beautiful."], "correct": "He looked at the sky and exclaimed with joy that the clouds were floating beautifully.", "solution": "He looked at the sky and exclaimed with joy that the clouds were floating beautifully."}, {"qText": "Ram asked me, \"How much have you paid for this umbrella?\"", "ans": ["Ram asked me how much he had paid for that umbrella.", "Ram asked me whether how much I had paid for that umbrella.", "Ram asked me how much I had paid for that umbrella.", "Ram asked me how much 1 have paid for that umbrella."], "correct": "Ram asked me how much I had paid for that umbrella.", "solution": "Ram asked me how much I had paid for that umbrella."}, {"qText": "He asked me why I did not come on time the previous day.", "ans": ["He said to me, \"Why didn't I come on time yesterday?\"", "He asked me, \"Why didn't you come on time the previous day?\"", "He asked me, \"Why you didn't come on time yesterday?\"", "He asked me, \"Why didn't you come on time yesterday?\""], "correct": "He asked me, \"Why didn't you come on time yesterday?\"", "solution": "He asked me, \"Why didn't you come on time yesterday?\""}, {"qText": "He said, \"I shall go as soon as it is possible.\"", "ans": ["He said that he would go as soon as it was possible.", "He told he will go as soon as possible.", "He asked whether to go as soon as it was possible.", "He suggested that he will go as soon as it was possible."], "correct": "He said that he would go as soon as it was possible.", "solution": "He said that he would go as soon as it was possible."}, {"qText": "He said, \"Asha washed the clothes.\"", "ans": ["He said that Asha washed the clothes.", "He said that clothes were washed by Asha.", "He said that Asha had washed the clothes.", "He said that Asha has washed the clothes."], "correct": "He said that Asha had washed the clothes.", "solution": "He said that Asha had washed the clothes."}, {"qText": "I said to her, \"I will have written letters.\"", "ans": ["I told her that she will have written letters.", "I told her that she would have written letters.", "I told her that I will have written letters.", "I told her that I would have written letters."], "correct": "I told her that I would have written letters.", "solution": "I told her that I would have written letters."}, {"qText": "Monica Cheng asked Roeun, \"Are you going to visit Germany?", "ans": ["Monica Cheng asked Roeun if he is going to visit Germany.", "Monica Cheng asked Roeun if he had visited Germany.", "Monica Cheng asked Roeun if had gone to Germany.", "Monica Cheng asked Roeun if he was going to visit Germany."], "correct": "Monica Cheng asked Roeun if he was going to visit Germany.", "solution": "Monica Cheng asked Roeun if he was going to visit Germany."}, {"qText": "He said, \"I am buying a new pen\".", "ans": ["He said that he bought a new pen.", "He said that he had been buying a new pen.", "He said that he is buying a new pen.", "He said that he was buying a new pen."], "correct": "He said that he was buying a new pen.", "solution": "He said that he was buying a new pen."}, {"qText": "\"I was digging the garden when the doctor arrived,\" replied Harry.", "ans": ["Harry said that he was digging the garden when the doctor arrived.", "Harry said that he had been digging the garden when the doctor arrive.", "Harry says that he was digging the garden when the doctor arrived.", "Harry said that he had been digging the garden when the doctor arrived."], "correct": "Harry said that he had been digging the garden when the doctor arrived.", "solution": "Harry said that he had been digging the garden when the doctor arrived."}, {"qText": "Father told Peter to clean his shoes.", "ans": ["\"Clean your shoes, Peter,\" says father.", "\"Clean your shoes, Peter,\" said father.", "\"Clean your shoes, Peter,\" reported father.", "\"Clean your shoes, Peter,\" told father."], "correct": "\"Clean your shoes, Peter,\" said father.", "solution": "\"Clean your shoes, Peter,\" said father."}, {"qText": "Amelia is going to ask the principal for permission to go on a study tour.", "ans": ["Amelia is going to say to the principal, \"Might we have your permission to go on a study tour?\"", "Amelia is going to say to the principal, \"Should we have your permission to go on a study tour?\"", "Amelia is going to say to the principal, \"May we have your permission to go on a study tour?\"", "Amelia is going to say to the principal, \"Would we have your permission to go on a study tour?\""], "correct": "Amelia is going to say to the principal, \"May we have your permission to go on a study tour?\"", "solution": "Amelia is going to say to the principal, \"May we have your permission to go on a study tour?\""}, {"qText": "The Technician told us how to maintain the machines in good working order.", "ans": ["The technician said to us, \"There is how you maintained the machine in good working order.\"", "The technician said \"This is how you maintain the machine in good working order.\"", "The technician said to us, \"That is how you maintained the machine in good working order.\"", "The technician said to us, \"This is how you maintained the machine in good working order.\""], "correct": "The technician said \"This is how you maintain the machine in good working order.\"", "solution": "The technician said \"This is how you maintain the machine in good working order.\""}, {"qText": "John said, \"I shall be 21 tomorrow\".", "ans": ["John said that he would be 21 tomorrow.", "John said that he would be 21 the following day.", "John said that he should be 21 the following day.", "John said that I shall be 21 tomorrow."], "correct": "John said that he would be 21 the following day.", "solution": "John said that he would be 21 the following day."}, {"qText": "Rahul says that Azhar loves cricket.", "ans": ["Rahul said, \"Azhar loves cricket\".", "Rahul said, \"Azhar loved cricket\".", "Rahul says, \"Azhar loved cricket\".", "Rahul says, \"Azhar loves cricket\"."], "correct": "Rahul says, \"Azhar loves cricket\".", "solution": "Rahul says, \"Azhar loves cricket\"."}, {"qText": "The teacher asked me why I had been absent the day before.", "ans": ["The teacher asked me, \"Why were you absent yesterday?\"", "The teacher asked me, \"Why are you absent yesterday?\"", "The teacher asked me, \"Why are you absent the day before?\"", "The teacher asked me, \"Were you absent the day before?\""], "correct": "The teacher asked me, \"Why were you absent yesterday?\"", "solution": "The teacher asked me, \"Why were you absent yesterday?\""}, {"qText": "Ramesh informed his friend that he could make use of his car while he was away.", "ans": ["Ramesh said to his friend, \"You will make use of my car while I was away\".", "Ramesh said to his friend, \"Use my car while I go away\".", "Ramesh said to his friend, \"you can make use of my car while I am away\".", "Ramesh asked his friend, \"Will you make use of my car while I am away?\""], "correct": "Ramesh said to his friend, \"you can make use of my car while I am away\".", "solution": "Ramesh said to his friend, \"you can make use of my car while I am away\"."}, {"qText": "Vinay told me that he had been writing a letter the day before.", "ans": ["Vinay said, \"I will write a letter today.\"", "Vinay said, \"I will write a letter tomorrow.\"", "Vinay said, \"I was writing a letter yesterday.\"", "Vinay said, \"I had been writing a letter yesterday. \""], "correct": "Vinay said, \"I was writing a letter yesterday.\"", "solution": "Vinay said, \"I was writing a letter yesterday.\""}, {"qText": "\"Who's the conductor of this bus?\" he said, and paused for a reply.", "ans": ["He said who the conductor of that bus was and paused for a reply.", "He asked who was the conductor of that bus and paused for a reply.", "He asked whether who the conductor of that bus was and paused for a reply.", "He asked who the conductor of that bus was and paused for a reply."], "correct": "He asked who was the conductor of that bus and paused for a reply.", "solution": "He asked who was the conductor of that bus and paused for a reply."}, {"qText": "\"We'll go for an outing tomorrow,\" said Laila's father, \"so you had better complete your homework this evening.\"", "ans": ["Laila's father told her to complete her homework that evening as they would be going for an outing the next day.", "Laila's father told her to complete her homework this evening as they would be going for an outing the next day.", "Laila's father tells her to complete her homework this evening as they would be going for an outing the next day.", "Laila's father had told her to complete her homework that evening as they would be going for an outing the next day."], "correct": "Laila's father told her to complete her homework that evening as they would be going for an outing the next day.", "solution": "Laila's father told her to complete her homework that evening as they would be going for an outing the next day."}, {"qText": "I said to the boy, \"Will you step with me into the garden?\"", "ans": ["I asked the boy if he would step with me into the garden.", "I said to the boy if he would step with me in the garden.", "I said to the boy if he would like to step with me in the garden.", "I requested the boy to step with me in the garden."], "correct": "I asked the boy if he would step with me into the garden.", "solution": "I asked the boy if he would step with me into the garden."}, {"qText": "He said to us, \"What did he have last night?\"", "ans": ["He inquired of us what had he have last night.", "He asked us what he had had the previous night.", "He asked us that what did he have the previous night.", "He asked us what had he had the last night."], "correct": "He asked us what he had had the previous night.", "solution": "He asked us what he had had the previous night."}, {"qText": "Martha said, \"I am going to Mexico next year.\"", "ans": ["Martha said that she had been going to Mexico next year.", "Martha said that she was going to Mexico next year.", "Martha said that she had gone to Mexico next year.", "Martha said that she will be going to Mexico next year."], "correct": "Martha said that she was going to Mexico next year.", "solution": "Martha said that she was going to Mexico next year."}, {"qText": "I asked him, \"Will you go to Agra tomorrow?\"", "ans": ["I asked him whether I would go to Agra the next day.", "I asked him whether he would go to Agra the next day.", "I asked him whether you would go to Agra the next day.", "I asked him whether he will go to Agra the next day."], "correct": "I asked him whether he would go to Agra the next day.", "solution": "I asked him whether he would go to Agra the next day."}, {"qText": "You said to me, \"I am going to America\".", "ans": ["You told me that I was going to to America.", "You said me that you were going to America.", "You told me that you were going to America.", "You told me I was going to America."], "correct": "You told me that you were going to America.", "solution": "You told me that you were going to America."}, {"qText": "He bade his love goodbye.", "ans": ["He said, \"Goodbye\".", "He exclaimed, \"Goodbye, love\".", "He said, \"Goodbye, my love\".", "He wished his love, \"Goodbye\"."], "correct": "He said, \"Goodbye, my love\".", "solution": "He said, \"Goodbye, my love\"."}, {"qText": "\"I would have been surprised if you had passed examination,\" said the former master.", "ans": ["The former master said that it would have surprised him if I had passed.", "The former master said that he should be surprised if I had passed.", "The former master said that he would have been surprised if I had passed the examination.", "The former master was surprised if I passed the examination."], "correct": "The former master said that he would have been surprised if I had passed the examination.", "solution": "The former master said that he would have been surprised if I had passed the examination."}, {"qText": "The girl said, \"How happy I am!\"", "ans": ["The girl exclaimed that she is very happy.", "The girl said that she is very happy.", "The girl exclaimed that she was very happy.", "The girl said how happy she was."], "correct": "The girl exclaimed that she was very happy.", "solution": "The girl exclaimed that she was very happy."}, {"qText": "Janet exclaimed that she had lost all her belongings at the airport that morning.", "ans": ["Janet said, \"I had to lose all my belongings at the airport this morning.\"", "Janet said, \"I lost all my belongings at the airport that morning.\"", "Janet said, \"I had lost all my belongings at the airport that morning.\"", "Janet said, \"I lost all my belongings at the airport this morning.\""], "correct": "Janet said, \"I lost all my belongings at the airport this morning.\"", "solution": "Janet said, \"I lost all my belongings at the airport this morning.\""}, {"qText": "He said to me, \"You need not worry.\"", "ans": ["He said to me that he need not worry.", "He told me that I shall need not worry.", "He said to me that you need not worry.", "He assured me that I need not worry."], "correct": "He assured me that I need not worry.", "solution": "He assured me that I need not worry."}, {"qText": "She asked, \"Is the secretary coming to the meeting?\"", "ans": ["She asked that the secretary was corning to the meeting.", "She asked that if the secretary was coming to the meeting.", "She asked if the secretary is coming to the meeting.", "She asked if the secretary was corning to the meeting."], "correct": "She asked if the secretary was corning to the meeting.", "solution": "She asked if the secretary was corning to the meeting."}, {"qText": "\"I came home last night\", said he.", "ans": ["He told that he had come home last night.", "He said that he came home last night.", "He said that he had come home the previous night.", "He says that he came home the previous night."], "correct": "He said that he had come home the previous night.", "solution": "He said that he had come home the previous night."}, {"qText": "Mr Robinson asked his son what he wanted to be when he grew up.", "ans": ["\"My son,\" said Mr Robinson,\"what will you be when you grow up?\"", "\"My son,\" said Mr Robinson, \"what do you want to be when you grow up?\"", "Mr Robinson said, \"My son, what did you want to be when you grew up?\"", "Mr Robinson said,\"My son,what would you be when you grow up?\""], "correct": "\"My son,\" said Mr Robinson, \"what do you want to be when you grow up?\"", "solution": "\"My son,\" said Mr Robinson, \"what do you want to be when you grow up?\""}, {"qText": "Kala said to Radha, \"who were you speaking to over the phone?\"", "ans": ["Kala asked Radha who she had been speaking to over the phone.", "Kala asked Radha who she has been speaking to over the phone.", "Kala asked Radha that who she was speaking to over the phone.", "Kala asked Radha that who she had been speaking to over the phone."], "correct": "Kala asked Radha who she had been speaking to over the phone.", "solution": "In changing a direct speech sentence to indirect speech, it's important to understand the rules for reported speech, which include changes in pronouns, tense, and word order. In the given sentence, Kala asked Radha about a past event.\nHere's how the conversion works:\nThe direct speech sentence is: \"Kala said to Radha, 'who were you speaking to over the phone?'\"\nIn indirect speech, you need to report what was said, which includes changes in tense and pronoun:\n\"who\" becomes \"who she\"\n\"were\" becomes \"had been\"\nSo, the correct transformation is: \"Kala asked Radha who she had been speaking to over the phone.\""}, {"qText": "Tanishq asked whether anyone had seen her pet.", "ans": ["Tanishq asked, \"Did you see my pet?\"", "Tanishq asked, \"Is the pet here?\"", "Tanishq asked, \"Has anyone seen my pet?\"", "Tanishq, \"Have you see any pet?\""], "correct": "Tanishq asked, \"Has anyone seen my pet?\"", "solution": "Tanishq asked, \"Has anyone seen my pet?\""}, {"qText": "She wanted to know whether butterflies drank water.", "ans": ["She wanted to know \"Do butterflies drink water?\"", "She asked, \"Do butterflies drink water?\"", "She asked, \"Did butterflies drank water?\"", "\"Does butterflies drinks water?\", she asked."], "correct": "She asked, \"Do butterflies drink water?\"", "solution": "She asked, \"Do butterflies drink water?\""}, {"qText": "My brother said that honesty is the best policy.", "ans": ["My brother said that, \"Honesty is the best policy.\"", "My brother told me, \"Honesty is the best policy.\"", "My brother said, \"Honesty was the best policy.\"", "My brother said, \"Honesty is the best policy.\""], "correct": "My brother said, \"Honesty is the best policy.\"", "solution": "My brother said, \"Honesty is the best policy.\""}, {"qText": "The Police Chief warned that more accidents would occur if people continued to disregard traffic rules.", "ans": ["The Police Chief said, \"More accidents will occur if people continue to disregard traffic rules.\"", "The Police Chief said, \"More accidents would occur if people continue to disregard traffic rules.\"", "The Police Chief said, \"Beware! More accident will occur if people continue to disregard traffic rules.\"", "The Police chief said, \"Beware! More accidents will occur if people continued to disregard traffic rules.\""], "correct": "The Police Chief said, \"Beware! More accident will occur if people continue to disregard traffic rules.\"", "solution": "The Police Chief said, \"Beware! More accident will occur if people continue to disregard traffic rules.\""}, {"qText": "\"Give yourself fifteen minutes and walk gently,\" Uncle Podger always said.", "ans": ["Uncle Podger always advised me to give myself fifteen minutes and walk gently.", "Uncle Podger always ordered me to take fifteen minutes and walk gently.", "Uncle Podger always requested me to take fifteen minutes and walk gently.", "Uncle Podger always asked me to take fifteen minutes and walk gently."], "correct": "Uncle Podger always advised me to give myself fifteen minutes and walk gently.", "solution": "Uncle Podger always advised me to give myself fifteen minutes and walk gently."}, {"qText": "My mother said to me, \"Wish you a happy and prosperous life!\"", "ans": ["My mother wished me a happy and prosperous life.", "My mother told me that I should lead a happy and prosperous life.", "My mother wished that I enjoy a happy and prosperous life.", "My mother wished that I should be living a happy and prosperous life."], "correct": "My mother wished me a happy and prosperous life.", "solution": "My mother wished me a happy and prosperous life."}, {"qText": "I asked him where he would stay.", "ans": ["I said to him, \"Where you will stay?\"", "I asked him, \"Where will you stay?\"", "I said to him, \"Where I will stay?\"", "I said to him, \"Where will I stay?\""], "correct": "I asked him, \"Where will you stay?\"", "solution": "I asked him, \"Where will you stay?\""}, {"qText": "You said to me, \"She is my sister\".", "ans": ["You said to me that she was my sister.", "You told me that she was your sister.", "You said to me that I was her sister.", "You said to me that she is my sister."], "correct": "You told me that she was your sister.", "solution": "In changing the given sentence from direct speech to indirect speech, we need to follow the rules of reported speech. Here, the reporting verb is \"said to,\" and we need to adjust the sentence accordingly:\nThe original sentence is in direct speech: \"You said to me, 'She is my sister.'\"\nIn indirect speech, the reporting verb \"said to\" is changed to \"told,\" and the pronoun references need to be adjusted to reflect the perspective of the speaker. Here, \"you\" changes to \"me\" and \"my\" changes to \"your\":\nSo, the correct transformation is: Option B: You told me that she was your sister."}, {"qText": "\"You did not return your book yesterday,\" said the librarian.", "ans": ["The librarian said that he had not returned his book the previous day.", "The librarian said the book not been returned the previous day.", "The librarian said that you had not returned you book yesterday.", "The librarian said that he had not returned his book yesterday."], "correct": "The librarian said that he had not returned his book the previous day.", "solution": "The librarian said that he had not returned his book the previous day."}, {"qText": "\"I will put this key here,\" said the caretaker.", "ans": ["The caretaker says that he would put the key there.", "The caretaker said that he would put the key there.", "The caretaker says that he would put the key here.", "The caretaker said that he will put the key there."], "correct": "The caretaker said that he would put the key there.", "solution": "The caretaker said that he would put the key there."}, {"qText": "Mohan says that the teacher is not at home.", "ans": ["Mohan said, \"Teacher is not at home.\"", "Mohan says, \"Teacher is not at home.\"", "Mohan says,\"Teacher was not at home.\"", "Mohan said, \"Teacher was not at home.\""], "correct": "Mohan says, \"Teacher is not at home.\"", "solution": "Mohan says, \"Teacher is not at home.\""}, {"qText": "Thomas said that he would meet Andy the following Monday and asked if 1 O'clock suited him.", "ans": ["Thomas said to Andy, \"I will meet you the next Monday. Will 1 O'clock suit you?\"", "Thomas said to Andy, \"Andy, I am going to meet you the following Monday. Does 1 O'clock suit you?\"", "Thomas said to Andy,\"Andy,I will have to meet you the following Monday. Is 1 O'clock suiting you?\"", "Thomas said to Andy, \"Andy, I would meet you the following Monday. Will 1 O'clock suit you?\""], "correct": "Thomas said to Andy, \"I will meet you the next Monday. Will 1 O'clock suit you?\"", "solution": "Thomas said to Andy, \"I will meet you the next Monday. Will 1 O'clock suit you?\""}, {"qText": "She said to me, \"It has been raining heavily and you cannot go\".", "ans": ["She told me that it had been raining heavily and I could not go.", "She told me that it was raining heavily and I could not go.", "She told me that it has been raining heavily and I could not go.", "She told me that it is raining heavily and I could not go."], "correct": "She told me that it had been raining heavily and I could not go.", "solution": "She told me that it had been raining heavily and I could not go."}, {"qText": "The convict said, \"Let me speak freely please.\"", "ans": ["The convict suggested that he must be allowed to speak freely.", "The convict requested that he must be allowed to speak freely.", "The convict requested that he be allowed to speak freely.", "The convict proposed that he might be allowed to speak freely."], "correct": "The convict requested that he be allowed to speak freely.", "solution": "The convict requested that he be allowed to speak freely."}, {"qText": "The beggar said, \"Poverty is a great curse.\"", "ans": ["The beggar said poverty has a great curse.", "The beggar said that poverty is a great curse.", "The beggar said that poverty was a great curse.", "The beggar said that poverty had been a great curse."], "correct": "The beggar said that poverty is a great curse.", "solution": "The beggar said that poverty is a great curse."}, {"qText": "The boys respectfully wished their teacher good mornings.", "ans": ["\"Good morning,\" said the boys to their teacher.", "\"Good morning,\" said the boys to the teacher.", "\"Good morning,Madam,\" said the boys to the teacher.", "\"Good morning,Madam,\" said the boys to their teacher."], "correct": "\"Good morning,Madam,\" said the boys to their teacher.", "solution": "\"Good morning,Madam,\" said the boys to their teacher."}, {"qText": "The king said to his men, \"Do not be afraid of the enemy. Face them bravely.\"", "ans": ["The king ordered his men to not be afraid of the enemy and that they had to be faced bravely.", "The king asked his men to not be afraid of the enemy but they should be faced bravely.", "The king advised his men not to be afraid of the enemy but to face them bravely.", "The king told his men not to be afraid of the enemy and they had faced them bravely."], "correct": "The king advised his men not to be afraid of the enemy but to face them bravely.", "solution": "The king advised his men not to be afraid of the enemy but to face them bravely."}, {"qText": "Sitara asked me, \"Have you taken your laptop?\"", "ans": ["Sitara asked me in had taken the laptop.", "Sitara asked me if we had taken the laptop.", "Sitara asked me whether I had taken my laptop.", "Sitara asked me if suppose I have taken my laptop."], "correct": "Sitara asked me whether I had taken my laptop.", "solution": "Sitara asked me whether I had taken my laptop."}, {"qText": "\"I'm tired,\" he says every evening.", "ans": ["Every day in the evening he is getting tired.", "Every evening he says (that) he is tired.", "He is getting tired every evening.", "Every evening he says that he was getting tired."], "correct": "Every evening he says (that) he is tired.", "solution": "Every evening he says (that) he is tired."}, {"qText": "Baruch said, \"I might teach English Literature next semester.\"", "ans": ["Baruch said that he is going to teach English Literature next semester.", "Baruch said that he will teach English Literature next semester.", "Baruch said that he might teach English Literature next semester.", "Baruch said that he might be teaching English Literature next semester."], "correct": "Baruch said that he might teach English Literature next semester.", "solution": "Baruch said that he might teach English Literature next semester."}, {"qText": "The man said, \"What I give today I trust that tomorrow I shall be able to earn back.\"", "ans": ["The man said that what he gave that day he trusted he would be able to return the next day.", "The man said to give him his trust so that he would be able to earn back the next day.", "The man asked what to give that day as he trusted that the next day he would earn back.", "The man said that he trusted he would be able to earn back the next day what he gave that day."], "correct": "The man said that he trusted he would be able to earn back the next day what he gave that day.", "solution": "The man said that he trusted he would be able to earn back the next day what he gave that day."}, {"qText": "The project manager asked Vivek, \"How much time will you take to finish this project?\"", "ans": ["The project manager asked Vivek how much time would he take to finish that project.", "The project manager enquired of Vivek how much time he would take to finish that project.", "The project manager enquired of Vivek how much time he will be taking to finish that project.", "The project manager asked Vivek how much time he would take to finish this project."], "correct": "The project manager enquired of Vivek how much time he would take to finish that project.", "solution": "The project manager enquired of Vivek how much time he would take to finish that project."}, {"qText": "You said to me, \"Why are you talking so much?\"", "ans": ["You asked me why he was talking so much.", "You asked me why I was talking so much.", "You asked me why was I talking so much.", "You asked me why I had been talking so much."], "correct": "You asked me why I was talking so much.", "solution": "You asked me why I was talking so much."}, {"qText": "He said to his son, \"Do not smoke.\"", "ans": ["He advised his son do not smoke.", "He advised his son to not smoke.", "He advised his son not to smoke.", "He advised his son that he should not smoke."], "correct": "He advised his son not to smoke.", "solution": "He advised his son not to smoke."}, {"qText": "The Professor said, \"Have you cleared your last semester papers?\"", "ans": ["The Professor asked whether I cleared my last semester papers.", "The Professor asked if I had cleared my previous semester papers.", "The Professor asked whether I have cleared my last semester papers.", "The Professor asked if I have cleared my previous semester papers."], "correct": "The Professor asked if I had cleared my previous semester papers.", "solution": "The Professor asked if I had cleared my previous semester papers."}, {"qText": "\"You are all doing very well,\" said Mr. Jones.", "ans": ["Mr. Jones said that we are all doing well.", "Mr. Jones said that they were all doing very well.", "Mr. Jones said that you are all doing very well.", "Mr. Jones said that they were all doing well."], "correct": "Mr. Jones said that they were all doing very well.", "solution": "Mr. Jones said that they were all doing very well."}, {"qText": "\"I shall go tomorrow,\" he said.", "ans": ["He said that he would go the next day.", "He said that he should go tomorrow.", "He said that he would go tomorrow.", "He said that he shall go the next day."], "correct": "He said that he would go the next day.", "solution": "He said that he would go the next day."}, {"qText": "He said, \"I have done my job.\"", "ans": ["He said that he had been doing his job.", "He said that he had done his job.", "He said that he have done his job.", "He said that he has done his job."], "correct": "He said that he had done his job.", "solution": "He said that he had done his job."}, {"qText": "Sanda said that she used to know a lot of people in Delhi but I had few friends in Kolkata.", "ans": ["Sanda said, \"I had known a lot of people in Delhi but I had few friends in Kolkata.\"", "Sanda said, \"I have known a lot of people in Delhi but I had few friends in Kolkata.\"", "Sanda said, \"I used to know a lot of people in Delhi but I have fewer friends in Kolkata.\"", "Sanda said, \"I had got to know a lot of people in Delhi but I had few friends in Kolkata.\""], "correct": "Sanda said, \"I used to know a lot of people in Delhi but I have fewer friends in Kolkata.\"", "solution": "Sanda said, \"I used to know a lot of people in Delhi but I have fewer friends in Kolkata.\""}, {"qText": "John said to me, \"where have you been last night?\"", "ans": ["John asked me where had I been the previous night.", "John asked me where I have been the previous night.", "John asked me where I am the previous night.", "John asked me where I had been the previous night."], "correct": "John asked me where I had been the previous night.", "solution": "John asked me where I had been the previous night."}, {"qText": "Nisha told Monica, \"What a beautiful dress you are wearing!\"", "ans": ["Nisha exclaimed that Monica was wearing a very beautiful dress.", "Nisha exclaimed that it is a very beautiful dress.", "Nisha exclaimed that Monica is wearing a very beautiful dress.", "Nisha told Monica that was a beautiful dress."], "correct": "Nisha exclaimed that Monica was wearing a very beautiful dress.", "solution": "Nisha exclaimed that Monica was wearing a very beautiful dress."}, {"qText": "\"If you want to smoke,you'll have to go out\", said the conductor.", "ans": ["The conductor ordered me to go out and smoke.", "The conductor said that if i/he wanted to smoke, i/he would have to go out.", "The conductor told me that smoking is not permitted in the bus.", "The conductor told me that I will have to go out and smoke."], "correct": "The conductor said that if i/he wanted to smoke, i/he would have to go out.", "solution": "The conductor said that if i/he wanted to smoke, i/he would have to go out."}, {"qText": "She said, \"I am sorry, I am not able to submit those papers\".", "ans": ["She said she was sorry, she is not able to submit those papers.", "She said that she was sorry and she will not be able to submit those papers.", "She apologized for not being able to submit those papers.", "She exclaimed with sorrow that she was sorry and she will not be able to submit those papers."], "correct": "She apologized for not being able to submit those papers.", "solution": "She apologized for not being able to submit those papers."}, {"qText": "Kannan said to Subha, \"I'll return the book after I have read it.\"", "ans": ["Kannan told Subha that he will return the book after he has read it.", "Kannan told Subha that he would return the book after he has read it.", "Kannan told Subha that he will return the book after he read it.", "Kannan told Subha that he would return the book after he had read it."], "correct": "Kannan told Subha that he would return the book after he had read it.", "solution": "Kannan told Subha that he would return the book after he had read it."}, {"qText": "I said to her, \"Do you know how to dance?\"", "ans": ["I asked her if she does know dancing.", "I asked her if she had known how to dance.", "I asked her if she was known how to dance.", "I asked her if she knew how to dance."], "correct": "I asked her if she knew how to dance.", "solution": "I asked her if she knew how to dance."}, {"qText": "Radha said that the manager would go to Bombay the next day. ", "ans": ["Radha said, \"Our manager will go to Bombay tomorrow.\"", "Radha said, \"Our manager will be going to Bombay the next day.\"", "Radha said, \"Our manager might be going to Bombay the next day.\"", "Radha said, \"Our manager might go to Bombay tomorrow.\""], "correct": "Radha said, \"Our manager will go to Bombay tomorrow.\"", "solution": "Radha said, \"Our manager will go to Bombay tomorrow.\""}, {"qText": "The teacher said to me, \"What is your name?\"", "ans": ["The teacher told me what my name was.", "The teacher asked me what my name was.", "The teacher asked me what my name is.", "The teacher asked me what was my name."], "correct": "The teacher asked me what my name was.", "solution": "The teacher asked me what my name was."}, {"qText": "\"Call the first witness,\" said the judge.", "ans": ["The judge ordered that the first witness be called.", "The judge asked them to call the first witness.", "The judge requested them to call the first witness.", "The judge said to them to call the first witness."], "correct": "The judge asked them to call the first witness.", "solution": "The judge asked them to call the first witness."}, {"qText": "The ox asked the dog not to sit there.", "ans": ["The ox said to the dog, \"Not to sit here.\"", "The ox said to the dog,\"Do not sit here.\"", "The ox said to the dog, \"Does not sit here.\"", "The ox said to the dog,\"Did not sit here.\""], "correct": "The ox said to the dog,\"Do not sit here.\"", "solution": "The ox said to the dog,\"Do not sit here.\""}, {"qText": "Sandy said, \"I have already written a letter to my family.\"", "ans": ["Sandy said that she had already written a letter to her family.", "Sandy said that she wrote a letter to her family.", "Sandy said that she was writing a letter her family.", "Sandy said that she will write a letter to her family."], "correct": "Sandy said that she had already written a letter to her family.", "solution": "Sandy said that she had already written a letter to her family."}, {"qText": "She said, \"I will now take rest for sometime.\"", "ans": ["She said that I would now take rest for some time.", "She said that she will then take rest for some time.", "She said that she would then take rest for some time.", "She said that he will then take rest for some time."], "correct": "She said that she would then take rest for some time.", "solution": "She said that she would then take rest for some time."}, {"qText": "\"I finished it several days ago,\" said Jack.", "ans": ["Jack said that he finished it several days previously.", "Jack said that he finished it several days earlier.", "Jack said that he finish it several days ago.", "Jack said that he had finished it several days earlier."], "correct": "Jack said that he had finished it several days earlier.", "solution": "Jack said that he had finished it several days earlier."}, {"qText": "Walter said, \"I cannot do it now.\"", "ans": ["Walter says that he cannot do it now.", "Walter says that he cannot do it then.", "Walter said that he could not do it then.", "Walter said that he could not do it now."], "correct": "Walter said that he could not do it then.", "solution": "Walter said that he could not do it then."}, {"qText": "The student said,\"I am doing my homework.\"", "ans": ["The student said that she was doing her homework.", "The student said that she has been doing her homework.", "The student said that she is doing her homework.", "The student said that she did her homework."], "correct": "The student said that she was doing her homework.", "solution": "The student said that she was doing her homework."}, {"qText": "Mary said, \"I am sorry.\"", "ans": ["Mary said that she was sorry.", "Mary said that she will be sorry.", "Mary says that she is sorry.", "Mary said that she is sorry."], "correct": "Mary said that she was sorry.", "solution": "Mary said that she was sorry."}, {"qText": "\"I'm taking my children to the zoo tomorrow\", she said, \"to see the baby white tiger\".", "ans": ["She said that she will take the children to the zoo to see the baby white tiger tomorrow.", "She said that she would take the children to the zoo the next day to see the baby white tiger.", "She said that she was taking her children to the zoo the next day to see the baby white tiger.", "She said that she was taking the children to the zoo that day to see the baby white tiger."], "correct": "She said that she was taking her children to the zoo the next day to see the baby white tiger.", "solution": "She said that she was taking her children to the zoo the next day to see the baby white tiger."}, {"qText": "\"Call the witness\", said the magistrate.", "ans": ["The magistrate requested to call the witness.", "The magistrate begged for calling the witness.", "The magistrate ordered to call the witness.", "The magistrate prayed to call the witness."], "correct": "The magistrate ordered to call the witness.", "solution": "The magistrate ordered to call the witness."}, {"qText": "\"Be careful; the steps are very slippery\", I warned him.", "ans": ["I warned him to be careful as the steps were very slippery.", "I warned him to be careful as the steps are very slippery.", "I warned him to be careful and steps were very slippery.", "I told him to be careful and the steps are very slippery."], "correct": "I warned him to be careful as the steps were very slippery.", "solution": "I warned him to be careful as the steps were very slippery."}, {"qText": "The girl wondered where the sparrows had gone.", "ans": ["The girl said, \"Oh! Where the sparrows have gone?\"", "The girl said, \"Oh! Where are the sparrows?\"", "The girl said, \"Oh! Where had the sparrows gone?\"", "The girl said, \"Oh! Where have the sparrows gone?\""], "correct": "The girl said, \"Oh! Where have the sparrows gone?\"", "solution": "The girl said, \"Oh! Where have the sparrows gone?\""}, {"qText": "The boss said to his secretary, \"Did you discuss this matter with the manager?\"", "ans": ["The boss asked his secretary whether he discussed that matter with the manager.", "The boss asked his secretary if you have discussed that matter with the manager.", "The boss asked his secretary if he had discussed that matter with the manager.", "The boss asked his secretary if he has discussed that matter with the manager."], "correct": "The boss asked his secretary if he had discussed that matter with the manager.", "solution": "The boss asked his secretary if he had discussed that matter with the manager."}, {"qText": "He asked me if I had been ill.", "ans": ["He said to me, \"Are you ill?\"", "He said to me, \"Were you ill?\"", "He said to me, \"Had you been ill?\"", "He said to me, \"Have you been ill?\""], "correct": "He said to me, \"Were you ill?\"", "solution": "He said to me, \"Were you ill?\""}, {"qText": "Raju said to me that he was going to read a book that week.", "ans": ["Raju said, \"I am going to read a book this week.\"", "Raju said, \"I will be reading a book this week.\"", "Raju said, \"I would be reading a book this week.\"", "Raju said, \"I may read a book this week.\""], "correct": "Raju said, \"I am going to read a book this week.\"", "solution": "Raju said, \"I am going to read a book this week.\""}, {"qText": "John said to me, \"Do you play cricket?\"", "ans": ["John told me whether he played cricket.", "John asked me whether I play cricket.", "John asked me whether he played cricket.", "John asked me whether I played cricket."], "correct": "John asked me whether I played cricket.", "solution": "John asked me whether I played cricket."}, {"qText": "She said, \"My brother is expected to be back today.\"", "ans": ["She said that her brother was expected to be back that day.", "She said her brother was expected to be back today.", "She said that her brother was expected to be back today.", "She said that her brother was expected to be back this day."], "correct": "She said that her brother was expected to be back that day.", "solution": "She said that her brother was expected to be back that day."}, {"qText": "He said, \"I am writing a poem.\"", "ans": ["He said that I am writing a poem.", "He said that he is writing a poem.", "He said that the poem is being written.", "He said that he was writing a poem."], "correct": "He said that he was writing a poem.", "solution": "He said that he was writing a poem."}, {"qText": "You said, \"They were busy the whole day.\"", "ans": ["You said that they had busy the whole day.", "You said that they were busy the whole day.", "You said that they had been busy the whole day.", "You said that they have been busy the whole day."], "correct": "You said that they had been busy the whole day.", "solution": "You said that they had been busy the whole day."}, {"qText": "The receptionist said to Umesh, \"Please be seated and wait for your turn.\"", "ans": ["The receptionist requested Umesh that be seated and wait for his turn.", "The receptionist told Umesh to please be seated and wait for his turn.", "The receptionist requested Umesh that he should be seated and wait for his turn.", "The receptionist requested Umesh to be seated and to wait for his own."], "correct": "The receptionist requested Umesh that he should be seated and wait for his turn.", "solution": "The receptionist requested Umesh that he should be seated and wait for his turn."}]